# MATCH

The `MATCH` statement provides the searching ability based on pattern matching.

A `MATCH` statement defines a search pattern (doc TODO) and uses it to match data stored in the Nebula Graph database and to retrieve the data in the form defined in the `RETURN` clause. A `WHERE` clause (doc TODO) is often used together with the pattern as a filter to the search result.

## Syntax

The syntax of `MATCH` is relatively more flexible compared with that of other query statements such as `GO` or `LOOKUP`. But generally, it can be summarized as follows.

```nGQL
MATCH <pattern> [<WHERE clause>] RETURN <output>
```

## The workflow of MATCH

The `MATCH` statement relies on a **native index** to find a vertex as the origin of the search process. In other words, in a valid `MATCH` statement, **there must be an indexed property, or a specific VID.** For how to index a property, see [Create native index](../14.index-statements/1.create-native-index.md).

>**NOTE:** The native index for VID is created by default.

Then, the `MATCH` statement searches through the pattern to match edges and other vertices.

At last, it retrieves data according to the `RETURN` clause.

> **OpenCypher Compatibility**
> 
> For now, nGQL does not support the following operations:
> 
> * Scan all vertices and edges with `MATCH`.
> * Scan all vertices with one tag or all edges of one edge type with `MATCH`.


## Use patterns in MATCH statements

This topic uses the `nba` dataset as the sample dataset. Before using `MATCH` in the [match on property](#match-modes) mode, make sure there is at least one index for the property. If there are existing data, rebuild the index to make it take effect on all data.

```nGQL
nebula> CREATE TAG INDEX name ON player(name(20)); // Create an index on the name property.
Execution succeeded (time spent 2957/3986 us)

nebula> REBUILD TAG INDEX name; // Rebuild the index.
+------------+
| New Job Id |
+------------+
| 121        |
+------------+
Got 1 rows  (time spent 2676/3990 us)

nebula> SHOW JOB 121; // Make sure the rebuild job succeeded.
+----------------+---------------------+------------+------------+------------+
| Job Id(TaskId) | Command(Dest)       | Status     | Start Time | Stop Time  |
+----------------+---------------------+------------+------------+------------+
| 121            | "REBUILD_TAG_INDEX" | "FINISHED" | 1607073046 | 1607073046 |
+----------------+---------------------+------------+------------+------------+
| 0              | "storaged2"         | "FINISHED" | 1607073046 | 1607073046 |
+----------------+---------------------+------------+------------+------------+
| 1              | "storaged0"         | "FINISHED" | 1607073046 | 1607073046 |
+----------------+---------------------+------------+------------+------------+
| 2              | "storaged1"         | "FINISHED" | 1607073046 | 1607073046 |
+----------------+---------------------+------------+------------+------------+
Got 4 rows (time spent 1186/2998 us)
```

### Match vertices

You can use a user-defined variable in a pair of parentheses to represent a vertex in a pattern. For example: `(v)`.

Tags are specified with `:<tag_name>` and tag properties are specified with `{<prop_name>: <prop_value>}` after the `:<tag_name>`.

The following example uses the name property to match a vertex.

```nGQL
nebula> MATCH (v:player{name:"Tim Duncan"}) RETURN v;
+----------------------------------------------------+
| v                                                  |
+----------------------------------------------------+
| ("player100" :player{name: "Tim Duncan", age: 42}) |
+----------------------------------------------------+
```

The WHERE clause can do the same thing:

```nGQL
nebula> MATCH (v:player) WHERE v.name == "Tim Duncan" RETURN v;
+----------------------------------------------------+
| v                                                  |
+----------------------------------------------------+
| ("player100" :player{name: "Tim Duncan", age: 42}) |
+----------------------------------------------------+
```

> **OpenCypher Compatibility**
>
> * In nGQL, `==` is the equality operator and `=` is the assignment operator (as in C++ or Java).
> * In openCypher 9, `=` is the equality operator.

Or you can use the VID to match a vertex. The `id()` function can retrieve the VID of a vertex.

```nGQL
nebula> MATCH (v) WHERE id(v) == 'player101' RETURN v;
+---------------------------------------------------+
| v                                                 |
+---------------------------------------------------+
| (player101) player.name:Tony Parker,player.age:36 |
+---------------------------------------------------+
Got 1 rows (time spent 1710/2406 us)
```

### Match connected vertices

You can use the `--` symbol to represent an undirected edge between vertices and match connected vertices.

```nGQL
nebula> MATCH (v:player{name:"Tim Duncan"}) -- (v2) RETURN v2.name AS Name
+---------------------+
| Name                |
+---------------------+
| "Tony Parker"       |
+---------------------+
| "LaMarcus Aldridge" |
+---------------------+
| "Marco Belinelli"   |
+---------------------+
| "Danny Green"       |
+---------------------+
| "Aron Baynes"       |
+---------------------+
...
Got 13 rows (time spent 6029/8976 us)
```

And you can add a `>` or `<` symbol to make the edge directed.

```nGQL
nebula> MATCH (v:player{name:"Tim Duncan"}) --> (v2) RETURN v2.name AS Name
+-----------------+
| Name            |
+-----------------+
| "Spurs"         |
+-----------------+
| "Tony Parker"   |
+-----------------+
| "Manu Ginobili" |
+-----------------+
Got 3 rows (time spent 2897/5993 us)
```

To extend the pattern, add more edges and vertices.

```nGQL
nebula> MATCH (v:player{name:"Tim Duncan"}) --> (v2) <-- (v3) RETURN v3.name AS Name
+---------------------+
| Name                |
+---------------------+
| "Tony Parker"       |
+---------------------+
| "Tiago Splitter"    |
+---------------------+
| "Dejounte Murray"   |
+---------------------+
| "Tony Parker"       |
+---------------------+
| "LaMarcus Aldridge" |
+---------------------+
...
Got 24 rows (time spent 5198/6989 us)
```

If you don't need to refer to a vertex, you can omit the variable representing it in the parentheses.

```nGQL
nebula> MATCH (v:player{name:"Tim Duncan"}) --> () <-- (v3) RETURN v3.name AS Name
+---------------------+
| Name                |
+---------------------+
| "Tony Parker"       |
+---------------------+
| "LaMarcus Aldridge" |
+---------------------+
| "Rudy Gay"          |
+---------------------+
| "Danny Green"       |
+---------------------+
| "Kyle Anderson"     |
+---------------------+
...
```

### Match edges

Besides using `--`, `-->`, or `<--` to indicate a nameless edge, you can use a variable in a pair of square brackets to represent a named edge. For example: `[e]`.

Just like tags, edge types are specified with `:<edge_type>` and edge type properties are specified with `{<prop_name>: <prop_value>}` after the `:<edge_type>`.

[To be continued...]

<!-- The following part is the old version of the match doc. To be modified and merged into the new version.

## Examples for matching on property

* Example 1: Search for a specific age and return the names of players of that age. The `v` is a user-defined variable that represents a vertex.

    ```nGQL
    nebula> MATCH (v:player {age: 36}) RETURN v.name AS Name;
    +-------------+
    | Name        |
    +-------------+
    | Tony Parker |
    +-------------+
    Got 1 rows (time spent 2849/3256 us)
    ```

* Example 2: Search for the players whose ages are above 30 and names start with "T", and return their names and ages. Use `STARTS WITH` or `ENDS WITH` to filter strings.

    ```nGQL
    nebula> MATCH (v:player) WHERE v.age > 30 AND v.name STARTS WITH "T" \
           RETURN v.name AS Name, v.age AS Age;
    +-------------+-----+
    | Name        | Age |
    +-------------+-----+
    | Tony Parker | 36  |
    +-------------+-----+
    | Tim         | 42  |
    +-------------+-----+
    Got 2 rows (time spent 2407/3244 us)
    ```

* Example 3: Search for the player whose name is "Tim", and return the player's relationships (edges) with others and the names of these people. The `r` is a user-defined variable that represents an edge. The `type(e)` function returns to the edge type.

    ```nGQL
    nebula> MATCH (v1:player{name: "Tim"}) -[e]-> (v2) \
            RETURN type(e) AS Relationship, v2.name AS Name;
    +--------------+-------------------+
    | Relationship | Name              |
    +--------------+-------------------+
    | follow       | Tony Parker       |
    +--------------+-------------------+
    | follow       | LaMarcus Aldridge |
    +--------------+-------------------+
    | serve        | Warriors          |
    +--------------+-------------------+
    Got 3 rows (time spent 4844/6660 us)
    ```

* Example 3: Search for the team that "Tim" serves, and return the team name, the start year, and the end year. `e:serve` represents edges with the `serve` type.

    ```nGQL
    nebula> MATCH (v1:player{name: "Tim"}) -[e:serve]-> (v2) \
            RETURN v2.name AS Team_Name, e.start_year AS Start_Year, e.end_year AS End_Year;
    +-----------+------------+----------+
    | Team_Name | Start_Year | End_Year |
    +-----------+------------+----------+
    | Warriors  | 1997       | 2016     |
    +-----------+------------+----------+
    Got 1 rows (time spent 2768/3412 us)
    ```

* Example 4: Search for the player whose name is "Tim", find the people that "Tim" follows with age above 35 and the teams they serve, and return the names of the people and teams.

    ```nGQL
    nebula> MATCH (v1:player) -[:follow]-> (v2) -[:serve]-> (v3) \
            WHERE v1.name == "Tim" AND v2.age > 35 \
            RETURN v1.name AS Player, v2.name AS Friend, v3.name AS Friends_Team;
    +--------+-------------+--------------+
    | Player | Friend      | Friends_Team |
    +--------+-------------+--------------+
    | Tim    | Tony Parker | Nuggets      |
    +--------+-------------+--------------+
    Got 1 rows (time spent 3623/4220 us)
    ```

### Examples for matching on ID

* Example 1: Search for the vertex with VID "player100" and return all its information.

    > **NOTE**:
    >
    > * In nGQL, `id()` returns a vertex ID, which is a string.
    > * In openCypher 9, `id()` returns an integer.
    
    ```nGQL
    nebula> MATCH (v) WHERE id(v) == 'player101' RETURN v;
    +---------------------------------------------------+
    | v                                                 |
    +---------------------------------------------------+
    | (player101) player.name:Tony Parker,player.age:36 |
    +---------------------------------------------------+
    Got 1 rows (time spent 1710/2406 us)
    ```

* Example 2: Search for the vertices with VIDs in a specific list and return all their information. A non-existing VID returns nothing.

    ```nGQL
    nebula> MATCH (v) WHERE id(v) IN ['player100', 'player101', 'no_one'] RETURN v;
    +---------------------------------------------------+
    | v                                                 |
    +---------------------------------------------------+
    | (player101) player.name:Tony Parker,player.age:36 |
    +---------------------------------------------------+
    | (player100) player.name:Tim,player.age:42         |
    +---------------------------------------------------+
    Got 2 rows (time spent 1307/2079 us)
    ```

* Example 3: Search for the players with age above 35, and return the VID of the vertices representing these players.

    ```nGQL
    nebula> MATCH (v:player) WHERE v.age > 35 RETURN v.name AS Name, id(v) AS VID;
    +---------------------+-------------+
    | Name                | VID         |
    +---------------------+-------------+
    | "Steve Nash"        | "player136" |
    +---------------------+-------------+
    | "Amar'e Stoudemire" | "player147" |
    +---------------------+-------------+
    | "Vince Carter"      | "player127" |
    +---------------------+-------------+
    | "Jason Kidd"        | "player148" |
    +---------------------+-------------+
    | "Dwyane Wade"       | "player129" |
    +---------------------+-------------+
    | "Paul Gasol"        | "player138" |
    +---------------------+-------------+
    ```
-->