# MATCH

The `MATCH` statement provides the searching ability based on pattern matching.

A `MATCH` statement defines a search pattern (doc TODO) and uses it to match data stored in the Nebula Graph database and to retrieve the data in the form defined in the `RETURN` clause. A `WHERE` clause (doc TODO) is often used together with the pattern as a filter to the search result.

The examples in this topic use the `nba` dataset as the sample dataset.

## Syntax

The syntax of `MATCH` is relatively more flexible compared with that of other query statements such as `GO` or `LOOKUP`. But generally, it can be summarized as follows.

```nGQL
MATCH <pattern> [<WHERE clause>] RETURN <output>
```

## The workflow of MATCH

The `MATCH` statement relies on a **native index** to find a vertex as the origin of the search process. In other words, in a valid `MATCH` statement, **there must be an indexed property or a specific VID.** For how to index a property, see [Create native index](../14.native-index-statements/1.create-native-index.md).

>**NOTE:** The native index for VID is created by default.

Then, the `MATCH` statement searches through the pattern to match edges and other vertices.

At last, it retrieves data according to the `RETURN` clause.

> **OpenCypher compatibility**
>
> For now, nGQL does not support the following operations:
>
> * Scan all vertices and edges with `MATCH`. For example, `MATCH (v) RETURN v`.
> * Scan all vertices with one tag or all edges of one edge type with `MATCH`. For example, `MATCH (v:player) RETURN v`.

## Use patterns in MATCH statements

Make sure there is at least one index for the `MATCH` statement to use. If there are existing data, rebuild the index to make it takes effect on all data.

```nGQL
nebula> CREATE TAG INDEX name ON player(name(20)); // Create an index on the name property.
Execution succeeded (time spent 2957/3986 us)

nebula> REBUILD TAG INDEX name; // Rebuild the index.
+------------+
| New Job Id |
+------------+
| 121        |
+------------+
Got 1 rows  (time spent 2676/3990 us)

nebula> SHOW JOB 121; // Make sure the rebuild job succeeded.
+----------------+---------------------+------------+------------+------------+
| Job Id(TaskId) | Command(Dest)       | Status     | Start Time | Stop Time  |
+----------------+---------------------+------------+------------+------------+
| 121            | "REBUILD_TAG_INDEX" | "FINISHED" | 1607073046 | 1607073046 |
+----------------+---------------------+------------+------------+------------+
| 0              | "storaged2"         | "FINISHED" | 1607073046 | 1607073046 |
+----------------+---------------------+------------+------------+------------+
| 1              | "storaged0"         | "FINISHED" | 1607073046 | 1607073046 |
+----------------+---------------------+------------+------------+------------+
| 2              | "storaged1"         | "FINISHED" | 1607073046 | 1607073046 |
+----------------+---------------------+------------+------------+------------+
Got 4 rows (time spent 1186/2998 us)
```

### Match a vertex

You can use a user-defined variable in a pair of parentheses to represent a vertex in a pattern. For example: `(v)`.

### Match on vertex tag and property

Tags are specified with `:<tag_name>` and tag properties are specified with `{<prop_name>: <prop_value>}` after the `:<tag_name>`.

The following example uses the name property to match a vertex.

```nGQL
nebula> MATCH (v:player{name:"Tim Duncan"}) RETURN v;
+----------------------------------------------------+
| v                                                  |
+----------------------------------------------------+
| ("player100" :player{name: "Tim Duncan", age: 42}) |
+----------------------------------------------------+
```

The `WHERE` clause can do the same thing:

```nGQL
nebula> MATCH (v:player) WHERE v.name == "Tim Duncan" RETURN v;
+----------------------------------------------------+
| v                                                  |
+----------------------------------------------------+
| ("player100" :player{name: "Tim Duncan", age: 42}) |
+----------------------------------------------------+
```

> **OpenCypher compatibility**
>
> * In nGQL, `==` is the equality operator and `=` is the assignment operator (as in C++ or Java).
> * In openCypher 9, `=` is the equality operator.

### Match on VID

You can use the VID to match a vertex. The `id()` function can retrieve the VID of a vertex.

```nGQL
nebula> MATCH (v) WHERE id(v) == 'player101' RETURN v;
+---------------------------------------------------+
| v                                                 |
+---------------------------------------------------+
| (player101) player.name:Tony Parker,player.age:36 |
+---------------------------------------------------+
Got 1 rows (time spent 1710/2406 us)
```

To match on multiple VIDS, use `WHERE id(v) IN [vid_list]`.

```nGQL
nebula> MATCH (v:player { name: 'Tim Duncan' })--(v2) \
        WHERE id(v2) IN ["player101", "player102"] RETURN v2;
+-----------------------------------------------------------+
| v2                                                        |
+-----------------------------------------------------------+
| ("player101" :player{name: "Tony Parker", age: 36})       |
+-----------------------------------------------------------+
| ("player102" :player{name: "LaMarcus Aldridge", age: 33}) |
+-----------------------------------------------------------+
| ("player101" :player{name: "Tony Parker", age: 36})       |
+-----------------------------------------------------------+
Got 3 rows (time spent 3107/3683 us)
```

> **OpenCypher compatibility**
>
> For now, nGQL 2.0 only supports string-type VIDs.

### Match connected vertices

You can use the `--` symbol to represent edges of both directions and match vertices connected by these edges.

> **nGQL compatibility**
>
> * In nGQL 1.x, the `--` symbol is used for inline comments.
> * Starting from nGQL 2.0, the `--` symbol represents an incoming or outgoing edge.

```nGQL
nebula> MATCH (v:player{name:"Tim Duncan"})--(v2) RETURN v2.name AS Name;
+---------------------+
| Name                |
+---------------------+
| "Tony Parker"       |
+---------------------+
| "LaMarcus Aldridge" |
+---------------------+
| "Marco Belinelli"   |
+---------------------+
| "Danny Green"       |
+---------------------+
| "Aron Baynes"       |
+---------------------+
...
Got 13 rows (time spent 6029/8976 us)
```

And you can add a `>` or `<` symbol to specify the direction of the edge.

```nGQL
nebula> MATCH (v:player{name:"Tim Duncan"})-->(v2) RETURN v2.name AS Name;
+-----------------+
| Name            |
+-----------------+
| "Spurs"         |
+-----------------+
| "Tony Parker"   |
+-----------------+
| "Manu Ginobili" |
+-----------------+
Got 3 rows (time spent 2897/5993 us)
```

To extend the pattern, add more edges and vertices.

```nGQL
nebula> MATCH (v:player{name:"Tim Duncan"})-->(v2)<--(v3) RETURN v3.name AS Name;
+---------------------+
| Name                |
+---------------------+
| "Tony Parker"       |
+---------------------+
| "Tiago Splitter"    |
+---------------------+
| "Dejounte Murray"   |
+---------------------+
| "Tony Parker"       |
+---------------------+
| "LaMarcus Aldridge" |
+---------------------+
...
```

If you don't need to refer to a vertex, you can omit the variable representing it in the parentheses.

```nGQL
nebula> MATCH (v:player{name:"Tim Duncan"})-->()<--(v3) RETURN v3.name AS Name;
+---------------------+
| Name                |
+---------------------+
| "Tony Parker"       |
+---------------------+
| "LaMarcus Aldridge" |
+---------------------+
| "Rudy Gay"          |
+---------------------+
| "Danny Green"       |
+---------------------+
| "Kyle Anderson"     |
+---------------------+
...
```

### Match paths

Connected vertices and edges form a path. You can use a user-defined variable as follows to name a path.

```nGQL
nebula> MATCH p=(v:player{name:"Tim Duncan"})-[]->(v2) RETURN p;
+-----------------------------------------+
| p                                    |
+-----------------------------------------+
| ("player100")-[:serve@0]->("player204") |
+-----------------------------------------+
| ("player100")-[:like@0]->("player101")  |
+-----------------------------------------+
| ("player100")-[:like@0]->("player125")  |
+-----------------------------------------+
Got 3 rows (time spent 3717/4573 us)
```

### Match edges

Besides using `--`, `-->`, or `<--` to indicate a nameless edge, you can use a variable in a pair of square brackets to represent a named edge. For example: `-[e]->`.

```nGQL
nebula> MATCH (v:player{name:"Tim Duncan"})-[e]-(v2) RETURN e;
+---------------------------------------------------------------------------+
| e                                                                         |
+---------------------------------------------------------------------------+
| ("player101")-[:like@0{likeness: 95}]->("player100")                      |
+---------------------------------------------------------------------------+
| ("player102")-[:like@0{likeness: 75}]->("player100")                      |
+---------------------------------------------------------------------------+
| ("player104")-[:like@0{likeness: 55}]->("player100")                      |
+---------------------------------------------------------------------------+
...
```

### Match on edge types and properties

Just like tags, edge types are specified with `:<edge_type>`. For example: `-[e:serve]-`.

```nGQL
nebula> MATCH (v:player{name:"Tim Duncan"})-[e:serve]-(v2) RETURN e;
+---------------------------------------------------------------------------+
| e                                                                         |
+---------------------------------------------------------------------------+
| ("player100")-[:serve@0{end_year: 2016, start_year: 1997}]->("player204") |
+---------------------------------------------------------------------------+
Got 1 rows (time spent 5041/5630 us)
```

And edge type properties are specified with `{<prop_name>: <prop_value>}` after the `:<edge_type>`. For example: `[e:like{likeness:95}]`.

```nGQL
nebula> MATCH (v:player{name:"Tim Duncan"})-[e:like{likeness:95}]->(v2) RETURN e;
+------------------------------------------------------+
| e                                                    |
+------------------------------------------------------+
| ("player100")-[:like@0{likeness: 95}]->("player101") |
+------------------------------------------------------+
| ("player100")-[:like@0{likeness: 95}]->("player125") |
+------------------------------------------------------+
Got 2 rows (time spent 6080/6728 us)
```

### Match on multiple edge types

The `|` symbol can help matching on multiple edge types. For example: `[e:like|:serve]`.

```nGQL
nebula> MATCH (v:player{name:"Tim Duncan"})-[e:like|:serve]->(v2) RETURN e;
+---------------------------------------------------------------------------+
| e                                                                         |
+---------------------------------------------------------------------------+
| ("player100")-[:like@0{likeness: 95}]->("player101")                      |
+---------------------------------------------------------------------------+
| ("player100")-[:like@0{likeness: 95}]->("player125")                      |
+---------------------------------------------------------------------------+
| ("player100")-[:serve@0{end_year: 2016, start_year: 1997}]->("player204") |
+---------------------------------------------------------------------------+
Got 3 rows (time spent 4264/4976 us)
```

### Match multiple edges

You can expand a pattern to match multiple edges in a path.

```nGQL
nebula> MATCH (v:player{name:"Tim Duncan"})-[]->(v2)<-[e:serve]-(v3) RETURN v2, v3;
+------------------------------------+-----------------------------------------------------------+
| v2                                 | v3                                                        |
+------------------------------------+-----------------------------------------------------------+
| ("player204" :team{name: "Spurs"}) | ("player101" :player{name: "Tony Parker", age: 36})       |
+------------------------------------+-----------------------------------------------------------+
| ("player204" :team{name: "Spurs"}) | ("player102" :player{name: "LaMarcus Aldridge", age: 33}) |
+------------------------------------+-----------------------------------------------------------+
| ("player204" :team{name: "Spurs"}) | ("player103" :player{age: 32, name: "Rudy Gay"})          |
+------------------------------------+-----------------------------------------------------------+
...
```

### Match fixed-length paths

To match a fixed-length path, use the `:<edge_type>*<hop>` pattern.

```nGQL
nebula> MATCH p=(v:player{name:"Tim Duncan"})-[e:like*2]->(v2) RETURN DISTINCT v2 AS Friends;
+-----------------------------------------------------------+
| Friends                                                   |
+-----------------------------------------------------------+
| ("player100" :player{name: "Tim Duncan", age: 42})        |
+-----------------------------------------------------------+
| ("player102" :player{name: "LaMarcus Aldridge", age: 33}) |
+-----------------------------------------------------------+
| ("player125" :player{name: "Manu Ginobili", age: 41})     |
+-----------------------------------------------------------+
Got 3 rows (time spent 4863/5591 us)
```

### Match variable-length paths

You can use the `:<edge_type>*[minHop]..<maxHop>` pattern to match variable-length paths.

|Parameter|Description|
|-|-|
|`minHop`|Optional. Represents the minimum length of the path. The default value is 1.|
|`maxHop`|Required. Represents the maximum length of the path.|

> **OpenCypher compatibility**
>
> * In nGQL, `maxHop` is required. And `..` cannot be omitted.
> * In openCypher, `maxHop` is optional and default to infinity. When no bounds are given `..` can be omitted.

```nGQL
nebula> MATCH p=(v:player{name:"Tim Duncan"})-[e:like*1..3]->(v2) \
        RETURN v2 AS Friends;
+-----------------------------------------------------------+
| Friends                                                   |
+-----------------------------------------------------------+
| ("player101" :player{age: 36, name: "Tony Parker"})       |
+-----------------------------------------------------------+
| ("player125" :player{name: "Manu Ginobili", age: 41})     |
+-----------------------------------------------------------+
| ("player100" :player{name: "Tim Duncan", age: 42})        |
+-----------------------------------------------------------+
| ("player101" :player{name: "Tony Parker", age: 36})       |
+-----------------------------------------------------------+
| ("player100" :player{name: "Tim Duncan", age: 42})        |
+-----------------------------------------------------------+
| ("player100" :player{name: "Tim Duncan", age: 42})        |
+-----------------------------------------------------------+
| ("player102" :player{name: "LaMarcus Aldridge", age: 33}) |
+-----------------------------------------------------------+
| ("player125" :player{name: "Manu Ginobili", age: 41})     |
+-----------------------------------------------------------+
| ("player100" :player{name: "Tim Duncan", age: 42})        |
+-----------------------------------------------------------+
| ("player101" :player{name: "Tony Parker", age: 36})       |
+-----------------------------------------------------------+
| ("player125" :player{name: "Manu Ginobili", age: 41})     |
+-----------------------------------------------------------+
Got 11 rows (time spent 5426/6473 us)
```

You can use the `DISTINCT` keyword to remove duplicated results.

```nGQL
nebula> MATCH p=(v:player{name:"Tim Duncan"})-[e:like*1..3]->(v2) \
        RETURN DISTINCT v2 AS Friends;
+-----------------------------------------------------------+
| Friends                                                   |
+-----------------------------------------------------------+
| ("player101" :player{name: "Tony Parker", age: 36})       |
+-----------------------------------------------------------+
| ("player125" :player{name: "Manu Ginobili", age: 41})     |
+-----------------------------------------------------------+
| ("player100" :player{name: "Tim Duncan", age: 42})        |
+-----------------------------------------------------------+
| ("player102" :player{name: "LaMarcus Aldridge", age: 33}) |
+-----------------------------------------------------------+
Got 4 rows (time spent 4549/5162 us)
```

### Match variable-length paths with multiple edge types

You can specify multiple edge types in a fixed-length or variable-length pattern. In this case, `hop`, `maxHop`, and `maxHop` takes effect on all edge types.

```nGQL
nebula> MATCH p=(v:player{name:"Tim Duncan"})-[e:like|serve*2]->(v2) \
        RETURN DISTINCT v2;
+-----------------------------------------------------------+
| v2                                                        |
+-----------------------------------------------------------+
| ("player100" :player{name: "Tim Duncan", age: 42})        |
+-----------------------------------------------------------+
| ("player102" :player{name: "LaMarcus Aldridge", age: 33}) |
+-----------------------------------------------------------+
| ("player125" :player{name: "Manu Ginobili", age: 41})     |
+-----------------------------------------------------------+
| ("player204" :team{name: "Spurs"})                        |
+-----------------------------------------------------------+
| ("player215" :team{name: "Hornets"})                      |
+-----------------------------------------------------------+
Got 5 rows (time spent 3834/4571 us)
```

## Common retrieves

This section shows how to retrieve commonly used items with `MATCH` statements.

### Retrieve vertex or edge information

Use `RETURN {<vertex_name> | <edge_name>}` to retrieve all the information of a vertex or an edge.

```nGQL
nebula> MATCH (v:player{name:"Tim Duncan"}) RETURN v;
+----------------------------------------------------+
| v                                                  |
+----------------------------------------------------+
| ("player100" :player{name: "Tim Duncan", age: 42}) |
+----------------------------------------------------+
Got 1 rows (time spent 1863/2545 us)
```

```nGQL
nebula> MATCH (v:player{name:"Tim Duncan"})-[e]->(v2) RETURN e;
+---------------------------------------------------------------------------+
| e                                                                         |
+---------------------------------------------------------------------------+
| ("player100")-[:serve@0{start_year: 1997, end_year: 2016}]->("player204") |
+---------------------------------------------------------------------------+
| ("player100")-[:like@0{likeness: 95}]->("player101")                      |
+---------------------------------------------------------------------------+
| ("player100")-[:like@0{likeness: 95}]->("player125")                      |
+---------------------------------------------------------------------------+
Got 3 rows (time spent 3139/3773 us)
```

### Retrieve VIDs

Use the `id()` function to retrieve VIDs.

```nGQL
nebula> MATCH (v:player{name:"Tim Duncan"}) RETURN id(v);
+-------------+
| id(v)       |
+-------------+
| "player100" |
+-------------+
Got 1 rows (time spent 2070/2747 us)
```

### Retrieve tags

Use the `labels()` function to retrieve the list of tags on a vertex.

```nGQL
nebula> MATCH (v:player{name:"Tim Duncan"}) RETURN labels(v);
+------------+
| labels(v)  |
+------------+
| ["player"] |
+------------+
Got 1 rows (time spent 2198/2941 us)
```

The following example shows how to retrieve the first tag in the list.

```nGQL
nebula> MATCH (v:player{name:"Tim Duncan"}) RETURN labels(v)[0];
+--------------+
| labels(v)[0] |
+--------------+
| "player"     |
+--------------+
Got 1 rows (time spent 2609/3481 us)
```

### Retrieve a single property on a vertex or an edge

Use `RETURN {<vertex_name> | <edge_name>}.<property>` to retrieve a single property.

```nGQL
nebula> MATCH (v:player{name:"Tim Duncan"}) RETURN v.age AS Age;
+-------+
| v.age |
+-------+
| 42    |
+-------+
Got 1 rows (time spent 2261/2973 us)
```

Use `AS` to specify an alias for a property.

```nGQL
nebula> MATCH (v:player{name:"Tim Duncan"}) RETURN v.age AS Age;
+-----+
| Age |
+-----+
| 42  |
+-----+
Got 1 rows (time spent 1762/2321 us)
```

### Retrieve all properties on a vertex or an edge

Use the `properties()` function to retrieve all properties on a vertex or an edge.

```nGQL
nebula> MATCH p=(v:player{name:"Tim Duncan"})-[]->(v2) RETURN properties(v2);
+------------------------------------+
| properties(v2)                     |
+------------------------------------+
| {"name":"Spurs"}                   |
+------------------------------------+
| {"name":"Tony Parker", "age":36}   |
+------------------------------------+
| {"age":41, "name":"Manu Ginobili"} |
+------------------------------------+
Got 3 rows (time spent 2943/3541 us)
```

### Retrieve edge types

Use the `type()` function to retrieve the types of the matched edges.

```nGQL
nebula> MATCH p=(v:player{name:"Tim Duncan"})-[e]->() RETURN type(e);
+---------+
| type(e) |
+---------+
| "serve" |
+---------+
| "like"  |
+---------+
| "like"  |
+---------+
Got 3 rows (time spent 3776/4660 us)
```

### Retrieve paths

Use `RETURN <path_name>` to retrieve all the information of a vertex or an edge.

```nGQL
nebula> MATCH p=(v:player{name:"Tim Duncan"})-[*3]->() RETURN p LIMIT 3;
+-------------------------------------------------------------------------------------------+
| p                                                                                         |
+-------------------------------------------------------------------------------------------+
| ("player100")-[:like@0]->("player101")-[:like@0]->("player100")-[:serve@0]->("player204") |
+-------------------------------------------------------------------------------------------+
| ("player100")-[:like@0]->("player125")-[:like@0]->("player100")-[:serve@0]->("player204") |
+-------------------------------------------------------------------------------------------+
| ("player100")-[:like@0]->("player125")-[:like@0]->("player100")-[:like@0]->("player101")  |
+-------------------------------------------------------------------------------------------+
Got 3 rows (time spent 4592/5278 us)
```

### Retrieve vertices in a path

Use the `nodes()` function to retrieve all vertices in a path.

```nGQL
nebula> MATCH p=(v:player{name:"Tim Duncan"})-[]->(v2) RETURN nodes(p);
+---------------------------------------------------------------------------------------------------------------------+
| nodes(p)                                                                                                            |
+---------------------------------------------------------------------------------------------------------------------+
| [("player100" :star{} :player{age: 42, name: "Tim Duncan"}), ("player204" :team{name: "Spurs"})]                    |
+---------------------------------------------------------------------------------------------------------------------+
| [("player100" :star{} :player{age: 42, name: "Tim Duncan"}), ("player101" :player{name: "Tony Parker", age: 36})]   |
+---------------------------------------------------------------------------------------------------------------------+
| [("player100" :star{} :player{age: 42, name: "Tim Duncan"}), ("player125" :player{name: "Manu Ginobili", age: 41})] |
+---------------------------------------------------------------------------------------------------------------------+
Got 3 rows (time spent 2529/3128 us)
```

### Retrieve edges in a path

Use the `relationships()` function to retrieve all edges in a path.

```nGQL
nebula> MATCH p=(v:player{name:"Tim Duncan"})-[]->(v2) RETURN relationships(p);
+-----------------------------------------------------------------------------+
| relationships(p)                                                            |
+-----------------------------------------------------------------------------+
| [("player100")-[:serve@0{end_year: 2016, start_year: 1997}]->("player204")] |
+-----------------------------------------------------------------------------+
| [("player100")-[:like@0{likeness: 95}]->("player101")]                      |
+-----------------------------------------------------------------------------+
| [("player100")-[:like@0{likeness: 95}]->("player125")]                      |
+-----------------------------------------------------------------------------+
Got 3 rows (time spent 2715/3363 us)
```

### Retrieve path length

Use the `length()` function to retrieve the length of a path.

```nGQL
nebula> MATCH p=(v:player{name:"Tim Duncan"})-[*..2]->(v2) \
        RETURN v2.name AS Name, length(p) AS Length;
+---------------------+--------+
| Name                | Length |
+---------------------+--------+
| "Spurs"             | 2      |
+---------------------+--------+
| "Hornets"           | 2      |
+---------------------+--------+
| "Tim Duncan"        | 2      |
+---------------------+--------+
| "LaMarcus Aldridge" | 2      |
+---------------------+--------+
| "Manu Ginobili"     | 2      |
+---------------------+--------+
| "Spurs"             | 2      |
+---------------------+--------+
| "Tim Duncan"        | 2      |
+---------------------+--------+
| "Spurs"             | 1      |
+---------------------+--------+
| "Tony Parker"       | 1      |
+---------------------+--------+
| "Manu Ginobili"     | 1      |
+---------------------+--------+
Got 10 rows (time spent 3774/4516 us)
```
