# FETCH EDGE

```ngql
FETCH PROP ON <edge_type> <vid> -> <vid>[@<rank>] [, <vid> -> <vid> ...] [YIELD [DISTINCT] <return_list>]

return_list ::=
    [col_name [AS col_alias] [, col_name [AS col_alias]] ...]
```

Use `FETCH` to retrieve properties for edges. [Pipe](../5.operators/4.pipe.md) and [user-defined variables](../4.variable-and-composite-queries/2.user-defined-variables.md) are permitted in a `FETCH` statement.

- **ONLY ONE** edge type is permitted in a singe `FETCH` statement.
- Multiple edges are permitted in a singe `FETCH` statement, separated by commas.
- `YIELD` specifies the properties to be returned. For more information, see [YIELD](../8.clauses-and-options/yield.md).

## Example

```nql
nebula> FETCH PROP ON follow "player100"->"player101";
+----------------------------------------------------+
| edges_                                             |
+----------------------------------------------------+
| [:follow "player100"->"player101" @0 {degree: 95}] |
+----------------------------------------------------+

nebula> FETCH PROP ON follow "player100"->"player101", "player104"->"player101";
+----------------------------------------------------+
| edges_                                             |
+----------------------------------------------------+
| [:follow "player100"->"player101" @0 {degree: 95}] |
+----------------------------------------------------+
| [:follow "player104"->"player101" @0 {degree: 50}] |
+----------------------------------------------------+

nebula> GO FROM "player100" OVER follow \
YIELD follow._src, follow._dst, follow._rank, follow.degree;
+-------------+-------------+--------------+---------------+
| follow._src | follow._dst | follow._rank | follow.degree |
+-------------+-------------+--------------+---------------+
| "player100" | "player101" | 0            | 95            |
+-------------+-------------+--------------+---------------+
| "player100" | "player125" | 0            | 95            |
+-------------+-------------+--------------+---------------+

nebula> GO FROM "player100" OVER follow \
YIELD follow._src AS s, follow._dst AS d | \
FETCH PROP ON follow $-.s -> $-.d YIELD follow.degree;
+-------------+-------------+--------------+---------------+
| follow._src | follow._dst | follow._rank | follow.degree |
+-------------+-------------+--------------+---------------+
| "player100" | "player101" | 0            | 95            |
+-------------+-------------+--------------+---------------+
| "player100" | "player125" | 0            | 95            |
+-------------+-------------+--------------+---------------+

nebula> $var = GO FROM "player100" OVER follow YIELD follow._src AS s, follow._dst AS d; \
FETCH PROP ON follow $var.s -> $var.d YIELD follow.degree;
+-------------+-------------+--------------+---------------+
| follow._src | follow._dst | follow._rank | follow.degree |
+-------------+-------------+--------------+---------------+
| "player100" | "player101" | 0            | 95            |
+-------------+-------------+--------------+---------------+
| "player100" | "player125" | 0            | 95            |
+-------------+-------------+--------------+---------------+
```
