# Nebula Graph CRUD

This topic describes the basic CRUD operations in Nebula Graph.

## Graph space and Nebula Graph schema

A Nebula Graph instance consists of one or more graph spaces. Graph spaces are physically isolated from each other. You can use different graph spaces in the same instance to store different data sets.

![Nebula Graph and graph spaces](https://docs-cdn.nebula-graph.com.cn/docs_2.0/3.quick-start/nebula_graph_instance_and_graph_spaces.png)

Before inserting data into a graph space, you have to define the database schema. Nebula Graph schema is based on the following components.

| Schema component | Description                                                                               |
| ---------------- | ---------------------------------------------------------------------------------------   |
| Vertex           | Represents an entity in the real world. One vertex can have multiple tags.                |
| Tag              | The type of a vertex. It defines a group of properties that describes a type of vertices. |
| Edge             | Represents a **directed** relationship between two vertices.                              |
| Edge type        | The type of an edge. It defines a group of properties that describes a type of edges.     |

For more information, see [Nebula Graph schema](TODO) [TODO].

In this topic, we use the following data set to demonstrate basic CRUD operations.

![The demo dataset](https://docs-cdn.nebula-graph.com.cn/docs_2.0/3.quick-start/demo_dataset_for_quick_start.png)

## Check the machine status in the Nebula Graph cluster

First of all, we recommend that you check the machine status in the Nebula Graph status to make sure all the storage servers (storaged) are connected to the metadata servers (metad). Run `SHOW HOSTS` as follows.

```nGQL
(root@nebula) [(none)]> SHOW HOSTS;
+-----------+-------+--------+--------------+---------------------+------------------------+
| Host      | Port  | Status | Leader count | Leader distribution | Partition distribution |
+-----------+-------+--------+--------------+---------------------+------------------------+
| storaged0 | 44500 | ONLINE | 0            | No valid partition  | No valid partition     |
+-----------+-------+--------+--------------+---------------------+------------------------+
| storaged1 | 44500 | ONLINE | 0            | No valid partition  | No valid partition     |
+-----------+-------+--------+--------------+---------------------+------------------------+
| storaged2 | 44500 | ONLINE | 0            | No valid partition  | No valid partition     |
+-----------+-------+--------+--------------+---------------------+------------------------+
Got 3 rows (time spent 1775/2334 us)
```

From the **Status** column of the table in the return message, we can see that all the storage servers are all online.

## Create and use a graph space

### nGQL syntax

* Create a graph space:

    ```nGQL
    CREATE SPACE <graph space name>(partition_num=<partition number>, replica_factor=<replica number>);
    ```

    | Property       | Description                                                                                                                                                                                                                           |
    | -------------- | ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- |
    | partition_num  | Specifies the number of partitions in each replica. The suggested number is the number of hard disks in the cluster times 5. For example, if you have 3 hard disks in the cluster, we recommend that you set 15 partitions.           |
    | replica_factor | Specifies the number of replicas in the Nebula Graph cluster. The suggested number is 3 in a production environment and 1 in a test environment. The replica number must always be an odd number for the need of quorum-based voting. |

* Check for graph spaces:

    ```nGQL
    SHOW SPACES
    ```

* Use a graph space:

    ```nGQL
    USE <graph space name>
    ```

### Examples

1. Use the following statement to create a graph space named `nba`.

    ```nGQL
    (root@nebula) [(none)]> CREATE SPACE nba(partition_num=15, replica_factor=1);
    Execution succeeded (time spent 2817/3280 us)
    ```

2. Check the partition distribution with `SHOW HOSTS` to make sure the partitions are distributed in a balanced way.

    ```nGQL
    (root@nebula) [(none)]> SHOW HOSTS;
    +-----------+-------+--------+--------------+---------------------+------------------------+
    | Host      | Port  | Status | Leader count | Leader distribution | Partition distribution |
    +-----------+-------+--------+--------------+---------------------+------------------------+
    | storaged0 | 44500 | ONLINE | 1            | nba:5               | nba:5                  |
    +-----------+-------+--------+--------------+---------------------+------------------------+
    | storaged1 | 44500 | ONLINE | 1            | nba:5               | nba:5                  |
    +-----------+-------+--------+--------------+---------------------+------------------------+
    | storaged2 | 44500 | ONLINE | 1            | nba:5               | nba:5                  |
    +-----------+-------+--------+--------------+---------------------+------------------------+
    Got 3 rows (time spent 744/1123 us)
    ```

    If the **Leader distribution** is uneven, use `BALANCE LEADER` to redistribute the partitions. For more information, see [BALANCE](TODO) [TODO].

3. Use the `nba` graph space.

    ```nGQL
    (root@nebula) [(none)]> USE nba;
    Execution succeeded (time spent 1322/2206 us)
    ```

    You can use `SHOW SPACES` to check the graph space you created.

    ```nGQL
    (root@nebula) [nba]> SHOW SPACES;
    +------+
    | Name |
    +------+
    | nba  |
    +------+
    Got 1 rows (time spent 1235/1934 us)
    ```

## Create tags and edge types

### nGQL syntax

```nGQL
CREATE {TAG | EDGE} {<tag name> | <edge type>}(<property name 1> <data type>
[, <property name 2> <data type> ...]);
```

### Examples

Create tags `player` and `team`, edge types `follow` and `serve`.

| Component name | Type | Property |
| -------------- | ---- | -------- |
| player         | Tag       | name (string), age (int)         |
| team           | Tag       | name (string)                    |
| follow         | Edge type | degree (int)                     |
| serve          | Edge type | start_year (int), end_year (int) |

```nGQL
(root@nebula) [nba]> CREATE TAG player(name string, age int);
Execution succeeded (time spent 2694/3116 us)

Thu, 15 Oct 2020 06:22:29 UTC

(root@nebula) [nba]> CREATE TAG team(name string);
Execution succeeded (time spent 2630/3002 us)

Thu, 15 Oct 2020 06:22:37 UTC

(root@nebula) [nba]> CREATE EDGE follow(degree int);
Execution succeeded (time spent 3087/3467 us)

Thu, 15 Oct 2020 06:22:43 UTC

(root@nebula) [nba]> CREATE EDGE serve(start_year int, end_year int);
Execution succeeded (time spent 2645/3123 us)

Thu, 15 Oct 2020 06:22:50 UTC
```

## Create vertices and edges

You can use the `INSERT` statement to create vertices or edges based on existing tags or edge types.

### nGQL syntax

* Create vertices:

    ```nGQL
    INSERT VERTEX <tag> (<property name 1>[, <property name 2>...]) 
    [, <tag> (<property name 3>[, <property name 4>...]), ...] 
    {VALUES | VALUE} "<VID>": (<property value 1>[, <property value2>...]);
    ```

    `VID` is short for vertex ID. It must be a unique int64 value in a graph space.

* Create edges:

    ```nGQL
    INSERT EDGE <edge type> (<property name 1>[, <property name 2>...]) 
    {VALUES | VALUE} <source vid> -> <destination vid>[@<rank>] : (<property value 1>[, <property value 2>...]) 
    [, <source vid> -> <destination vid>[@<rank> : (<property name 1>[, <property name 2>...]), ...]
    ```

### Examples

* Create vertices representing NBA players and teams:

    ```nGQL
    (root@nebula) [nba]> INSERT VERTEX player(name, age) VALUES "player100":("Tim Duncan", 42);
    Execution succeeded (time spent 2919/3485 us)

    Fri, 16 Oct 2020 03:41:00 UTC

    (root@nebula) [nba]> INSERT VERTEX player(name, age) VALUES "player101":("Tony Parker", 36);
    Execution succeeded (time spent 3007/3539 us)

    Fri, 16 Oct 2020 03:41:58 UTC

    (root@nebula) [nba]> INSERT VERTEX player(name, age) VALUES "player102":("LaMarcus Aldridge", 33);
    Execution succeeded (time spent 2449/2934 us)

    Fri, 16 Oct 2020 03:42:16 UTC

    (root@nebula) [nba]> (root@nebula) [nba]> INSERT VERTEX team(name) VALUES "team200":("Warriors"), "team201":("Nuggets");
    Execution succeeded (time spent 3514/4331 us)

    Fri, 16 Oct 2020 03:42:45 UTC
    ```

* Create edges representing the relations between NBA players and teams:

    ```nGQL
    (root@nebula) [nba]> INSERT EDGE follow(degree) VALUES "player100" -> "player101":(95);
    Execution succeeded (time spent 1488/1918 us)

    Wed, 21 Oct 2020 06:57:32 UTC

    (root@nebula) [nba]> INSERT EDGE follow(degree) VALUES "player100" -> "player102":(90);
    Execution succeeded (time spent 2483/2890 us)

    Wed, 21 Oct 2020 07:05:48 UTC

    (root@nebula) [nba]> INSERT EDGE follow(degree) VALUES "player102" -> "player101":(75);
    Execution succeeded (time spent 1208/1689 us)

    Wed, 21 Oct 2020 07:07:12 UTC

    (root@nebula) [nba]> INSERT EDGE serve(start_year, end_year) VALUES "player100" -> "team200":(1997, 2016), "player101" -> "team201":(1999,  2018);
    Execution succeeded (time spent 2170/2651 us)

    Wed, 21 Oct 2020 07:08:59 UTC
    ```

## Read data

You can use the statements `GO`, `FETCH`, and `LOOKUP` to read vertex and edge data.

|Statement|Description|Syntax|
|-|-|-|
|[GO](TODO) [TODO]|The most commonly used read statement. It traverses the database based on specific conditions. A `GO` traversal starts from one or more vertices, along one or more edges, and return information in a form specified in the `GO` command.|`GO [[<M> TO] <N> STEPS ] FROM <vertex list> OVER <edge_type_list> [REVERSELY] [BIDIRECT] [ WHERE <expression> [ AND | OR expression ...]) ] YIELD [DISTINCT] <return_list>`|
|[FETCH](TODO) [TODO]|`FETCH` is used to get properties from vertices or edges.|`FETCH PROP ON {<tag name> | <tag name list> | *} <vid list> [YIELD [DISTINCT] <return list>]`; `FETCH PROP ON <edge_type> <vid> -> <vid>[@<rank>] [, <vid> -> <vid> ...] [YIELD [DISTINCT] <return_list>]`|
|[LOOKUP](TODO) [TODO]|The `LOOKUP` statement is based on [indexes](#about-indexes). It is used together with the `WHERE` clause to search for the data that meet the specific conditions.|`LOOKUP ON {<tag> | <edge type>} WHERE <expression> [ AND expression ...]) ] [YIELD <return list>]`|

* Use `GO`: Find the vertices that VID player100 follows.

    ```nGQL
    (root@nebula) [nba]> GO FROM "player100" OVER follow;
    +-------------+
    | follow._dst |
    +-------------+
    | player101   |
    +-------------+
    | player102   |
    +-------------+
    Got 2 rows (time spent 1935/2420 us)
    ```

* Use `GO`: Search for names and ages of the players whose age is equal to or greater than 35 and that VID "player100" follows. Rename the columns in the result with `Teammate` and `Age`.

    ```nGQL
    (root@nebula) [nba]> GO FROM "player100" OVER follow WHERE $$.player.age >= 35 \
                      -> YIELD $$.player.name AS Teammate, $$.player.age AS Age;
    +-------------+-----+
    | Teammate    | Age |
    +-------------+-----+
    | Tony Parker | 36  |
    +-------------+-----+
    Got 1 rows (time spent 3871/4349 us)
    ```

    |Clause/Sign|Description|
    |-|-|
    |`YIELD`|Specifies what values or results you want to return from the query.|
    |`$$`|Represents the target vertex.|
    |`\`|A line-breaker.|

* Use `GO`: Search for the team served by the players who are followed by the player with VID player100. We can use a pipe or a temporary variable in the command to combine queries.

  * With a pipe:

    ```nGQL
    (root@nebula) [nba]> GO FROM "player100" OVER follow YIELD follow._dst AS id | \
                      -> GO FROM $-.id OVER serve YIELD $$.team.name AS Team, \
                      -> $^.player.name AS Player;
    +---------+-------------+
    | Team    | Player      |
    +---------+-------------+
    | Nuggets | Tony Parker |
    +---------+-------------+
    Got 1 rows (time spent 2902/3496 us)
    ```

    |Clause/Sign|Description|
    |-|-|
    |`$^`|Represents the source vertex of the edge.|
    |`\`||A pipe sign that can combine multiple queries.|
    |`$-`|Represents the output of the query before the pipe sign.|

  * With a temporary variable:

    > **NOTE**: Once a compound statement is submitted to the server as a whole, the life cycle of the temporary variables in the statement ends.

    ```nGQL
    (root@nebula) [nba]> $var = GO FROM "player100" OVER follow YIELD follow._dst AS id; \
                      -> GO FROM $var.id OVER serve YIELD $$.team.name AS Team, \
                      -> $^.player.name AS Player;
    +---------+-------------+
    | Team    | Player      |
    +---------+-------------+
    | Nuggets | Tony Parker |
    +---------+-------------+
    Got 1 rows (time spent 3103/3711 us)
    ```

* Use `FETCH`: Fetch the data of the player with VID player100.

    ```nGQL
    (root@nebula) [nba]> FETCH PROP ON player "player100";
    +----------+-------------+------------+
    | VertexID  | player.name | player.age |
    +----------+-------------+------------+
    | player100 | Tim Duncan  | 42         |
    +----------+-------------+------------+
    Got 1 rows (time spent 2006/2406 us)
    ```

* Use `LOOKUP`: Find the information of the vertex with the tag `player` and have the name `"Tony Parker"`.

```nGQL
[TODO]
```

## Update vertices and edges

You can use the `UPDATE` statement or the `UPSERT` statement to update existing data. 

`UPSERT` is the combination of `UPDATE` and `INSERT`. If we update a vertex or an edge with `UPSERT`, it creates a new vertex or edge if it does not exist.

### nGQL syntax

* `UPDATE` vertices:

```nGQL
UPDATE VERTEX <vid> SET <properties to be updated> 
[WHEN <condition>] [YIELD <columns>]
```

* `UPDATE` edges:

```nGQL
UPDATE EDGE <source vid> -> <destination vid> [@rank] OF <edge type> 
SET <properties to be updated> [WHEN <condition>] [YIELD <columns to be output>]
```

* `UPSERT` vertices or edges:

```nGQL
UPSERT {VERTEX <vid> | EDGE <edge type>} SET <update_columns> 
[WHEN <condition>] [YIELD <columns>]
```

### Examples

* `UPDATE` the `name` property of the vertex with VID player100 and check the result with the `FETCH` statement:

    ```nGQL
    (root@nebula) [nba]> UPDATE VERTEX "player100" SET player.name = "Tim";
    Execution succeeded (time spent 3483/3914 us)

    Wed, 21 Oct 2020 10:53:14 UTC

    (root@nebula) [nba]> FETCH PROP ON player "player100";
    +----------+-------------+------------+
    | VertexID  | player.name | player.age |
    +----------+-------------+------------+
    | player100 | Tim         | 42         |
    +----------+-------------+------------+
    Got 1 rows (time spent 2463/3042 us)
    ```

* `UPDATE` the degree value of an edge and check the result with the `FETCH` statement:

    ```nGQL
    (root@nebula) [nba]> UPDATE EDGE "player100" -> "player101" OF follow SET degree = 96;
    Execution succeeded (time spent 3932/4432 us)

    (root@nebula) [nba]> FETCH PROP ON follow "player100" -> "player101";
    +-------------+-------------+--------------+---------------+
    | follow._src | follow._dst | follow._rank | follow.degree |
    +-------------+-------------+--------------+---------------+
    | player100   | player101   | 0            | 96            |
    +-------------+-------------+--------------+---------------+
    Got 1 rows (time spent 2205/2800 us)
    ```

* Create a vertex with VID 111 and `UPSERT` it.

    ```nGQL
    (root@nebula) [nba]> INSERT VERTEX player(name, age) VALUES "111":("Ben Simmons", 22);
    Execution succeeded (time spent 2115/2900 us)

    Wed, 21 Oct 2020 11:11:50 UTC

    (root@nebula) [nba]> UPSERT VERTEX "111" SET player.name = "Dwight Howard", player.age = $^.player.age + 11 \
                      -> WHEN $^.player.name == "Ben Simmons" && $^.player.age > 20 \
                      -> YIELD $^.player.name AS Name, $^.player.age AS Age;
    +---------------+-----+
    | Name          | Age |
    +---------------+-----+
    | Dwight Howard | 33  |
    +---------------+-----+
    Got 1 rows (time spent 1815/2329 us)
    ```

## Delete vertices and edges

### nGQL syntax

* Delete vertices:

```nGQL
DELETE VERTEX <vid1>[, <vid2>...]
```

* Delete edges:

```nGQL
DELETE EDGE <edge type> <source vid> -> <destination vid>[@<rank>] 
[, <source vid> -> <destination vid>...]
```

### Examples

* Delete vertices:

```nGQL
(root@nebula) [nba]> DELETE VERTEX "team1", "team2";
Execution succeeded (time spent 4337/4782 us)
```

* Delete edges:

```nGQL
(root@nebula) [nba]> DELETE EDGE follow "team1" -> "team2";
Execution succeeded (time spent 3700/4101 us)
```

## About indexes

You can add indexes to tags or edge types with the `CREATE INDEX` command. For more information, see [Nebula Graph indexes](TODO) [TODO].

### Must-read for using index

* Appropriate use of indexes can speed up queries, but indexes also decrease the write performance. **DO NOT** use them in production environments unless you are fully aware of their influences on your service.

* Rebuild indexes for pre-existing data. Otherwise, the pre-existing data can't be accessed by the indexes. For more information, see [Rebuild indexes](TODO) [TODO].

### nGQL syntax

Create an index:

```nGQL
CREATE {TAG | EDGE} INDEX [IF NOT EXISTS] <index_name>
ON {<tag_name> | <edge_name>} (prop_name_list);
```

### Examples

Create an index for the `name` property on all vertices with the tag `player`.

```nGQL
CREATE TAG INDEX player_index_0 on player(name);
```
