



<!doctype html>
<html lang="en" class="no-js">
  <head>
    
      <meta charset="utf-8">
      <meta name="viewport" content="width=device-width,initial-scale=1">
      <meta http-equiv="x-ua-compatible" content="ie=edge">
      
        <meta name="description" content="Documentation for Nebula Graph">
      
      
        <link rel="canonical" href="https://docs.nebula-graph.io/manual-EN/5.appendix/cypher-ngql/">
      
      
        <meta name="author" content="Nebula Graph">
      
      
        <meta name="lang:clipboard.copy" content="Copy to clipboard">
      
        <meta name="lang:clipboard.copied" content="Copied to clipboard">
      
        <meta name="lang:search.language" content="en">
      
        <meta name="lang:search.pipeline.stopwords" content="True">
      
        <meta name="lang:search.pipeline.trimmer" content="True">
      
        <meta name="lang:search.result.none" content="No matching documents">
      
        <meta name="lang:search.result.one" content="1 matching document">
      
        <meta name="lang:search.result.other" content="# matching documents">
      
        <meta name="lang:search.tokenizer" content="[\s\-]+">
      
      <link rel="shortcut icon" href="../../../assets/images/favicon.ico">
      <meta name="generator" content="mkdocs-1.1, mkdocs-material-4.6.3">
    
    
      
        <title>Cypher & nGQL - Nebula Graph Manual</title>
      
    
    
      <link rel="stylesheet" href="../../../assets/stylesheets/application.adb8469c.css">
      
        <link rel="stylesheet" href="../../../assets/stylesheets/application-palette.a8b3c06d.css">
      
      
        
        
        <meta name="theme-color" content="#3f51b5">
      
    
    
      <script src="../../../assets/javascripts/modernizr.86422ebf.js"></script>
    
    
      
        <link href="https://fonts.gstatic.com" rel="preconnect" crossorigin>
        <link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Roboto:300,400,400i,700%7CRoboto+Mono&display=fallback">
        <style>body,input{font-family:"Roboto","Helvetica Neue",Helvetica,Arial,sans-serif}code,kbd,pre{font-family:"Roboto Mono","Courier New",Courier,monospace}</style>
      
    
    <link rel="stylesheet" href="../../../assets/fonts/material-icons.css">
    
    
    
      
    
    
  </head>
  
    
    
    <body dir="ltr" data-md-color-primary="indigo" data-md-color-accent="indigo">
  
    <svg class="md-svg">
      <defs>
        
        
          <svg xmlns="http://www.w3.org/2000/svg" width="416" height="448" viewBox="0 0 416 448" id="__github"><path fill="currentColor" d="M160 304q0 10-3.125 20.5t-10.75 19T128 352t-18.125-8.5-10.75-19T96 304t3.125-20.5 10.75-19T128 256t18.125 8.5 10.75 19T160 304zm160 0q0 10-3.125 20.5t-10.75 19T288 352t-18.125-8.5-10.75-19T256 304t3.125-20.5 10.75-19T288 256t18.125 8.5 10.75 19T320 304zm40 0q0-30-17.25-51T296 232q-10.25 0-48.75 5.25Q229.5 240 208 240t-39.25-2.75Q130.75 232 120 232q-29.5 0-46.75 21T56 304q0 22 8 38.375t20.25 25.75 30.5 15 35 7.375 37.25 1.75h42q20.5 0 37.25-1.75t35-7.375 30.5-15 20.25-25.75T360 304zm56-44q0 51.75-15.25 82.75-9.5 19.25-26.375 33.25t-35.25 21.5-42.5 11.875-42.875 5.5T212 416q-19.5 0-35.5-.75t-36.875-3.125-38.125-7.5-34.25-12.875T37 371.5t-21.5-28.75Q0 312 0 260q0-59.25 34-99-6.75-20.5-6.75-42.5 0-29 12.75-54.5 27 0 47.5 9.875t47.25 30.875Q171.5 96 212 96q37 0 70 8 26.25-20.5 46.75-30.25T376 64q12.75 25.5 12.75 54.5 0 21.75-6.75 42 34 40 34 99.5z"/></svg>
        
      </defs>
    </svg>
    <input class="md-toggle" data-md-toggle="drawer" type="checkbox" id="__drawer" autocomplete="off">
    <input class="md-toggle" data-md-toggle="search" type="checkbox" id="__search" autocomplete="off">
    <label class="md-overlay" data-md-component="overlay" for="__drawer"></label>
    
      <a href="#comparison_between_cypher_and_ngql" tabindex="0" class="md-skip">
        Skip to content
      </a>
    
    
      <header class="md-header" data-md-component="header">
  <nav class="md-header-nav md-grid">
    <div class="md-flex">
      <div class="md-flex__cell md-flex__cell--shrink">
        <a href="https://docs.nebula-graph.io" title="Nebula Graph Manual" aria-label="Nebula Graph Manual" class="md-header-nav__button md-logo">
          
            <i class="md-icon">library_books</i>
          
        </a>
      </div>
      <div class="md-flex__cell md-flex__cell--shrink">
        <label class="md-icon md-icon--menu md-header-nav__button" for="__drawer"></label>
      </div>
      <div class="md-flex__cell md-flex__cell--stretch">
        <div class="md-flex__ellipsis md-header-nav__title" data-md-component="title">
          
            <span class="md-header-nav__topic">
              Nebula Graph Manual
            </span>
            <span class="md-header-nav__topic">
              
                Cypher & nGQL
              
            </span>
          
        </div>
      </div>
      <div class="md-flex__cell md-flex__cell--shrink">
        
          <label class="md-icon md-icon--search md-header-nav__button" for="__search"></label>
          
<div class="md-search" data-md-component="search" role="dialog">
  <label class="md-search__overlay" for="__search"></label>
  <div class="md-search__inner" role="search">
    <form class="md-search__form" name="search">
      <input type="text" class="md-search__input" aria-label="search" name="query" placeholder="Search" autocapitalize="off" autocorrect="off" autocomplete="off" spellcheck="false" data-md-component="query" data-md-state="active">
      <label class="md-icon md-search__icon" for="__search"></label>
      <button type="reset" class="md-icon md-search__icon" data-md-component="reset" tabindex="-1">
        &#xE5CD;
      </button>
    </form>
    <div class="md-search__output">
      <div class="md-search__scrollwrap" data-md-scrollfix>
        <div class="md-search-result" data-md-component="result">
          <div class="md-search-result__meta">
            Type to start searching
          </div>
          <ol class="md-search-result__list"></ol>
        </div>
      </div>
    </div>
  </div>
</div>
        
      </div>
      
        <div class="md-flex__cell md-flex__cell--shrink">
          <div class="md-header-nav__source">
            


  

<a href="https://github.com/vesoft-inc/nebula" title="Go to repository" class="md-source" data-md-source="github">
  
    <div class="md-source__icon">
      <svg viewBox="0 0 24 24" width="24" height="24">
        <use xlink:href="#__github" width="24" height="24"></use>
      </svg>
    </div>
  
  <div class="md-source__repository">
    vesoft-inc/nebula
  </div>
</a>
          </div>
        </div>
      
    </div>
  </nav>
</header>
    
    <div class="md-container">
      
        
      
      
      <main class="md-main" role="main">
        <div class="md-main__inner md-grid" data-md-component="container">
          
            
              <div class="md-sidebar md-sidebar--primary" data-md-component="navigation">
                <div class="md-sidebar__scrollwrap">
                  <div class="md-sidebar__inner">
                    <nav class="md-nav md-nav--primary" data-md-level="0">
  <label class="md-nav__title md-nav__title--site" for="__drawer">
    <a href="https://docs.nebula-graph.io" title="Nebula Graph Manual" class="md-nav__button md-logo">
      
        <i class="md-icon">library_books</i>
      
    </a>
    Nebula Graph Manual
  </label>
  
    <div class="md-nav__source">
      


  

<a href="https://github.com/vesoft-inc/nebula" title="Go to repository" class="md-source" data-md-source="github">
  
    <div class="md-source__icon">
      <svg viewBox="0 0 24 24" width="24" height="24">
        <use xlink:href="#__github" width="24" height="24"></use>
      </svg>
    </div>
  
  <div class="md-source__repository">
    vesoft-inc/nebula
  </div>
</a>
    </div>
  
  <ul class="md-nav__list" data-md-scrollfix>
    
      
      
      


  <li class="md-nav__item">
    <a href="../../../language/" title="Language" class="md-nav__link">
      Language
    </a>
  </li>

    
      
      
      


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-2" type="checkbox" id="nav-2">
    
    <label class="md-nav__link" for="nav-2">
      Overview
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="1">
      <label class="md-nav__title" for="nav-2">
        Overview
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../0.about-this-manual/" title="Introduction" class="md-nav__link">
      Introduction
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-2-2" type="checkbox" id="nav-2-2">
    
    <label class="md-nav__link" for="nav-2-2">
      Concepts
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="2">
      <label class="md-nav__title" for="nav-2-2">
        Concepts
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../1.overview/1.concepts/1.data-model/" title="Data Model" class="md-nav__link">
      Data Model
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../1.overview/1.concepts/2.nGQL-overview/" title="nGQL Overview" class="md-nav__link">
      nGQL Overview
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-2-3" type="checkbox" id="nav-2-3">
    
    <label class="md-nav__link" for="nav-2-3">
      Quick Start
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="2">
      <label class="md-nav__title" for="nav-2-3">
        Quick Start
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../1.overview/2.quick-start/1.get-started/" title="Get Started" class="md-nav__link">
      Get Started
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../1.overview/2.quick-start/2.FAQ/" title="FAQ" class="md-nav__link">
      FAQ
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../1.overview/2.quick-start/3.supported-clients/" title="Supported Clients" class="md-nav__link">
      Supported Clients
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../3.build-develop-and-administration/1.build/1.build-source-code/" title="Build Source Code" class="md-nav__link">
      Build Source Code
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../3.build-develop-and-administration/3.deploy-and-administrations/deployment/deploy-cluster/" title="Deploy Cluster" class="md-nav__link">
      Deploy Cluster
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../3.build-develop-and-administration/3.deploy-and-administrations/server-administration/storage-service-administration/data-import/import-csv-file/" title="Import .csv File" class="md-nav__link">
      Import .csv File
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../3.build-develop-and-administration/3.deploy-and-administrations/server-administration/storage-service-administration/data-import/download-and-ingest-sst-file/" title="Ingest .sst File" class="md-nav__link">
      Ingest .sst File
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-2-4" type="checkbox" id="nav-2-4">
    
    <label class="md-nav__link" for="nav-2-4">
      Design and Architecture
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="2">
      <label class="md-nav__title" for="nav-2-4">
        Design and Architecture
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../1.overview/3.design-and-architecture/1.design-and-architecture/" title="Design and Architecture" class="md-nav__link">
      Design and Architecture
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../1.overview/3.design-and-architecture/2.storage-design/" title="Storage Design" class="md-nav__link">
      Storage Design
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../1.overview/3.design-and-architecture/3.query-engine/" title="Query Engine" class="md-nav__link">
      Query Engine
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
      </ul>
    </nav>
  </li>

    
      
      
      


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-3" type="checkbox" id="nav-3">
    
    <label class="md-nav__link" for="nav-3">
      Query Language
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="1">
      <label class="md-nav__title" for="nav-3">
        Query Language
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-3-1" type="checkbox" id="nav-3-1">
    
    <label class="md-nav__link" for="nav-3-1">
      Data Types
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="2">
      <label class="md-nav__title" for="nav-3-1">
        Data Types
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../2.query-language/1.data-types/data-types/" title="Data Types" class="md-nav__link">
      Data Types
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../2.query-language/1.data-types/type-conversion/" title="Type Conversion" class="md-nav__link">
      Type Conversion
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-3-2" type="checkbox" id="nav-3-2">
    
    <label class="md-nav__link" for="nav-3-2">
      Functions and Operators
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="2">
      <label class="md-nav__title" for="nav-3-2">
        Functions and Operators
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../2.query-language/2.functions-and-operators/bitwise-operators/" title="Bitwise Operators" class="md-nav__link">
      Bitwise Operators
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../2.query-language/2.functions-and-operators/built-in-functions/" title="Built in Functions" class="md-nav__link">
      Built in Functions
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../2.query-language/2.functions-and-operators/comparison-functions-and-operators/" title="Comparison Functions and Operators" class="md-nav__link">
      Comparison Functions and Operators
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../2.query-language/2.functions-and-operators/group-by-function/" title="Aggregate GROUP BY Functions" class="md-nav__link">
      Aggregate GROUP BY Functions
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../2.query-language/2.functions-and-operators/limit-syntax/" title="LIMIT Syntax" class="md-nav__link">
      LIMIT Syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../2.query-language/2.functions-and-operators/logical-operators/" title="Logical Operators" class="md-nav__link">
      Logical Operators
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../2.query-language/2.functions-and-operators/operator-precedence/" title="Operator Precedence" class="md-nav__link">
      Operator Precedence
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../2.query-language/2.functions-and-operators/order-by-function/" title="ORDER BY Function" class="md-nav__link">
      ORDER BY Function
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../2.query-language/2.functions-and-operators/set-operations/" title="Set Operations" class="md-nav__link">
      Set Operations
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../2.query-language/2.functions-and-operators/uuid/" title="UUID Function" class="md-nav__link">
      UUID Function
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-3-3" type="checkbox" id="nav-3-3">
    
    <label class="md-nav__link" for="nav-3-3">
      Language Structure
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="2">
      <label class="md-nav__title" for="nav-3-3">
        Language Structure
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-3-3-1" type="checkbox" id="nav-3-3-1">
    
    <label class="md-nav__link" for="nav-3-3-1">
      Literal Values
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="3">
      <label class="md-nav__title" for="nav-3-3-1">
        Literal Values
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../2.query-language/3.language-structure/literal-values/boolean-literals/" title="Boolean Literals" class="md-nav__link">
      Boolean Literals
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../2.query-language/3.language-structure/literal-values/numeric-literals/" title="Numeric Literals" class="md-nav__link">
      Numeric Literals
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../2.query-language/3.language-structure/literal-values/string-literals/" title="String Literals" class="md-nav__link">
      String Literals
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../2.query-language/3.language-structure/comment-syntax/" title="Comment Syntax" class="md-nav__link">
      Comment Syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../2.query-language/3.language-structure/identifier-case-sensitivity/" title="Identifer Case Sensitivity" class="md-nav__link">
      Identifer Case Sensitivity
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../2.query-language/3.language-structure/pipe-syntax/" title="Pipe Syntax" class="md-nav__link">
      Pipe Syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../2.query-language/3.language-structure/property-reference/" title="Property Reference" class="md-nav__link">
      Property Reference
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../2.query-language/3.language-structure/schema-object-names/" title="Schema Object Names" class="md-nav__link">
      Schema Object Names
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../2.query-language/3.language-structure/statement-composition/" title="Statement Composition" class="md-nav__link">
      Statement Composition
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../2.query-language/3.language-structure/user-defined-variables/" title="User Defined Variables" class="md-nav__link">
      User Defined Variables
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-3-4" type="checkbox" id="nav-3-4">
    
    <label class="md-nav__link" for="nav-3-4">
      Statement Syntax
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="2">
      <label class="md-nav__title" for="nav-3-4">
        Statement Syntax
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-3-4-1" type="checkbox" id="nav-3-4-1">
    
    <label class="md-nav__link" for="nav-3-4-1">
      Data Definition Statements
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="3">
      <label class="md-nav__title" for="nav-3-4-1">
        Data Definition Statements
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../2.query-language/4.statement-syntax/1.data-definition-statements/alter-tag-edge-syntax/" title="ALTER TAG EDGE Syntax" class="md-nav__link">
      ALTER TAG EDGE Syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../2.query-language/4.statement-syntax/1.data-definition-statements/create-space-syntax/" title="CREATE SPACE Syntax" class="md-nav__link">
      CREATE SPACE Syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../2.query-language/4.statement-syntax/1.data-definition-statements/create-tag-edge-syntax/" title="CREATE TAG EDGE Syntax" class="md-nav__link">
      CREATE TAG EDGE Syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../2.query-language/4.statement-syntax/1.data-definition-statements/drop-edge-syntax/" title="DROP EDGE Syntax" class="md-nav__link">
      DROP EDGE Syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../2.query-language/4.statement-syntax/1.data-definition-statements/drop-space-syntax/" title="DROP SPACE Syntax" class="md-nav__link">
      DROP SPACE Syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../2.query-language/4.statement-syntax/1.data-definition-statements/drop-tag-syntax/" title="DROP TAG Syntax" class="md-nav__link">
      DROP TAG Syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../2.query-language/4.statement-syntax/1.data-definition-statements/" title="INDEX Syntax" class="md-nav__link">
      INDEX Syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../2.query-language/4.statement-syntax/1.data-definition-statements/TTL/" title="TTL" class="md-nav__link">
      TTL
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-3-4-2" type="checkbox" id="nav-3-4-2">
    
    <label class="md-nav__link" for="nav-3-4-2">
      Data Query and Manipulation Statements
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="3">
      <label class="md-nav__title" for="nav-3-4-2">
        Data Query and Manipulation Statements
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../2.query-language/4.statement-syntax/2.data-query-and-manipulation-statements/delete-edge-syntax/" title="DELETE EDGE Syntax" class="md-nav__link">
      DELETE EDGE Syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../2.query-language/4.statement-syntax/2.data-query-and-manipulation-statements/delete-vertex-syntax/" title="DELETE VERTEX Syntax" class="md-nav__link">
      DELETE VERTEX Syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../2.query-language/4.statement-syntax/2.data-query-and-manipulation-statements/fetch-syntax/" title="FETCH Syntax" class="md-nav__link">
      FETCH Syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../2.query-language/4.statement-syntax/2.data-query-and-manipulation-statements/go-syntax/" title="GO Syntax" class="md-nav__link">
      GO Syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../2.query-language/4.statement-syntax/2.data-query-and-manipulation-statements/insert-edge-syntax/" title="INSERT EDGE Syntax" class="md-nav__link">
      INSERT EDGE Syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../2.query-language/4.statement-syntax/2.data-query-and-manipulation-statements/insert-vertex-syntax/" title="INSERT VERTEX Syntax" class="md-nav__link">
      INSERT VERTEX Syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../2.query-language/4.statement-syntax/2.data-query-and-manipulation-statements/lookup-syntax/" title="LOOK UP Syntax" class="md-nav__link">
      LOOK UP Syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../2.query-language/4.statement-syntax/2.data-query-and-manipulation-statements/return-syntax/" title="RETURN Syntax" class="md-nav__link">
      RETURN Syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../2.query-language/4.statement-syntax/2.data-query-and-manipulation-statements/update-vertex-edge-syntax/" title="UPDATE VERTEX EDGE Syntax" class="md-nav__link">
      UPDATE VERTEX EDGE Syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../2.query-language/4.statement-syntax/2.data-query-and-manipulation-statements/upsert-syntax/" title="UPSERT Syntax" class="md-nav__link">
      UPSERT Syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../2.query-language/4.statement-syntax/2.data-query-and-manipulation-statements/where-syntax/" title="WHERE Syntax" class="md-nav__link">
      WHERE Syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../2.query-language/4.statement-syntax/2.data-query-and-manipulation-statements/yield-syntax/" title="YIELD Syntax" class="md-nav__link">
      YIELD Syntax
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-3-4-3" type="checkbox" id="nav-3-4-3">
    
    <label class="md-nav__link" for="nav-3-4-3">
      Utility Statements
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="3">
      <label class="md-nav__title" for="nav-3-4-3">
        Utility Statements
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-3-4-3-1" type="checkbox" id="nav-3-4-3-1">
    
    <label class="md-nav__link" for="nav-3-4-3-1">
      SHOW Statements
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="4">
      <label class="md-nav__title" for="nav-3-4-3-1">
        SHOW Statements
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../2.query-language/4.statement-syntax/3.utility-statements/show-statements/show-charset-syntax/" title="SHOW CHARSET Syntax" class="md-nav__link">
      SHOW CHARSET Syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../2.query-language/4.statement-syntax/3.utility-statements/show-statements/show-collation-syntax/" title="SHOW COLLATION Syntax" class="md-nav__link">
      SHOW COLLATION Syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../2.query-language/4.statement-syntax/3.utility-statements/show-statements/show-configs-syntax/" title="SHOW CONFIGS Syntax" class="md-nav__link">
      SHOW CONFIGS Syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../2.query-language/4.statement-syntax/3.utility-statements/show-statements/show-create-space-syntax/" title="SHOW CREATE SPACE Syntax" class="md-nav__link">
      SHOW CREATE SPACE Syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../2.query-language/4.statement-syntax/3.utility-statements/show-statements/show-create-tag-edge-syntax/" title="SHOW CREATE TAG EDGE Syntax" class="md-nav__link">
      SHOW CREATE TAG EDGE Syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../2.query-language/4.statement-syntax/3.utility-statements/show-statements/show-hosts-syntax/" title="SHOW HOSTS Syntax" class="md-nav__link">
      SHOW HOSTS Syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../2.query-language/4.statement-syntax/3.utility-statements/show-statements/show-indexes-syntax/" title="SHOW INDEXES Syntax" class="md-nav__link">
      SHOW INDEXES Syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../2.query-language/4.statement-syntax/3.utility-statements/show-statements/show-parts-syntax/" title="SHOW PARTS Syntax" class="md-nav__link">
      SHOW PARTS Syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../2.query-language/4.statement-syntax/3.utility-statements/show-statements/show-roles-syntax/" title="SHOW ROLES Syntax" class="md-nav__link">
      SHOW ROLES Syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../2.query-language/4.statement-syntax/3.utility-statements/show-statements/show-snapshots-syntax/" title="SHOW SNAPSHOTS Syntax" class="md-nav__link">
      SHOW SNAPSHOTS Syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../2.query-language/4.statement-syntax/3.utility-statements/show-statements/show-spaces-syntax/" title="SHOW SPACES Syntax" class="md-nav__link">
      SHOW SPACES Syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../2.query-language/4.statement-syntax/3.utility-statements/show-statements/show-tags-edges-syntax/" title="SHOW TAGS EDGES Syntax" class="md-nav__link">
      SHOW TAGS EDGES Syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../2.query-language/4.statement-syntax/3.utility-statements/show-statements/show-users-syntax/" title="SHOW USERS Syntax" class="md-nav__link">
      SHOW USERS Syntax
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../2.query-language/4.statement-syntax/3.utility-statements/describe-syntax/" title="DESCRIBE Syntax" class="md-nav__link">
      DESCRIBE Syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../2.query-language/4.statement-syntax/3.utility-statements/use-syntax/" title="USE Syntax" class="md-nav__link">
      USE Syntax
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-3-4-4" type="checkbox" id="nav-3-4-4">
    
    <label class="md-nav__link" for="nav-3-4-4">
      Graph Algorithm
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="3">
      <label class="md-nav__title" for="nav-3-4-4">
        Graph Algorithm
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../2.query-language/4.statement-syntax/4.graph-algorithms/find-path-syntax/" title="FIND PATH Syntax" class="md-nav__link">
      FIND PATH Syntax
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
      </ul>
    </nav>
  </li>

        
      </ul>
    </nav>
  </li>

    
      
      
      


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-4" type="checkbox" id="nav-4">
    
    <label class="md-nav__link" for="nav-4">
      Build Develop and Administration
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="1">
      <label class="md-nav__title" for="nav-4">
        Build Develop and Administration
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-4-1" type="checkbox" id="nav-4-1">
    
    <label class="md-nav__link" for="nav-4-1">
      Build
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="2">
      <label class="md-nav__title" for="nav-4-1">
        Build
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../3.build-develop-and-administration/1.build/1.build-source-code/" title="Build Source Code" class="md-nav__link">
      Build Source Code
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../3.build-develop-and-administration/1.build/2.build-by-docker/" title="Build by Docker" class="md-nav__link">
      Build by Docker
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-4-2" type="checkbox" id="nav-4-2">
    
    <label class="md-nav__link" for="nav-4-2">
      Develop and Interface
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="2">
      <label class="md-nav__title" for="nav-4-2">
        Develop and Interface
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../3.build-develop-and-administration/2.develop-and-interface/kv-interfaces/" title="Kv Value API" class="md-nav__link">
      Kv Value API
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-4-3" type="checkbox" id="nav-4-3">
    
    <label class="md-nav__link" for="nav-4-3">
      Deploy and Administration
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="2">
      <label class="md-nav__title" for="nav-4-3">
        Deploy and Administration
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-4-3-1" type="checkbox" id="nav-4-3-1">
    
    <label class="md-nav__link" for="nav-4-3-1">
      Deployment
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="3">
      <label class="md-nav__title" for="nav-4-3-1">
        Deployment
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../3.build-develop-and-administration/3.deploy-and-administrations/deployment/configuration-description/" title="Configuration Description" class="md-nav__link">
      Configuration Description
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../3.build-develop-and-administration/3.deploy-and-administrations/deployment/deploy-cluster-on-docker/" title="Deploy Cluster on Docker" class="md-nav__link">
      Deploy Cluster on Docker
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../3.build-develop-and-administration/3.deploy-and-administrations/deployment/deploy-cluster/" title="Deploy Cluster" class="md-nav__link">
      Deploy Cluster
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../3.build-develop-and-administration/3.deploy-and-administrations/deployment/install-with-rpm-deb/" title="Install With rpm Package" class="md-nav__link">
      Install With rpm Package
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-4-3-2" type="checkbox" id="nav-4-3-2">
    
    <label class="md-nav__link" for="nav-4-3-2">
      Server Administration
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="3">
      <label class="md-nav__title" for="nav-4-3-2">
        Server Administration
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-4-3-2-1" type="checkbox" id="nav-4-3-2-1">
    
    <label class="md-nav__link" for="nav-4-3-2-1">
      Account Management Statements
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="4">
      <label class="md-nav__title" for="nav-4-3-2-1">
        Account Management Statements
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../3.build-develop-and-administration/3.deploy-and-administrations/server-administration/account-management-statements/alter-user-syntax/" title="ALTER USER Syntax" class="md-nav__link">
      ALTER USER Syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../3.build-develop-and-administration/3.deploy-and-administrations/server-administration/account-management-statements/built-in-roles/" title="Built-in Roles" class="md-nav__link">
      Built-in Roles
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../3.build-develop-and-administration/3.deploy-and-administrations/server-administration/account-management-statements/change-password/" title="CHANGE PASSWORD Syntax" class="md-nav__link">
      CHANGE PASSWORD Syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../3.build-develop-and-administration/3.deploy-and-administrations/server-administration/account-management-statements/create-user-syntax/" title="CREATE USER Syntax" class="md-nav__link">
      CREATE USER Syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../3.build-develop-and-administration/3.deploy-and-administrations/server-administration/account-management-statements/drop-user-syntax/" title="DROP USER Syntax" class="md-nav__link">
      DROP USER Syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../3.build-develop-and-administration/3.deploy-and-administrations/server-administration/account-management-statements/grant-role-syntax/" title="GRANT ROLE Syntax" class="md-nav__link">
      GRANT ROLE Syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../3.build-develop-and-administration/3.deploy-and-administrations/server-administration/account-management-statements/revoke-syntax/" title="REVOKE Syntax" class="md-nav__link">
      REVOKE Syntax
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-4-3-2-2" type="checkbox" id="nav-4-3-2-2">
    
    <label class="md-nav__link" for="nav-4-3-2-2">
      Configuration Statements
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="4">
      <label class="md-nav__title" for="nav-4-3-2-2">
        Configuration Statements
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../3.build-develop-and-administration/3.deploy-and-administrations/server-administration/configuration-statements/configs-syntax/" title="Configs Syntax" class="md-nav__link">
      Configs Syntax
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../3.build-develop-and-administration/3.deploy-and-administrations/server-administration/configuration-statements/log/" title="Log" class="md-nav__link">
      Log
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../3.build-develop-and-administration/3.deploy-and-administrations/server-administration/configuration-statements/log/" title="Logs" class="md-nav__link">
      Logs
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-4-3-2-3" type="checkbox" id="nav-4-3-2-3">
    
    <label class="md-nav__link" for="nav-4-3-2-3">
      Graph Service Administration
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="4">
      <label class="md-nav__title" for="nav-4-3-2-3">
        Graph Service Administration
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../3.build-develop-and-administration/3.deploy-and-administrations/server-administration/graph-service-administration/graph-metrics/" title="Graph Metrics" class="md-nav__link">
      Graph Metrics
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-4-3-2-4" type="checkbox" id="nav-4-3-2-4">
    
    <label class="md-nav__link" for="nav-4-3-2-4">
      Meta Service Administration
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="4">
      <label class="md-nav__title" for="nav-4-3-2-4">
        Meta Service Administration
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../3.build-develop-and-administration/3.deploy-and-administrations/server-administration/meta-service-administration/meta-metrics/" title="Meta Metrics" class="md-nav__link">
      Meta Metrics
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-4-3-2-5" type="checkbox" id="nav-4-3-2-5">
    
    <label class="md-nav__link" for="nav-4-3-2-5">
      Storage Operation
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="4">
      <label class="md-nav__title" for="nav-4-3-2-5">
        Storage Operation
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-4-3-2-5-1" type="checkbox" id="nav-4-3-2-5-1">
    
    <label class="md-nav__link" for="nav-4-3-2-5-1">
      Data Export
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="5">
      <label class="md-nav__title" for="nav-4-3-2-5-1">
        Data Export
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../3.build-develop-and-administration/3.deploy-and-administrations/server-administration/storage-service-administration/data-export/dump-tool/" title="Dump Tool" class="md-nav__link">
      Dump Tool
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-4-3-2-5-2" type="checkbox" id="nav-4-3-2-5-2">
    
    <label class="md-nav__link" for="nav-4-3-2-5-2">
      Data Import
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="5">
      <label class="md-nav__title" for="nav-4-3-2-5-2">
        Data Import
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../3.build-develop-and-administration/3.deploy-and-administrations/server-administration/storage-service-administration/data-import/download-and-ingest-sst-file/" title="Download and Ingest sst File" class="md-nav__link">
      Download and Ingest sst File
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../3.build-develop-and-administration/3.deploy-and-administrations/server-administration/storage-service-administration/data-import/import-csv-file/" title="Import csv File" class="md-nav__link">
      Import csv File
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../3.build-develop-and-administration/3.deploy-and-administrations/server-administration/storage-service-administration/data-import/spark-writer/" title="Spark Writer" class="md-nav__link">
      Spark Writer
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../3.build-develop-and-administration/3.deploy-and-administrations/server-administration/storage-service-administration/cluster-snapshot/" title="Cluster Snapshot" class="md-nav__link">
      Cluster Snapshot
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../3.build-develop-and-administration/3.deploy-and-administrations/server-administration/storage-service-administration/storage-balance/" title="Storage Balance" class="md-nav__link">
      Storage Balance
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../3.build-develop-and-administration/3.deploy-and-administrations/server-administration/storage-service-administration/storage-metrics/" title="Storage Metrics" class="md-nav__link">
      Storage Metrics
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
      </ul>
    </nav>
  </li>

        
      </ul>
    </nav>
  </li>

        
      </ul>
    </nav>
  </li>

    
      
      
      


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-5" type="checkbox" id="nav-5">
    
    <label class="md-nav__link" for="nav-5">
      Contributions
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="1">
      <label class="md-nav__title" for="nav-5">
        Contributions
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../4.contributions/contribute-to-documentation/" title="Contribute to Documentation" class="md-nav__link">
      Contribute to Documentation
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../4.contributions/cpp-coding-style/" title="cpp Coding Style" class="md-nav__link">
      cpp Coding Style
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../4.contributions/developer-documentation-style-guide/" title="Developer Documentation Style Guide" class="md-nav__link">
      Developer Documentation Style Guide
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../4.contributions/how-to-contribute/" title="How to Contribute" class="md-nav__link">
      How to Contribute
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../4.contributions/pull-request-commit-message-guidelines/" title="Pull Request and Commit Message Guidelines" class="md-nav__link">
      Pull Request and Commit Message Guidelines
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

    
      
      
      

  


  <li class="md-nav__item md-nav__item--active md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-6" type="checkbox" id="nav-6" checked>
    
    <label class="md-nav__link" for="nav-6">
      Appendix
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="1">
      <label class="md-nav__title" for="nav-6">
        Appendix
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          

  


  <li class="md-nav__item md-nav__item--active">
    
    <input class="md-toggle md-nav__toggle" data-md-toggle="toc" type="checkbox" id="__toc">
    
      
    
    
      <label class="md-nav__link md-nav__link--active" for="__toc">
        Cypher & nGQL
      </label>
    
    <a href="./" title="Cypher & nGQL" class="md-nav__link md-nav__link--active">
      Cypher & nGQL
    </a>
    
      
<nav class="md-nav md-nav--secondary">
  
  
    
  
  
    <label class="md-nav__title" for="__toc">Table of contents</label>
    <ul class="md-nav__list" data-md-scrollfix>
      
        <li class="md-nav__item">
  <a href="#conceptual_comparisons" class="md-nav__link">
    Conceptual Comparisons
  </a>
  
</li>
      
        <li class="md-nav__item">
  <a href="#basic_graph_operations" class="md-nav__link">
    Basic Graph Operations
  </a>
  
</li>
      
        <li class="md-nav__item">
  <a href="#example_queries" class="md-nav__link">
    Example Queries
  </a>
  
</li>
      
      
      
      
      
    </ul>
  
</nav>
    
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../gremlin-ngql/" title="Gremlin & nGQL" class="md-nav__link">
      Gremlin & nGQL
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../upgrade-guide/" title="Upgrading Nebula Graph" class="md-nav__link">
      Upgrading Nebula Graph
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

    
  </ul>
</nav>
                  </div>
                </div>
              </div>
            
            
              <div class="md-sidebar md-sidebar--secondary" data-md-component="toc">
                <div class="md-sidebar__scrollwrap">
                  <div class="md-sidebar__inner">
                    
<nav class="md-nav md-nav--secondary">
  
  
    
  
  
    <label class="md-nav__title" for="__toc">Table of contents</label>
    <ul class="md-nav__list" data-md-scrollfix>
      
        <li class="md-nav__item">
  <a href="#conceptual_comparisons" class="md-nav__link">
    Conceptual Comparisons
  </a>
  
</li>
      
        <li class="md-nav__item">
  <a href="#basic_graph_operations" class="md-nav__link">
    Basic Graph Operations
  </a>
  
</li>
      
        <li class="md-nav__item">
  <a href="#example_queries" class="md-nav__link">
    Example Queries
  </a>
  
</li>
      
      
      
      
      
    </ul>
  
</nav>
                  </div>
                </div>
              </div>
            
          
          <div class="md-content">
            <article class="md-content__inner md-typeset">
              
                
                
                <h1 id="comparison_between_cypher_and_ngql">Comparison Between Cypher and nGQL<a class="headerlink" href="#comparison_between_cypher_and_ngql" title="Permanent link">&para;</a></h1>
<h2 id="conceptual_comparisons">Conceptual Comparisons<a class="headerlink" href="#conceptual_comparisons" title="Permanent link">&para;</a></h2>
<table>
<thead>
<tr>
<th>Name</th>
<th>Cypher</th>
<th>nGQL</th>
</tr>
</thead>
<tbody>
<tr>
<td>vertex, node</td>
<td>node</td>
<td>vertex</td>
</tr>
<tr>
<td>edge, relationship</td>
<td>relationship</td>
<td>edge</td>
</tr>
<tr>
<td>vertex type</td>
<td>label</td>
<td>tag</td>
</tr>
<tr>
<td>edge type</td>
<td>relationship type</td>
<td>edge type</td>
</tr>
<tr>
<td>vertex identifier</td>
<td>node id generated by default</td>
<td>vid</td>
</tr>
<tr>
<td>edge identifier</td>
<td>edge id generated by default</td>
<td><src, dst, rank></td>
</tr>
</tbody>
</table>
<h2 id="basic_graph_operations">Basic Graph Operations<a class="headerlink" href="#basic_graph_operations" title="Permanent link">&para;</a></h2>
<table>
<thead>
<tr>
<th>Operations</th>
<th>Cypher</th>
<th>nGQL</th>
</tr>
</thead>
<tbody>
<tr>
<td>List all labels/tags</td>
<td>* MATCH (n) RETURN distinct labels(n);  <br/> * call db.labels();</td>
<td>SHOW TAGS</td>
</tr>
<tr>
<td>Insert a vertex with a specified type</td>
<td>CREATE (:Person {age: 16})</td>
<td>INSERT VERTEX <tag_name> (prop_name_list) VALUES \<vid>:(prop_value_list)</td>
</tr>
<tr>
<td>Insert an edge with specified edge type</td>
<td>CREATE (src)-[rel:LIKES]-&gt;(dst) <br/> SET rel.prop = V</td>
<td>INSERT EDGE <edge_type> ( <prop_name_list> ) VALUES <src_vid> -&gt; <dst_vid>[@<ranking>]: ( <prop_value_list> )</td>
</tr>
<tr>
<td>Delete a vertex</td>
<td>MATCH (n) WHERE ID(n) = vid <br/> DETACH DELETE n</td>
<td>DELETE VERTEX \<vid></td>
</tr>
<tr>
<td>Delete an edge</td>
<td>MATCH ()-[r]-&gt;() WHERE ID(r)=edgeID <br/> DELETE r</td>
<td>DELETE EDGE <edge_type> \<src_vid> -&gt; \<dst_vid>[@<ranking>]</td>
</tr>
<tr>
<td>Update a vertex property</td>
<td>SET n.name = V</td>
<td>UPDATE VERTEX \<vid> SET <update_columns></td>
</tr>
<tr>
<td>Fetch vertice prop</td>
<td>MATCH (n) <br/> WHERE ID(n) = vid  <br/> RETURN properties(n)</td>
<td>FETCH PROP ON <tag_name> \<vid></td>
</tr>
<tr>
<td>Fetch edges prop</td>
<td>MATCH (n)-[r]-&gt;() <br/> WHERE ID(r)=edgeID <br/> return properties(r)</td>
<td>FETCH PROP ON <edge_type> <src_vid> -&gt; <dst_vid>[@<ranking>]</td>
</tr>
<tr>
<td>Query a vertex along specified edge type</td>
<td>MATCH (n)-[r:edge_type]-&gt;() WHERE ID(n) = vid</td>
<td>GO FROM \<vid> OVER  \<edge_type></td>
</tr>
<tr>
<td>Query a vertex along specified edge type reversely</td>
<td>MATCH (n)&lt;-[r:edge_type]-() WHERE ID(n) = vid</td>
<td>GO FROM \<vid>  OVER \<edge_type> REVERSELY</td>
</tr>
<tr>
<td>Get the N-Hop along a specified edge type</td>
<td>MATCH (n)-[r:edge_type*N]-&gt;() <br/> WHERE ID(n) = vid <br/> return r</td>
<td>GO N STEPS FROM \<vid> OVER \<edge_type></td>
</tr>
<tr>
<td>Find path between two vertices</td>
<td>MATCH p =(a)-[]-&gt;(b) <br/> WHERE ID(a) = a_vid AND ID(b) = b_vid <br/> RETURN p</td>
<td>FIND ALL PATH FROM \<a_vid> TO \<b_vid> OVER *</td>
</tr>
</tbody>
</table>
<h2 id="example_queries">Example Queries<a class="headerlink" href="#example_queries" title="Permanent link">&para;</a></h2>
<p>The example queries are based on the graph below:</p>
<p><img alt="image" src="https://user-images.githubusercontent.com/42762957/71503167-0e264b80-28af-11ea-87c5-76f4fd1275cd.png" /></p>
<ul>
<li>Insert data</li>
</ul>
<div class="codehilite"><pre><span></span><code># insert vertex
nebula&gt; INSERT VERTEX character(name, age, type) VALUES hash(&quot;saturn&quot;):(&quot;saturn&quot;, 10000, &quot;titan&quot;), hash(&quot;jupiter&quot;):(&quot;jupiter&quot;, 5000, &quot;god&quot;);

# insert edge
nebula&gt; INSERT EDGE father() VALUES hash(&quot;jupiter&quot;)-&gt;hash(&quot;saturn&quot;):();

// cypher
cypher&gt; CREATE (src:character {name:&quot;saturn&quot;, age: 10000, type:&quot;titan&quot;})
      &gt; CREATE (dst:character {name:&quot;jupiter&quot;, age: 5000, type:&quot;god&quot;})
      &gt; CREATE (src)-[rel:father]-&gt;(dst)
 ```

- Delete vertex

```ngql
nebula&gt; DELETE VERTEX hash(&quot;prometheus&quot;);

cypher&gt; MATCH (n:character {name:&quot;prometheus&quot;})
        &gt; DETACH DELETE n
</code></pre></div>


<ul>
<li>Update vertex</li>
</ul>
<div class="codehilite"><pre><span></span><code>nebula&gt; UPDATE VERTEX hash(&quot;jesus&quot;) SET character.type = &#39;titan&#39;;

cypher&gt; MATCH (n:character {name:&quot;jesus&quot;})
      &gt; SET n.type = &#39;titan&#39;
</code></pre></div>


<ul>
<li>Fetch vertices properties</li>
</ul>
<div class="codehilite"><pre><span></span><code>nebula&gt; FETCH PROP ON character hash(&quot;saturn&quot;);
  ===================================================
  | character.name | character.age | character.type |
  ===================================================
  | saturn         | 10000         | titan          |
  ---------------------------------------------------

cypher&gt; MATCH (n:character {name:&quot;saturn&quot;})
      &gt; RETURN properties(n)
  
  &quot;properties(n)&quot;                             
  
  {&quot;name&quot;:&quot;saturn&quot;,&quot;type&quot;:&quot;titan&quot;,&quot;age&quot;:10000}
  
</code></pre></div>


<ul>
<li>Find the name of hercules's grandfather</li>
</ul>
<div class="codehilite"><pre><span></span><code>nebula&gt; GO 2 STEPS FROM hash(&quot;hercules&quot;) OVER father YIELD  $$.character.name;
    =====================
    | $$.character.name |
    =====================
    | saturn            |
    ---------------------

cypher&gt; MATCH (src:character{name:&quot;hercules&quot;})-[r:father*2]-&gt;(dst:character)
      &gt; RETURN dst.name
      
      &quot;dst.name&quot;
      
      &quot;satun&quot;   
      
</code></pre></div>


<ul>
<li>Find the name of hercules's father</li>
</ul>
<div class="codehilite"><pre><span></span><code>nebula&gt; GO FROM hash(&quot;hercules&quot;) OVER father YIELD $$.character.name;
    =====================
    | $$.character.name |
    =====================
    | jupiter           |
    ---------------------

cypher&gt; MATCH (src:character{name:&quot;hercules&quot;})-[r:father]-&gt;(dst:character)
      &gt; RETURN dst.name
      
      &quot;dst.name&quot;
      
      &quot;jupiter&quot; 
      
</code></pre></div>


<ul>
<li>Find the the centenarians' name.</li>
</ul>
<div class="codehilite"><pre><span></span><code>nebula&gt; # coming soon

cypher&gt; MATCH (src:character)
      &gt; WHERE src.age &gt; 100
      &gt; RETURN src.name
      
      &quot;src.name&quot; 
      
        &quot;saturn&quot; 
      
       &quot;jupiter&quot; 
      
       &quot;neptune&quot; 
      
        &quot;pluto&quot;  
      
</code></pre></div>


<ul>
<li>Find who live with pluto</li>
</ul>
<div class="codehilite"><pre><span></span><code>nebula&gt; GO FROM hash(&quot;pluto&quot;) OVER lives YIELD lives._dst AS place | GO FROM $-.place OVER lives REVERSELY WHERE \
      &gt; $$.character.name != &quot;pluto&quot; YIELD $$.character.name AS cohabitants;
    ===============
    | cohabitants |
    ===============
    | cerberus    |
    ---------------

cypher&gt; MATCH (src:character{name:&quot;pluto&quot;})-[r1:lives]-&gt;()&lt;-[r2:lives]-(dst:character)
      &gt; RETURN dst.name
      
      &quot;dst.name&quot;
      
      &quot;cerberus&quot;
      
</code></pre></div>


<ul>
<li>Find pluto's brother and their habitations?</li>
</ul>
<div class="codehilite"><pre><span></span><code>nebula&gt; GO FROM hash(&quot;pluto&quot;) OVER brother YIELD brother._dst AS god | \
      &gt; GO FROM $-.god OVER lives YIELD $^.character.name AS Brother, $$.location.name AS Habitations;
    =========================
    | Brother | Habitations |
    =========================
    | jupiter | sky         |
    -------------------------
    | neptune | sea         |
    -------------------------

cypher&gt; MATCH (src:Character{name:&quot;pluto&quot;})-[r1:brother]-&gt;(bro:Character)-[r2:lives]-&gt;(dst)
      &gt; RETURN bro.name, dst.name
      
      &quot;bro.name&quot;    &quot;dst.name&quot;
      
       &quot;jupiter&quot;      &quot;sky&quot;   
      
       &quot;neptune&quot;     &quot;sea&quot;    
      
</code></pre></div>
                
                  
                
                
              
              
                


              
            </article>
          </div>
        </div>
      </main>
      
        
<footer class="md-footer">
  
    <div class="md-footer-nav">
      <nav class="md-footer-nav__inner md-grid">
        
          <a href="../../4.contributions/pull-request-commit-message-guidelines/" title="Pull Request and Commit Message Guidelines" class="md-flex md-footer-nav__link md-footer-nav__link--prev" rel="prev">
            <div class="md-flex__cell md-flex__cell--shrink">
              <i class="md-icon md-icon--arrow-back md-footer-nav__button"></i>
            </div>
            <div class="md-flex__cell md-flex__cell--stretch md-footer-nav__title">
              <span class="md-flex__ellipsis">
                <span class="md-footer-nav__direction">
                  Previous
                </span>
                Pull Request and Commit Message Guidelines
              </span>
            </div>
          </a>
        
        
          <a href="../gremlin-ngql/" title="Gremlin & nGQL" class="md-flex md-footer-nav__link md-footer-nav__link--next" rel="next">
            <div class="md-flex__cell md-flex__cell--stretch md-footer-nav__title">
              <span class="md-flex__ellipsis">
                <span class="md-footer-nav__direction">
                  Next
                </span>
                Gremlin & nGQL
              </span>
            </div>
            <div class="md-flex__cell md-flex__cell--shrink">
              <i class="md-icon md-icon--arrow-forward md-footer-nav__button"></i>
            </div>
          </a>
        
      </nav>
    </div>
  
  <div class="md-footer-meta md-typeset">
    <div class="md-footer-meta__inner md-grid">
      <div class="md-footer-copyright">
        
          <div class="md-footer-copyright__highlight">
            Copyright &copy; 2020 Nebula Graph
          </div>
        
        powered by
        <a href="https://www.mkdocs.org" target="_blank" rel="noopener">MkDocs</a>
        and
        <a href="https://squidfunk.github.io/mkdocs-material/" target="_blank" rel="noopener">
          Material for MkDocs</a>
      </div>
      
  <div class="md-footer-social">
    <link rel="stylesheet" href="../../../assets/fonts/font-awesome.css">
    
      <a href="https://github.com/vesoft-inc/nebula" target="_blank" rel="noopener" title="github" class="md-footer-social__link fa fa-github"></a>
    
      <a href="https://www.weibo.com/u/7122684542?is_hot=1" target="_blank" rel="noopener" title="weibo" class="md-footer-social__link fa fa-weibo"></a>
    
      <a href="https://twitter.com/NebulaGraph" target="_blank" rel="noopener" title="twitter" class="md-footer-social__link fa fa-twitter"></a>
    
      <a href="https://www.linkedin.com/company/vesoft-nebula-graph/" target="_blank" rel="noopener" title="linkedin" class="md-footer-social__link fa fa-linkedin"></a>
    
      <a href="https://www.facebook.com/NebulaGraph/" target="_blank" rel="noopener" title="facebook" class="md-footer-social__link fa fa-facebook"></a>
    
      <a href="https://app.slack.com/client/TJB3N2BPD/CJNFUM7AR" target="_blank" rel="noopener" title="slack" class="md-footer-social__link fa fa-slack"></a>
    
  </div>

    </div>
  </div>
</footer>
      
    </div>
    
      <script src="../../../assets/javascripts/application.c33a9706.js"></script>
      
      <script>app.initialize({version:"1.1",url:{base:"../../.."}})</script>
      
    
  </body>
</html>