# CONFIG

When you start the NebulaGraph cluster for the first time, the system reads the configuration from the local and saves it in the Meta service. After restarting the cluster, it will also read the configuration from the Meta service. The `CONFIG` statement can modify the NebulaGraph configuration saved in the Meta service without modifying your local files.

!!! Note

    According to past practice, we suggest you fetch the configuration from the local. For details, see [Configuration](../../5.configurations-and-logs/1.configurations/1.configurations.md#Modify configurations).

## SHOW CONFIGS

`SHOW CONFIGS` shows the configuration information for the specified service. When the service is not specified, Nebula Graph returns all the service configurations.

You do not need any privileges for the graph space to run this statement. But the returned results are different based on [privileges](../../7.data-security/1.authentication/3.role-list.md).

### Syntax

```ngql
SHOW CONFIGS [ {META|GRAPH|STORAGE} ];
```

### Examples

```ngql
nebula> SHOW CONFIGS GRAPH;
+---------+---------------------------+--------+-----------+-------+
| module  | name                      | type   | mode      | value |
+---------+---------------------------+--------+-----------+-------+
| "GRAPH" | "v"                       | "int"  | "MUTABLE" | 0     |
+---------+---------------------------+--------+-----------+-------+
| "GRAPH" | "minloglevel"             | "int"  | "MUTABLE" | 0     |
+---------+---------------------------+--------+-----------+-------+
| "GRAPH" | "slow_op_threshhold_ms"   | "int"  | "MUTABLE" | 50    |
+---------+---------------------------+--------+-----------+-------+
| "GRAPH" | "accept_partial_success"  | "bool" | "MUTABLE" | false |
+---------+---------------------------+--------+-----------+-------+
| "GRAPH" | "heartbeat_interval_secs" | "int"  | "MUTABLE" | 10    |
+---------+---------------------------+--------+-----------+-------+
| "GRAPH" | "meta_client_retry_times" | "int"  | "MUTABLE" | 3     |
+---------+---------------------------+--------+-----------+-------+
```

```ngql
nebula> SHOW CONFIGS META;
Empty set (time spent 2059/3429 us)
```

## GET CONFIGS

`GET CONFIGS` gets the specified configuration information for the specified service. When the service is not specified, Nebula Graph returns all the configurations that have the same name.

### Syntax

```ngql
GET CONFIGS [ {GRAPH|STORAGE} :] <configuration_name>;
```

### Examples

```ngql
nebula> GET CONFIGS STORAGE:wal_ttl;
+-----------+-----------+-------+-----------+-------+
| module    | name      | type  | mode      | value |
+-----------+-----------+-------+-----------+-------+
| "STORAGE" | "wal_ttl" | "int" | "MUTABLE" | 14400 |
+-----------+-----------+-------+-----------+-------+
```

```ngql
nebula> GET CONFIGS heartbeat_interval_secs;
+-----------+---------------------------+-------+-----------+-------+
| module    | name                      | type  | mode      | value |
+-----------+---------------------------+-------+-----------+-------+
| "GRAPH"   | "heartbeat_interval_secs" | "int" | "MUTABLE" | 3     |
+-----------+---------------------------+-------+-----------+-------+
| "STORAGE" | "heartbeat_interval_secs" | "int" | "MUTABLE" | 3     |
+-----------+---------------------------+-------+-----------+-------+
```
