# CONFIG syntax

This document gives some introductions to `CONFIG` syntax in nGQL.

## SHOW CONFIGS

```ngql
SHOW CONFIGS [ {META|GRAPH|STORAGE} ]
```

`SHOW CONFIGS` shows the configurations for the specified service. When the service is not specified, Nebula Graph returns all the service configurations. You do not need any privileges for the graph space to run this statement. But the returned results are different based on your account authentication. (TODO: privilege doc)

For example:

```ngql
nebula> SHOW CONFIGS GRAPH;
+---------+---------------------------+-------+-----------+-------+
| module  | name                      | type  | mode      | value |
+---------+---------------------------+-------+-----------+-------+
| "GRAPH" | "v"                       | "int" | "MUTABLE" | 0     |
+---------+---------------------------+-------+-----------+-------+
| "GRAPH" | "minloglevel"             | "int" | "MUTABLE" | 0     |
+---------+---------------------------+-------+-----------+-------+
| "GRAPH" | "slow_op_threshhold_ms"   | "int" | "MUTABLE" | 50    |
+---------+---------------------------+-------+-----------+-------+
| "GRAPH" | "heartbeat_interval_secs" | "int" | "MUTABLE" | 3     |
+---------+---------------------------+-------+-----------+-------+
| "GRAPH" | "meta_client_retry_times" | "int" | "MUTABLE" | 3     |
+---------+---------------------------+-------+-----------+-------+
```

```ngql
nebula> SHOW CONFIGS META;
Empty set (time spent 2059/3429 us)
```

The preceding query returns an empty set because the configurations for Meta Service are immutable in the Console.

## GET CONFIGS

```ngql
GET CONFIGS [ {GRAPH|STORAGE} :] <configuration_name>
```

`GET CONFIGS` gets the specified configuration information for the specified service. When the service is not specified, Nebula Graph returns all the configurations that have the same name.

For example:

```ngql
nebula> GET CONFIGS STORAGE:wal_ttl;
+-----------+-----------+-------+-----------+-------+
| module    | name      | type  | mode      | value |
+-----------+-----------+-------+-----------+-------+
| "STORAGE" | "wal_ttl" | "int" | "MUTABLE" | 14400 |
+-----------+-----------+-------+-----------+-------+
```

```ngql
nebula> GET CONFIGS heartbeat_interval_secs;
+-----------+---------------------------+-------+-----------+-------+
| module    | name                      | type  | mode      | value |
+-----------+---------------------------+-------+-----------+-------+
| "GRAPH"   | "heartbeat_interval_secs" | "int" | "MUTABLE" | 3     |
+-----------+---------------------------+-------+-----------+-------+
| "STORAGE" | "heartbeat_interval_secs" | "int" | "MUTABLE" | 3     |
+-----------+---------------------------+-------+-----------+-------+
```

## UPDATE CONFIGS

```ngql
UPDATE CONFIGS [ {GRAPH | STORAGE} :] <configuration_name>=<new_value>
```

`UPDATE CONFIGS` updates the specified configuration value for the specified service. When the service is not specified, Nebula Graph updates all the configurations that have the same name. `UPDATE CONFIGS` supports expressions. `UPDATE CONFIGS` updates only the mutable configurations.

To update the immutable configurations, follow these steps:

1. Modify the configuration files related to the configurations. The default path to the configuration file is `usr/local/nebula/etc`.
2. Save your modification in step one and close the configuration file.
3. Restart Nebula Graph services.

The updated configuration value is stored in the `meta service` permanently. The modification to a mutable configuration takes effect immediately. To make the modification to some RocksDB configurations take effect, you need to restart the services.

For example:

```ngql
nebula> UPDATE CONFIGS STORAGE:heartbeat_interval_secs=3;
nebula> GET CONFIGS STORAGE:heartbeat_interval_secs;
+-----------+---------------------------+-------+-----------+-------+
| module    | name                      | type  | mode      | value |
+-----------+---------------------------+-------+-----------+-------+
| "STORAGE" | "heartbeat_interval_secs" | "int" | "MUTABLE" | 3     |
+-----------+---------------------------+-------+-----------+-------+
```
