
<!DOCTYPE html>

<html class="no-js" lang="en">
<head>
<meta charset="utf-8"/>
<meta content="width=device-width,initial-scale=1" name="viewport"/>
<meta content="Documentation for Nebula Graph Database" name="description"/>
<meta content="Nebula Graph" name="author"/>
<link href="https://docs.nebula-graph.io/master/3.ngql-guide/7.general-query-statements/2.match/" rel="canonical"/>
<link href="../../../icon/favicon.ico" rel="icon"/>
<meta content="mkdocs-1.3.0, mkdocs-material-7.1.0" name="generator"/>
<title>MATCH - Nebula Graph Database Manual</title>
<link href="../../../assets/stylesheets/main.fdf4365a.min.css" rel="stylesheet"/>
<link href="../../../assets/stylesheets/palette.ef6f36e2.min.css" rel="stylesheet"/>
<link crossorigin="" href="https://fonts.gstatic.com" rel="preconnect"/>
<link href="https://fonts.googleapis.com/css?family=Roboto:300,400,400i,700%7CRoboto+Mono&amp;display=fallback" rel="stylesheet"/>
<style>:root{--md-text-font-family:"Roboto";--md-code-font-family:"Roboto Mono"}</style>
<link href="../../../stylesheets/logo.css" rel="stylesheet"/>
<link href="../../../stylesheets/note.css" rel="stylesheet"/>
<link href="../../../stylesheets/extra.css" rel="stylesheet"/>
<link href="../../../css/version-select.css" rel="stylesheet"/>
</head>
<body data-md-color-accent="green" data-md-color-primary="teal" data-md-color-scheme="default" dir="ltr">
<script>function __prefix(e){return new URL("../../..",location).pathname+"."+e}function __get(e,t=localStorage){return JSON.parse(t.getItem(__prefix(e)))}</script>
<script>var palette=__get("__palette");if(null!==palette&&"object"==typeof palette.color)for(var key in palette.color)document.body.setAttribute("data-md-color-"+key,palette.color[key])</script>
<input autocomplete="off" class="md-toggle" data-md-toggle="drawer" id="__drawer" type="checkbox"/>
<input autocomplete="off" class="md-toggle" data-md-toggle="search" id="__search" type="checkbox"/>
<label class="md-overlay" for="__drawer"></label>
<div data-md-component="skip">
<a class="md-skip" href="#match">
          Skip to content
        </a>
</div>
<div data-md-component="announce">
</div>
<header class="md-header" data-md-component="header">
<nav aria-label="Header" class="md-header__inner md-grid">
<a aria-label="Nebula Graph Database Manual" class="md-header__button md-logo" data-md-component="logo" href="../../.." title="Nebula Graph Database Manual">
<img alt="logo" src="https://cloud-cdn.nebula-graph.com.cn/vesoft-nebula-logo-white.png"/>
</a>
<label class="md-header__button md-icon" for="__drawer">
<svg viewbox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><path d="M3 6h18v2H3V6m0 5h18v2H3v-2m0 5h18v2H3v-2z"></path></svg>
</label>
<div class="md-header__title" data-md-component="header-title">
<div class="md-header__ellipsis">
<div class="md-header__topic">
<span class="md-ellipsis">
            Nebula Graph Database Manual
          </span>
</div>
<div class="md-header__topic" data-md-component="header-topic">
<span class="md-ellipsis">
            
              MATCH
            
          </span>
</div>
</div>
</div>
<form class="md-header__option" data-md-component="palette">
<input class="md-option" data-md-color-accent="green" data-md-color-media="" data-md-color-primary="teal" data-md-color-scheme="default" id="__palette_1" name="__palette" type="radio"/>
<label class="md-header__button md-icon" for="__palette_2" hidden="" title="Switch to dark mode">
<svg viewbox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><path d="M7 10a2 2 0 0 1 2 2 2 2 0 0 1-2 2 2 2 0 0 1-2-2 2 2 0 0 1 2-2m10-3a5 5 0 0 1 5 5 5 5 0 0 1-5 5H7a5 5 0 0 1-5-5 5 5 0 0 1 5-5h10M7 9a3 3 0 0 0-3 3 3 3 0 0 0 3 3h10a3 3 0 0 0 3-3 3 3 0 0 0-3-3H7z"></path></svg>
</label>
<input class="md-option" data-md-color-accent="red" data-md-color-media="" data-md-color-primary="deep-orange" data-md-color-scheme="slate" id="__palette_2" name="__palette" type="radio"/>
<label class="md-header__button md-icon" for="__palette_1" hidden="" title="Switch to light mode">
<svg viewbox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><path d="M17 7H7a5 5 0 0 0-5 5 5 5 0 0 0 5 5h10a5 5 0 0 0 5-5 5 5 0 0 0-5-5m0 8a3 3 0 0 1-3-3 3 3 0 0 1 3-3 3 3 0 0 1 3 3 3 3 0 0 1-3 3z"></path></svg>
</label>
</form>
<label class="md-header__button md-icon" for="__search">
<svg viewbox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><path d="M9.5 3A6.5 6.5 0 0 1 16 9.5c0 1.61-.59 3.09-1.56 4.23l.27.27h.79l5 5-1.5 1.5-5-5v-.79l-.27-.27A6.516 6.516 0 0 1 9.5 16 6.5 6.5 0 0 1 3 9.5 6.5 6.5 0 0 1 9.5 3m0 2C7 5 5 7 5 9.5S7 14 9.5 14 14 12 14 9.5 12 5 9.5 5z"></path></svg>
</label>
<div class="md-search" data-md-component="search" role="dialog">
<label class="md-search__overlay" for="__search"></label>
<div class="md-search__inner" role="search">
<form class="md-search__form" name="search">
<input aria-label="Search" autocapitalize="off" autocomplete="off" autocorrect="off" class="md-search__input" data-md-component="search-query" data-md-state="active" name="query" placeholder="Search" required="" spellcheck="false" type="text"/>
<label class="md-search__icon md-icon" for="__search">
<svg viewbox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><path d="M9.5 3A6.5 6.5 0 0 1 16 9.5c0 1.61-.59 3.09-1.56 4.23l.27.27h.79l5 5-1.5 1.5-5-5v-.79l-.27-.27A6.516 6.516 0 0 1 9.5 16 6.5 6.5 0 0 1 3 9.5 6.5 6.5 0 0 1 9.5 3m0 2C7 5 5 7 5 9.5S7 14 9.5 14 14 12 14 9.5 12 5 9.5 5z"></path></svg>
<svg viewbox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><path d="M20 11v2H8l5.5 5.5-1.42 1.42L4.16 12l7.92-7.92L13.5 5.5 8 11h12z"></path></svg>
</label>
<button aria-label="Clear" class="md-search__icon md-icon" tabindex="-1" type="reset">
<svg viewbox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><path d="M19 6.41 17.59 5 12 10.59 6.41 5 5 6.41 10.59 12 5 17.59 6.41 19 12 13.41 17.59 19 19 17.59 13.41 12 19 6.41z"></path></svg>
</button>
</form>
<div class="md-search__output">
<div class="md-search__scrollwrap" data-md-scrollfix="">
<div class="md-search-result" data-md-component="search-result">
<div class="md-search-result__meta">
            Initializing search
          </div>
<ol class="md-search-result__list"></ol>
</div>
</div>
</div>
</div>
</div>
<div class="md-header__source">
<a class="md-source" data-md-component="source" href="https://github.com/vesoft-inc/nebula-docs" title="Go to repository">
<div class="md-source__icon md-icon">
<svg viewbox="0 0 448 512" xmlns="http://www.w3.org/2000/svg"><path d="M439.55 236.05 244 40.45a28.87 28.87 0 0 0-40.81 0l-40.66 40.63 51.52 51.52c27.06-9.14 52.68 16.77 43.39 43.68l49.66 49.66c34.23-11.8 61.18 31 35.47 56.69-26.49 26.49-70.21-2.87-56-37.34L240.22 199v121.85c25.3 12.54 22.26 41.85 9.08 55a34.34 34.34 0 0 1-48.55 0c-17.57-17.6-11.07-46.91 11.25-56v-123c-20.8-8.51-24.6-30.74-18.64-45L142.57 101 8.45 235.14a28.86 28.86 0 0 0 0 40.81l195.61 195.6a28.86 28.86 0 0 0 40.8 0l194.69-194.69a28.86 28.86 0 0 0 0-40.81z"></path></svg>
</div>
<div class="md-source__repository">
    vesoft-inc/nebula-docs
  </div>
</a>
</div>
</nav>
</header>
<div class="md-container" data-md-component="container">
<main class="md-main" data-md-component="main">
<div class="md-main__inner md-grid">
<div class="md-sidebar md-sidebar--primary" data-md-component="sidebar" data-md-type="navigation">
<div class="md-sidebar__scrollwrap">
<div class="md-sidebar__inner">
<nav aria-label="Navigation" class="md-nav md-nav--primary" data-md-level="0">
<label class="md-nav__title" for="__drawer">
<a aria-label="Nebula Graph Database Manual" class="md-nav__button md-logo" data-md-component="logo" href="../../.." title="Nebula Graph Database Manual">
<img alt="logo" src="https://cloud-cdn.nebula-graph.com.cn/vesoft-nebula-logo-white.png"/>
</a>
    Nebula Graph Database Manual
  </label>
<div class="md-nav__source">
<a class="md-source" data-md-component="source" href="https://github.com/vesoft-inc/nebula-docs" title="Go to repository">
<div class="md-source__icon md-icon">
<svg viewbox="0 0 448 512" xmlns="http://www.w3.org/2000/svg"><path d="M439.55 236.05 244 40.45a28.87 28.87 0 0 0-40.81 0l-40.66 40.63 51.52 51.52c27.06-9.14 52.68 16.77 43.39 43.68l49.66 49.66c34.23-11.8 61.18 31 35.47 56.69-26.49 26.49-70.21-2.87-56-37.34L240.22 199v121.85c25.3 12.54 22.26 41.85 9.08 55a34.34 34.34 0 0 1-48.55 0c-17.57-17.6-11.07-46.91 11.25-56v-123c-20.8-8.51-24.6-30.74-18.64-45L142.57 101 8.45 235.14a28.86 28.86 0 0 0 0 40.81l195.61 195.6a28.86 28.86 0 0 0 40.8 0l194.69-194.69a28.86 28.86 0 0 0 0-40.81z"></path></svg>
</div>
<div class="md-source__repository">
    vesoft-inc/nebula-docs
  </div>
</a>
</div>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../..">
        About
      </a>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_2" id="__nav_2" type="checkbox"/>
<label class="md-nav__link" for="__nav_2">
        Introduction
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="Introduction" class="md-nav" data-md-level="1">
<label class="md-nav__title" for="__nav_2">
<span class="md-nav__icon md-icon"></span>
          Introduction
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../1.introduction/0-0-graph/">
        Introduction to graphs
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../1.introduction/0-1-graph-database/">
        Graph databases
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../1.introduction/0-2.relates/">
        Related technologies
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../1.introduction/1.what-is-nebula-graph/">
        What is Nebula Graph
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../1.introduction/2.data-model/">
        Data model
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../1.introduction/2.1.path/">
        Path
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../1.introduction/3.vid/">
        VID
      </a>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_2_8" id="__nav_2_8" type="checkbox"/>
<label class="md-nav__link" for="__nav_2_8">
        Nebula Graph architecture
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="Nebula Graph architecture" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_2_8">
<span class="md-nav__icon md-icon"></span>
          Nebula Graph architecture
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../1.introduction/3.nebula-graph-architecture/1.architecture-overview/">
        Architecture overview
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../1.introduction/3.nebula-graph-architecture/2.meta-service/">
        Meta Service
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../1.introduction/3.nebula-graph-architecture/3.graph-service/">
        Graph Service
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../1.introduction/3.nebula-graph-architecture/4.storage-service/">
        Storage Service
      </a>
</li>
</ul>
</nav>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_3" id="__nav_3" type="checkbox"/>
<label class="md-nav__link" for="__nav_3">
        Quick start
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="Quick start" class="md-nav" data-md-level="1">
<label class="md-nav__title" for="__nav_3">
<span class="md-nav__icon md-icon"></span>
          Quick start
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../2.quick-start/1.quick-start-workflow/">
        Quick start workflow
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../2.quick-start/2.install-nebula-graph/">
        Step 1 Install Nebula Graph
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../2.quick-start/5.start-stop-service/">
        Step 2 Manage Nebula Graph Service
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../2.quick-start/3.connect-to-nebula-graph/">
        Step 3 Connect to Nebula Graph
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../2.quick-start/3.1add-storage-hosts/">
        Step 4 Register the Storage Service
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../2.quick-start/4.nebula-graph-crud/">
        Step 5 Use nGQL (CRUD)
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../2.quick-start/6.cheatsheet-for-ngql/">
        nGQL cheatsheet
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--active md-nav__item--nested">
<input checked="" class="md-nav__toggle md-toggle" data-md-toggle="__nav_4" id="__nav_4" type="checkbox"/>
<label class="md-nav__link" for="__nav_4">
        nGQL guide
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="nGQL guide" class="md-nav" data-md-level="1">
<label class="md-nav__title" for="__nav_4">
<span class="md-nav__icon md-icon"></span>
          nGQL guide
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_4_1" id="__nav_4_1" type="checkbox"/>
<label class="md-nav__link" for="__nav_4_1">
        nGQL overview
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="nGQL overview" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_4_1">
<span class="md-nav__icon md-icon"></span>
          nGQL overview
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../1.nGQL-overview/1.overview/">
        Overview
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../1.nGQL-overview/3.graph-patterns/">
        Graph patterns
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../1.nGQL-overview/comments/">
        Comments
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../1.nGQL-overview/identifier-case-sensitivity/">
        Identifier case sensitivity
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../1.nGQL-overview/keywords-and-reserved-words/">
        Keywords
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../1.nGQL-overview/ngql-style-guide/">
        nGQL style guide
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_4_2" id="__nav_4_2" type="checkbox"/>
<label class="md-nav__link" for="__nav_4_2">
        Data types
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="Data types" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_4_2">
<span class="md-nav__icon md-icon"></span>
          Data types
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../3.data-types/1.numeric/">
        Numeric
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../3.data-types/2.boolean/">
        Boolean
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../3.data-types/3.string/">
        String
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../3.data-types/4.date-and-time/">
        Date and time
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../3.data-types/5.null/">
        NULL
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../3.data-types/6.list/">
        List
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../3.data-types/7.set/">
        Set
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../3.data-types/8.map/">
        Map
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../3.data-types/9.type-conversion/">
        Type conversion
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../3.data-types/10.geography/">
        Geography
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_4_3" id="__nav_4_3" type="checkbox"/>
<label class="md-nav__link" for="__nav_4_3">
        Variables and composite queries
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="Variables and composite queries" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_4_3">
<span class="md-nav__icon md-icon"></span>
          Variables and composite queries
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../4.variable-and-composite-queries/1.composite-queries/">
        Composite queries
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../4.variable-and-composite-queries/2.user-defined-variables/">
        User-defined variables
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../4.variable-and-composite-queries/3.property-reference/">
        Property reference
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_4_4" id="__nav_4_4" type="checkbox"/>
<label class="md-nav__link" for="__nav_4_4">
        Operators
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="Operators" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_4_4">
<span class="md-nav__icon md-icon"></span>
          Operators
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../5.operators/1.comparison/">
        Comparison
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../5.operators/2.boolean/">
        Boolean
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../5.operators/4.pipe/">
        Pipe
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../5.operators/5.property-reference/">
        Property reference
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../5.operators/6.set/">
        Set
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../5.operators/7.string/">
        String
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../5.operators/8.list/">
        List
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../5.operators/9.precedence/">
        Precedence
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_4_5" id="__nav_4_5" type="checkbox"/>
<label class="md-nav__link" for="__nav_4_5">
        Functions and expressions
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="Functions and expressions" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_4_5">
<span class="md-nav__icon md-icon"></span>
          Functions and expressions
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../6.functions-and-expressions/1.math/">
        Math functions
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../6.functions-and-expressions/2.string/">
        String functions
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../6.functions-and-expressions/3.date-and-time/">
        Date and time functions
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../6.functions-and-expressions/4.schema/">
        Schema functions
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../6.functions-and-expressions/6.list/">
        List functions
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../6.functions-and-expressions/5.case-expressions/">
        Case expressions
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../6.functions-and-expressions/7.count/">
        count()
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../6.functions-and-expressions/10.collect/">
        collect()
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../6.functions-and-expressions/12.hash/">
        hash()
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../6.functions-and-expressions/13.concat/">
        concat()
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../6.functions-and-expressions/8.predicate/">
        Predicate functions
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../6.functions-and-expressions/14.geo/">
        Geography functions
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../6.functions-and-expressions/9.user-defined-functions/">
        User-defined functions
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--active md-nav__item--nested">
<input checked="" class="md-nav__toggle md-toggle" data-md-toggle="__nav_4_6" id="__nav_4_6" type="checkbox"/>
<label class="md-nav__link" for="__nav_4_6">
        General queries statements
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="General queries statements" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_4_6">
<span class="md-nav__icon md-icon"></span>
          General queries statements
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item md-nav__item--active">
<input class="md-nav__toggle md-toggle" data-md-toggle="toc" id="__toc" type="checkbox"/>
<label class="md-nav__link md-nav__link--active" for="__toc">
          MATCH
          <span class="md-nav__icon md-icon"></span>
</label>
<a class="md-nav__link md-nav__link--active" href="./">
        MATCH
      </a>
<nav aria-label="Table of contents" class="md-nav md-nav--secondary">
<label class="md-nav__title" for="__toc">
<span class="md-nav__icon md-icon"></span>
      Table of contents
    </label>
<ul class="md-nav__list" data-md-component="toc" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="#syntax">
    Syntax
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#precautions">
    Precautions
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#using_patterns_in_match_statements">
    Using patterns in MATCH statements
  </a>
<nav aria-label="Using patterns in MATCH statements" class="md-nav">
<ul class="md-nav__list">
<li class="md-nav__item">
<a class="md-nav__link" href="#create_indexes">
    Create indexes
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#match_vertices">
    Match vertices
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#match_tags">
    Match tags
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#match_vertex_properties">
    Match vertex properties
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#match_vids">
    Match VIDs
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#match_connected_vertices">
    Match connected vertices
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#match_paths">
    Match paths
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#match_edges">
    Match edges
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#match_edge_types">
    Match edge types
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#match_edge_type_properties">
    Match edge type properties
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#match_multiple_edge_types">
    Match multiple edge types
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#match_multiple_edges">
    Match multiple edges
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#match_fixed-length_paths">
    Match fixed-length paths
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#match_variable-length_paths">
    Match variable-length paths
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#match_variable-length_paths_with_multiple_edge_types">
    Match variable-length paths with multiple edge types
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#match_multiple_patterns">
    Match multiple patterns
  </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#retrieve_with_multiple_match">
    Retrieve with multiple match
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#retrieve_with_optional_match">
    Retrieve with optional match
  </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../optional-match/">
        OPTIONAL MATCH
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../5.lookup/">
        LOOKUP
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../3.go/">
        GO
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../4.fetch/">
        FETCH
      </a>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_4_6_6" id="__nav_4_6_6" type="checkbox"/>
<label class="md-nav__link" for="__nav_4_6_6">
        SHOW
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="SHOW" class="md-nav" data-md-level="3">
<label class="md-nav__title" for="__nav_4_6_6">
<span class="md-nav__icon md-icon"></span>
          SHOW
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../6.show/1.show-charset/">
        SHOW CHARSET
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../6.show/2.show-collation/">
        SHOW COLLATION
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../6.show/4.show-create-space/">
        SHOW CREATE SPACE
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../6.show/5.show-create-tag-edge/">
        SHOW CREATE TAG/EDGE
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../6.show/6.show-hosts/">
        SHOW HOSTS
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../6.show/7.show-index-status/">
        SHOW INDEX STATUS
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../6.show/8.show-indexes/">
        SHOW INDEXES
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../6.show/9.show-parts/">
        SHOW PARTS
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../6.show/10.show-roles/">
        SHOW ROLES
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../6.show/11.show-snapshots/">
        SHOW SNAPSHOTS
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../6.show/12.show-spaces/">
        SHOW SPACES
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../6.show/14.show-stats/">
        SHOW STATS
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../6.show/15.show-tags-edges/">
        SHOW TAGS/EDGES
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../6.show/16.show-users/">
        SHOW USERS
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../6.show/17.show-sessions/">
        SHOW SESSIONS
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../6.show/18.show-queries/">
        SHOW QUERIES
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../6.show/19.show-meta-leader/">
        SHOW META LEADER
      </a>
</li>
</ul>
</nav>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_4_7" id="__nav_4_7" type="checkbox"/>
<label class="md-nav__link" for="__nav_4_7">
        Clauses and options
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="Clauses and options" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_4_7">
<span class="md-nav__icon md-icon"></span>
          Clauses and options
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../8.clauses-and-options/group-by/">
        GROUP BY
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../8.clauses-and-options/limit/">
        LIMIT and SKIP
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../8.clauses-and-options/sample/">
        SAMPLE
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../8.clauses-and-options/order-by/">
        ORDER BY
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../8.clauses-and-options/return/">
        RETURN
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../8.clauses-and-options/ttl-options/">
        TTL
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../8.clauses-and-options/where/">
        WHERE
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../8.clauses-and-options/yield/">
        YIELD
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../8.clauses-and-options/with/">
        WITH
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../8.clauses-and-options/unwind/">
        UNWIND
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_4_8" id="__nav_4_8" type="checkbox"/>
<label class="md-nav__link" for="__nav_4_8">
        Space statements
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="Space statements" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_4_8">
<span class="md-nav__icon md-icon"></span>
          Space statements
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../9.space-statements/1.create-space/">
        CREATE SPACE
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../9.space-statements/2.use-space/">
        USE SPACE
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../9.space-statements/3.show-spaces/">
        SHOW SPACES
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../9.space-statements/4.describe-space/">
        DESCRIBE SPACE
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../9.space-statements/6.clear-space/">
        CLEAR SPACE
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../9.space-statements/5.drop-space/">
        DROP SPACE
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_4_9" id="__nav_4_9" type="checkbox"/>
<label class="md-nav__link" for="__nav_4_9">
        Tag statements
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="Tag statements" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_4_9">
<span class="md-nav__icon md-icon"></span>
          Tag statements
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../10.tag-statements/1.create-tag/">
        CREATE TAG
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../10.tag-statements/2.drop-tag/">
        DROP TAGS
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../10.tag-statements/3.alter-tag/">
        ALTER TAG
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../10.tag-statements/4.show-tags/">
        SHOW TAGS
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../10.tag-statements/5.describe-tag/">
        DESCRIBE TAG
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../10.tag-statements/6.delete-tag/">
        DELETE TAG
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../10.tag-statements/improve-query-by-tag-index/">
        Add or delete tag
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_4_10" id="__nav_4_10" type="checkbox"/>
<label class="md-nav__link" for="__nav_4_10">
        Edge type statements
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="Edge type statements" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_4_10">
<span class="md-nav__icon md-icon"></span>
          Edge type statements
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../11.edge-type-statements/1.create-edge/">
        CREATE EDGE
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../11.edge-type-statements/2.drop-edge/">
        DROP EDGE
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../11.edge-type-statements/3.alter-edge/">
        ALTER EDGE
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../11.edge-type-statements/4.show-edges/">
        SHOW EDGES
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../11.edge-type-statements/5.describe-edge/">
        DESCRIBE EDGE
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_4_11" id="__nav_4_11" type="checkbox"/>
<label class="md-nav__link" for="__nav_4_11">
        Vertex statements
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="Vertex statements" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_4_11">
<span class="md-nav__icon md-icon"></span>
          Vertex statements
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../12.vertex-statements/1.insert-vertex/">
        INSERT VERTEX
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../12.vertex-statements/4.delete-vertex/">
        DELETE VERTEX
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../12.vertex-statements/2.update-vertex/">
        UPDATE VERTEX
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../12.vertex-statements/3.upsert-vertex/">
        UPSERT VERTEX
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_4_12" id="__nav_4_12" type="checkbox"/>
<label class="md-nav__link" for="__nav_4_12">
        Edge statements
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="Edge statements" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_4_12">
<span class="md-nav__icon md-icon"></span>
          Edge statements
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../13.edge-statements/1.insert-edge/">
        INSERT EDGE
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../13.edge-statements/4.delete-edge/">
        DELETE EDGE
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../13.edge-statements/2.update-edge/">
        UPDATE EDGE
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../13.edge-statements/3.upsert-edge/">
        UPSERT EDGE
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_4_13" id="__nav_4_13" type="checkbox"/>
<label class="md-nav__link" for="__nav_4_13">
        Native index statements
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="Native index statements" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_4_13">
<span class="md-nav__icon md-icon"></span>
          Native index statements
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../14.native-index-statements/">
        Index overview
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../14.native-index-statements/1.create-native-index/">
        CREATE INDEX
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../14.native-index-statements/2.show-native-indexes/">
        SHOW INDEX
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../14.native-index-statements/2.1.show-create-index/">
        SHOW CREATE INDEX
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../14.native-index-statements/3.describe-native-index/">
        DESCRIBE INDEX
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../14.native-index-statements/4.rebuild-native-index/">
        REBUILD INDEX
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../14.native-index-statements/5.show-native-index-status/">
        SHOW INDEX STATUS
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../14.native-index-statements/6.drop-native-index/">
        DROP INDEX
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_4_14" id="__nav_4_14" type="checkbox"/>
<label class="md-nav__link" for="__nav_4_14">
        Full-text index statements
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="Full-text index statements" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_4_14">
<span class="md-nav__icon md-icon"></span>
          Full-text index statements
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../4.deployment-and-installation/6.deploy-text-based-index/1.text-based-index-restrictions/">
        Full-text restrictions
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../4.deployment-and-installation/6.deploy-text-based-index/2.deploy-es/">
        Deploy Elasticsearch cluster
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../4.deployment-and-installation/6.deploy-text-based-index/3.deploy-listener/">
        Deploy Raft Listener cluster
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../15.full-text-index-statements/1.search-with-text-based-index/">
        Search with full-text index
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_4_15" id="__nav_4_15" type="checkbox"/>
<label class="md-nav__link" for="__nav_4_15">
        Subgraph and path
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="Subgraph and path" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_4_15">
<span class="md-nav__icon md-icon"></span>
          Subgraph and path
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../16.subgraph-and-path/1.get-subgraph/">
        GET SUBGRAPH
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../16.subgraph-and-path/2.find-path/">
        FIND PATH
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_4_16" id="__nav_4_16" type="checkbox"/>
<label class="md-nav__link" for="__nav_4_16">
        Query tuning and terminating statements
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="Query tuning and terminating statements" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_4_16">
<span class="md-nav__icon md-icon"></span>
          Query tuning and terminating statements
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../17.query-tuning-statements/1.explain-and-profile/">
        EXPLAIN and PROFILE
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../17.query-tuning-statements/6.kill-query/">
        Kill queries
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../4.job-statements/">
        Job statements
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_5" id="__nav_5" type="checkbox"/>
<label class="md-nav__link" for="__nav_5">
        Deployment and installation
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="Deployment and installation" class="md-nav" data-md-level="1">
<label class="md-nav__title" for="__nav_5">
<span class="md-nav__icon md-icon"></span>
          Deployment and installation
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../4.deployment-and-installation/1.resource-preparations/">
        Resource preparations
      </a>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_5_2" id="__nav_5_2" type="checkbox"/>
<label class="md-nav__link" for="__nav_5_2">
        Compile and install Nebula Graph
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="Compile and install Nebula Graph" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_5_2">
<span class="md-nav__icon md-icon"></span>
          Compile and install Nebula Graph
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../4.deployment-and-installation/2.compile-and-install-nebula-graph/1.install-nebula-graph-by-compiling-the-source-code/">
        Install Nebula Graph by compiling the source code
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../4.deployment-and-installation/2.compile-and-install-nebula-graph/2.install-nebula-graph-by-rpm-or-deb/">
        Install Nebula Graph with RPM or DEB package
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../4.deployment-and-installation/2.compile-and-install-nebula-graph/4.install-nebula-graph-from-tar/">
        Install Nebula Graph with the tar.gz file
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../4.deployment-and-installation/2.compile-and-install-nebula-graph/3.deploy-nebula-graph-with-docker-compose/">
        Deploy Nebula Graph with Docker Compose
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../4.deployment-and-installation/2.compile-and-install-nebula-graph/deploy-nebula-graph-cluster/">
        Deploy a Nebula Graph cluster on multiple servers
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../4.deployment-and-installation/2.compile-and-install-nebula-graph/6.deploy-nebula-graph-with-peripherals/">
        Deploy Nebula Grpah with ecosystem tools
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../4.deployment-and-installation/standalone-deployment/">
        Deploy standalone Nebula Graph
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../4.deployment-and-installation/deploy-license/">
        Deploy license
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../4.deployment-and-installation/manage-service/">
        Manage Service
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../4.deployment-and-installation/connect-to-nebula-graph/">
        Connect to Service
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../4.deployment-and-installation/manage-storage-host/">
        Manage Storage host
      </a>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_5_8" id="__nav_5_8" type="checkbox"/>
<label class="md-nav__link" for="__nav_5_8">
        Upgrade
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="Upgrade" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_5_8">
<span class="md-nav__icon md-icon"></span>
          Upgrade
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../4.deployment-and-installation/3.upgrade-nebula-graph/upgrade-nebula-graph-to-latest/">
        Upgrade Nebula Graph to the latest version
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../4.deployment-and-installation/4.uninstall-nebula-graph/">
        Uninstall Nebula Graph
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_6" id="__nav_6" type="checkbox"/>
<label class="md-nav__link" for="__nav_6">
        Configurations and logs
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="Configurations and logs" class="md-nav" data-md-level="1">
<label class="md-nav__title" for="__nav_6">
<span class="md-nav__icon md-icon"></span>
          Configurations and logs
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_6_1" id="__nav_6_1" type="checkbox"/>
<label class="md-nav__link" for="__nav_6_1">
        Configurations
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="Configurations" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_6_1">
<span class="md-nav__icon md-icon"></span>
          Configurations
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../5.configurations-and-logs/1.configurations/1.configurations/">
        Configurations
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../5.configurations-and-logs/1.configurations/2.meta-config/">
        Meta Service configurations
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../5.configurations-and-logs/1.configurations/3.graph-config/">
        Graph Service configurations
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../5.configurations-and-logs/1.configurations/4.storage-config/">
        Storage Service configurations
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../5.configurations-and-logs/1.configurations/6.kernel-config/">
        Kernel configurations
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_6_2" id="__nav_6_2" type="checkbox"/>
<label class="md-nav__link" for="__nav_6_2">
        Log management
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="Log management" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_6_2">
<span class="md-nav__icon md-icon"></span>
          Log management
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../5.configurations-and-logs/2.log-management/logs/">
        Runtime logs
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../5.configurations-and-logs/2.log-management/audit-log/">
        Audit logs(Enterprise)
      </a>
</li>
</ul>
</nav>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_7" id="__nav_7" type="checkbox"/>
<label class="md-nav__link" for="__nav_7">
        Monitor and metrics
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="Monitor and metrics" class="md-nav" data-md-level="1">
<label class="md-nav__title" for="__nav_7">
<span class="md-nav__icon md-icon"></span>
          Monitor and metrics
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../6.monitor-and-metrics/1.query-performance-metrics/">
        Query Nebula Graph metrics
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../6.monitor-and-metrics/2.rocksdb-statistics/">
        RocksDB Statistics
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_8" id="__nav_8" type="checkbox"/>
<label class="md-nav__link" for="__nav_8">
        Data security
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="Data security" class="md-nav" data-md-level="1">
<label class="md-nav__title" for="__nav_8">
<span class="md-nav__icon md-icon"></span>
          Data security
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_8_1" id="__nav_8_1" type="checkbox"/>
<label class="md-nav__link" for="__nav_8_1">
        Authentication and authorization
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="Authentication and authorization" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_8_1">
<span class="md-nav__icon md-icon"></span>
          Authentication and authorization
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../7.data-security/1.authentication/1.authentication/">
        Authentication
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../7.data-security/1.authentication/2.management-user/">
        User management
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../7.data-security/1.authentication/3.role-list/">
        Roles and privileges
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../7.data-security/1.authentication/4.ldap/">
        OpenLDAP authentication
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../7.data-security/4.ssl/">
        SSL
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_9" id="__nav_9" type="checkbox"/>
<label class="md-nav__link" for="__nav_9">
        Backup &amp; Restore
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="Backup &amp; Restore" class="md-nav" data-md-level="1">
<label class="md-nav__title" for="__nav_9">
<span class="md-nav__icon md-icon"></span>
          Backup &amp; Restore
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_9_1" id="__nav_9_1" type="checkbox"/>
<label class="md-nav__link" for="__nav_9_1">
        Nebula BR
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="Nebula BR" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_9_1">
<span class="md-nav__icon md-icon"></span>
          Nebula BR
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../backup-and-restore/nebula-br/1.what-is-br/">
        What is Backup &amp; Restore
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../backup-and-restore/nebula-br/2.compile-br/">
        Compile BR
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../backup-and-restore/nebula-br/3.br-backup-data/">
        Use BR to back up data
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../backup-and-restore/nebula-br/4.br-restore-data/">
        Use BR to restore data
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../backup-and-restore/3.manage-snapshot/">
        Manage snapshots
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_10" id="__nav_10" type="checkbox"/>
<label class="md-nav__link" for="__nav_10">
        Synchronization &amp; Migration
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="Synchronization &amp; Migration" class="md-nav" data-md-level="1">
<label class="md-nav__title" for="__nav_10">
<span class="md-nav__icon md-icon"></span>
          Synchronization &amp; Migration
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../synchronization-and-migration/2.balance-syntax/">
        Load balance
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../synchronization-and-migration/replication-between-clusters/">
        Synchronize between two clusters
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_11" id="__nav_11" type="checkbox"/>
<label class="md-nav__link" for="__nav_11">
        Practices
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="Practices" class="md-nav" data-md-level="1">
<label class="md-nav__title" for="__nav_11">
<span class="md-nav__icon md-icon"></span>
          Practices
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../8.service-tuning/compaction/">
        Compaction
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../8.service-tuning/load-balance/">
        Storage load balance
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../8.service-tuning/2.graph-modeling/">
        Modeling suggestions
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../8.service-tuning/3.system-design/">
        System design suggestions
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../8.service-tuning/4.plan/">
        Execution plan
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../8.service-tuning/super-node/">
        Processing super vertices
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../8.service-tuning/practice/">
        Best practices
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_12" id="__nav_12" type="checkbox"/>
<label class="md-nav__link" for="__nav_12">
        Client
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="Client" class="md-nav" data-md-level="1">
<label class="md-nav__title" for="__nav_12">
<span class="md-nav__icon md-icon"></span>
          Client
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../14.client/1.nebula-client/">
        Clients overview
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-console/">
        Nebula Console
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../14.client/3.nebula-cpp-client/">
        Nebula CPP
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../14.client/4.nebula-java-client/">
        Nebula Java
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../14.client/5.nebula-python-client/">
        Nebula Python
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../14.client/6.nebula-go-client/">
        Nebula Go
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-cloud/">
        Nebula Graph Cloud
      </a>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_14" id="__nav_14" type="checkbox"/>
<label class="md-nav__link" for="__nav_14">
        Nebula Studio
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="Nebula Studio" class="md-nav" data-md-level="1">
<label class="md-nav__title" for="__nav_14">
<span class="md-nav__icon md-icon"></span>
          Nebula Studio
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-studio/about-studio/st-ug-release-note/">
        Change Log
      </a>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_14_2" id="__nav_14_2" type="checkbox"/>
<label class="md-nav__link" for="__nav_14_2">
        About Nebula Studio
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="About Nebula Studio" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_14_2">
<span class="md-nav__icon md-icon"></span>
          About Nebula Studio
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-studio/about-studio/st-ug-what-is-graph-studio/">
        What is Nebula Studio
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-studio/about-studio/st-ug-limitations/">
        Limitations
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_14_3" id="__nav_14_3" type="checkbox"/>
<label class="md-nav__link" for="__nav_14_3">
        Deploy and connect
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="Deploy and connect" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_14_3">
<span class="md-nav__icon md-icon"></span>
          Deploy and connect
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-studio/deploy-connect/st-ug-deploy/">
        Deploy Studio
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-studio/deploy-connect/st-ug-deploy-by-helm/">
        Deploy Studio with Helm
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-studio/deploy-connect/st-ug-connect/">
        Connect to Nebula Graph
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_14_4" id="__nav_14_4" type="checkbox"/>
<label class="md-nav__link" for="__nav_14_4">
        Quick start
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="Quick start" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_14_4">
<span class="md-nav__icon md-icon"></span>
          Quick start
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-studio/quick-start/st-ug-plan-schema/">
        Design a schema
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-studio/quick-start/st-ug-create-schema/">
        Create a schema
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-studio/quick-start/st-ug-import-data/">
        Import data
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-studio/quick-start/st-ug-console/">
        Use Console
      </a>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_14_4_5" id="__nav_14_4_5" type="checkbox"/>
<label class="md-nav__link" for="__nav_14_4_5">
        Use Schema
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="Use Schema" class="md-nav" data-md-level="3">
<label class="md-nav__title" for="__nav_14_4_5">
<span class="md-nav__icon md-icon"></span>
          Use Schema
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-studio/manage-schema/st-ug-crud-space/">
        Operate graph spaces
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-studio/manage-schema/st-ug-crud-tag/">
        Operate Tags
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-studio/manage-schema/st-ug-crud-edge-type/">
        Operate Edge types
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-studio/manage-schema/st-ug-crud-index/">
        Operate Indexes
      </a>
</li>
</ul>
</nav>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_14_5" id="__nav_14_5" type="checkbox"/>
<label class="md-nav__link" for="__nav_14_5">
        Troubleshooting
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="Troubleshooting" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_14_5">
<span class="md-nav__icon md-icon"></span>
          Troubleshooting
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-studio/troubleshooting/st-ug-config-server-errors/">
        Database connection error
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-studio/troubleshooting/st-ug-connection-errors/">
        Unable to access Studio
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-studio/troubleshooting/st-ug-faq/">
        FAQ
      </a>
</li>
</ul>
</nav>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_15" id="__nav_15" type="checkbox"/>
<label class="md-nav__link" for="__nav_15">
        Nebula Dashboard Community Edition
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="Nebula Dashboard Community Edition" class="md-nav" data-md-level="1">
<label class="md-nav__title" for="__nav_15">
<span class="md-nav__icon md-icon"></span>
          Nebula Dashboard Community Edition
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-dashboard/1.what-is-dashboard/">
        What is Nebula Dashboard
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-dashboard/2.deploy-dashboard/">
        Deploy Dashboard
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-dashboard/3.connect-dashboard/">
        Connect to Dashboard
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-dashboard/4.use-dashboard/">
        Use Dashboard
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-dashboard/6.monitor-parameter/">
        Monitoring metrics
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_16" id="__nav_16" type="checkbox"/>
<label class="md-nav__link" for="__nav_16">
        Nebula Dashboard Enterprise Edition
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="Nebula Dashboard Enterprise Edition" class="md-nav" data-md-level="1">
<label class="md-nav__title" for="__nav_16">
<span class="md-nav__icon md-icon"></span>
          Nebula Dashboard Enterprise Edition
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-dashboard-ent/1.what-is-dashboard-ent/">
        What is Nebula Dashboard
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-dashboard-ent/2.deploy-connect-dashboard-ent/">
        Deploy Dashboard
      </a>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_16_3" id="__nav_16_3" type="checkbox"/>
<label class="md-nav__link" for="__nav_16_3">
        Create and import clusters
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="Create and import clusters" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_16_3">
<span class="md-nav__icon md-icon"></span>
          Create and import clusters
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-dashboard-ent/3.create-import-dashboard/1.create-cluster/">
        Create clusters
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-dashboard-ent/3.create-import-dashboard/2.import-cluster/">
        Import clusters
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_16_4" id="__nav_16_4" type="checkbox"/>
<label class="md-nav__link" for="__nav_16_4">
        Cluster management
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="Cluster management" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_16_4">
<span class="md-nav__icon md-icon"></span>
          Cluster management
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-dashboard-ent/4.cluster-operator/1.overview/">
        Cluster overview
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-dashboard-ent/4.cluster-operator/2.monitor/">
        Cluster monitoring
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-dashboard-ent/9.alerts/">
        Alerts
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-dashboard-ent/4.cluster-operator/3.cluster-information/">
        Cluster information
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-dashboard-ent/4.cluster-operator/7.cluster-diagnosis/">
        Cluster Diagnostics
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-dashboard-ent/4.cluster-operator/4.manage/">
        Cluster operations
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-dashboard-ent/4.cluster-operator/5.operation-record/">
        Operation records
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-dashboard-ent/4.cluster-operator/6.settings/">
        Other settings
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-dashboard-ent/5.account-management/">
        Authority management
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-dashboard-ent/6.global-config/">
        Global settings
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-dashboard-ent/10.tasks/">
        Task Center
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-dashboard-ent/7.monitor-parameter/">
        Monitoring metrics
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-dashboard-ent/8.faq/">
        FAQ
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_17" id="__nav_17" type="checkbox"/>
<label class="md-nav__link" for="__nav_17">
        Nebula Explorer
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="Nebula Explorer" class="md-nav" data-md-level="1">
<label class="md-nav__title" for="__nav_17">
<span class="md-nav__icon md-icon"></span>
          Nebula Explorer
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-explorer/about-explorer/ex-ug-what-is-explorer/">
        What is Nebula Explorer
      </a>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_17_2" id="__nav_17_2" type="checkbox"/>
<label class="md-nav__link" for="__nav_17_2">
        Deploy and connect
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="Deploy and connect" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_17_2">
<span class="md-nav__icon md-icon"></span>
          Deploy and connect
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-explorer/deploy-connect/ex-ug-deploy/">
        Deploy Explorer
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-explorer/deploy-connect/ex-ug-connect/">
        Connect to Nebula Graph
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-explorer/ex-ug-page-overview/">
        Page overview
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-explorer/10.create-schema/">
        Create a schema
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-explorer/11.import-data/">
        Import data
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-explorer/13.choose-graphspace/">
        Choose graph spaces
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-explorer/ex-ug-query-exploration/">
        Start querying
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-explorer/node-filtering/">
        Vertex Filter
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-explorer/ex-ug-graph-exploration/">
        Graph exploration
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-explorer/12.query-visually/">
        Visual Query
      </a>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_17_11" id="__nav_17_11" type="checkbox"/>
<label class="md-nav__link" for="__nav_17_11">
        Canvas
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="Canvas" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_17_11">
<span class="md-nav__icon md-icon"></span>
          Canvas
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-explorer/canvas-operations/canvas-overview/">
        Overview
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-explorer/canvas-operations/visualization-mode/">
        Visualization modes
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-explorer/canvas-operations/canvas-snapshot/">
        Snapshots
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-explorer/explorer-console/">
        Explorer console
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-explorer/ex-ug-shortcuts/">
        Basic operations and shortcuts
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_18" id="__nav_18" type="checkbox"/>
<label class="md-nav__link" for="__nav_18">
        Nebula Importer
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="Nebula Importer" class="md-nav" data-md-level="1">
<label class="md-nav__title" for="__nav_18">
<span class="md-nav__icon md-icon"></span>
          Nebula Importer
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-importer/use-importer/">
        Use Nebula Importer
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-importer/config-with-header/">
        Configuration with Header
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-importer/config-without-header/">
        Configuration without Header
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_19" id="__nav_19" type="checkbox"/>
<label class="md-nav__link" for="__nav_19">
        Nebula Exchange
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="Nebula Exchange" class="md-nav" data-md-level="1">
<label class="md-nav__title" for="__nav_19">
<span class="md-nav__icon md-icon"></span>
          Nebula Exchange
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_19_1" id="__nav_19_1" type="checkbox"/>
<label class="md-nav__link" for="__nav_19_1">
        Introduction
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="Introduction" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_19_1">
<span class="md-nav__icon md-icon"></span>
          Introduction
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-exchange/about-exchange/ex-ug-what-is-exchange/">
        What is Nebula Exchange
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-exchange/about-exchange/ex-ug-limitations/">
        Limitations
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-exchange/ex-ug-compile/">
        Get Exchange
      </a>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_19_3" id="__nav_19_3" type="checkbox"/>
<label class="md-nav__link" for="__nav_19_3">
        Exchange configurations
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="Exchange configurations" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_19_3">
<span class="md-nav__icon md-icon"></span>
          Exchange configurations
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-exchange/parameter-reference/ex-ug-para-import-command/">
        Options for import
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-exchange/parameter-reference/ex-ug-parameter/">
        Parameters in the configuration file
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_19_4" id="__nav_19_4" type="checkbox"/>
<label class="md-nav__link" for="__nav_19_4">
        Use Nebula Exchange
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="Use Nebula Exchange" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_19_4">
<span class="md-nav__icon md-icon"></span>
          Use Nebula Exchange
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-exchange/use-exchange/ex-ug-import-from-csv/">
        Import data from CSV files
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-exchange/use-exchange/ex-ug-import-from-json/">
        Import data from JSON files
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-exchange/use-exchange/ex-ug-import-from-orc/">
        Import data from ORC files
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-exchange/use-exchange/ex-ug-import-from-parquet/">
        Import data from Parquet files
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-exchange/use-exchange/ex-ug-import-from-hbase/">
        Import data from HBase
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-exchange/use-exchange/ex-ug-import-from-mysql/">
        Import data from MySQL/PostgreSQL
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-exchange/use-exchange/ex-ug-import-from-clickhouse/">
        Import data from ClickHouse
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-exchange/use-exchange/ex-ug-import-from-neo4j/">
        Import data from Neo4j
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-exchange/use-exchange/ex-ug-import-from-hive/">
        Import data from Hive
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-exchange/use-exchange/ex-ug-import-from-maxcompute/">
        Import data from MaxCompute
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-exchange/use-exchange/ex-ug-import-from-pulsar/">
        Import data from Pulsar
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-exchange/use-exchange/ex-ug-import-from-kafka/">
        Import data from Kafka
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-exchange/use-exchange/ex-ug-import-from-sst/">
        Import data from SST files
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-exchange/use-exchange/ex-ug-export-from-nebula/">
        Export data from Nebula Graph
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-exchange/ex-ug-FAQ/">
        Exchange FAQ
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_20" id="__nav_20" type="checkbox"/>
<label class="md-nav__link" for="__nav_20">
        Nebula Operator
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="Nebula Operator" class="md-nav" data-md-level="1">
<label class="md-nav__title" for="__nav_20">
<span class="md-nav__icon md-icon"></span>
          Nebula Operator
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-operator/1.introduction-to-nebula-operator/">
        What is Nebula Operator
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-operator/6.get-started-with-operator/">
        Overview of using Nebula Operator
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-operator/2.deploy-nebula-operator/">
        Deploy Nebula Operator
      </a>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_20_4" id="__nav_20_4" type="checkbox"/>
<label class="md-nav__link" for="__nav_20_4">
        Deploy clusters
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="Deploy clusters" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_20_4">
<span class="md-nav__icon md-icon"></span>
          Deploy clusters
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-operator/3.deploy-nebula-graph-cluster/3.1create-cluster-with-kubectl/">
        Deploy clusters with Kubectl
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-operator/3.deploy-nebula-graph-cluster/3.2create-cluster-with-helm/">
        Deploy clusters with Helm
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_20_5" id="__nav_20_5" type="checkbox"/>
<label class="md-nav__link" for="__nav_20_5">
        Configure clusters
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="Configure clusters" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_20_5">
<span class="md-nav__icon md-icon"></span>
          Configure clusters
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-operator/8.custom-cluster-configurations/8.1.custom-conf-parameter/">
        Custom configuration parameters for a Nebula Graph cluster
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-operator/8.custom-cluster-configurations/8.2.pv-reclaim/">
        Reclaim PVs
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-operator/8.custom-cluster-configurations/8.3.balance-data-when-scaling-storage/">
        Balance storage data after scaling out
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-operator/9.upgrade-nebula-cluster/">
        Upgrade Nebula Graph clusters
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-operator/4.connect-to-nebula-graph-service/">
        Connect to Nebula Graph databases
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-operator/5.operator-failover/">
        Self-healing
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-operator/7.operator-faq/">
        FAQ
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-algorithm/">
        Nebula Algorithm
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-analytics/">
        Nebula Analytics
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-spark-connector/">
        Nebula Spark Connector
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-flink-connector/">
        Nebula Flink Connector
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-bench/">
        Nebula Bench
      </a>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_26" id="__nav_26" type="checkbox"/>
<label class="md-nav__link" for="__nav_26">
        Appendix
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="Appendix" class="md-nav" data-md-level="1">
<label class="md-nav__title" for="__nav_26">
<span class="md-nav__icon md-icon"></span>
          Appendix
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../20.appendix/learning-path/">
        Learning path
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../20.appendix/release-note/">
        Release Note
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../20.appendix/0.FAQ/">
        FAQ
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../20.appendix/6.eco-tool-version/">
        Ecosystem tools
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../20.appendix/write-tools/">
        Write tools
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../15.contribution/how-to-contribute/">
        How to contribute
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../20.appendix/history/">
        History timeline
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../20.appendix/error-code/">
        Error code
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="https://docs.nebula-graph.com.cn/">
        中文手册
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../pdf/NebulaGraph-EN.pdf">
        PDF
      </a>
</li>
</ul>
</nav>
</div>
</div>
</div>
<div class="md-sidebar md-sidebar--secondary" data-md-component="sidebar" data-md-type="toc">
<div class="md-sidebar__scrollwrap">
<div class="md-sidebar__inner">
<nav aria-label="Table of contents" class="md-nav md-nav--secondary">
<label class="md-nav__title" for="__toc">
<span class="md-nav__icon md-icon"></span>
      Table of contents
    </label>
<ul class="md-nav__list" data-md-component="toc" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="#syntax">
    Syntax
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#precautions">
    Precautions
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#using_patterns_in_match_statements">
    Using patterns in MATCH statements
  </a>
<nav aria-label="Using patterns in MATCH statements" class="md-nav">
<ul class="md-nav__list">
<li class="md-nav__item">
<a class="md-nav__link" href="#create_indexes">
    Create indexes
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#match_vertices">
    Match vertices
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#match_tags">
    Match tags
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#match_vertex_properties">
    Match vertex properties
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#match_vids">
    Match VIDs
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#match_connected_vertices">
    Match connected vertices
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#match_paths">
    Match paths
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#match_edges">
    Match edges
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#match_edge_types">
    Match edge types
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#match_edge_type_properties">
    Match edge type properties
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#match_multiple_edge_types">
    Match multiple edge types
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#match_multiple_edges">
    Match multiple edges
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#match_fixed-length_paths">
    Match fixed-length paths
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#match_variable-length_paths">
    Match variable-length paths
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#match_variable-length_paths_with_multiple_edge_types">
    Match variable-length paths with multiple edge types
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#match_multiple_patterns">
    Match multiple patterns
  </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#retrieve_with_multiple_match">
    Retrieve with multiple match
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#retrieve_with_optional_match">
    Retrieve with optional match
  </a>
</li>
</ul>
</nav>
</div>
</div>
</div>
<div class="md-content" data-md-component="content">
<article class="md-content__inner md-typeset">
<a class="md-content__button md-icon" href="https://github.com/vesoft-inc/nebula-docs/edit/master/docs-2.0/3.ngql-guide/7.general-query-statements/2.match.md" title="Edit this page">
<svg viewbox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><path d="M20.71 7.04c.39-.39.39-1.04 0-1.41l-2.34-2.34c-.37-.39-1.02-.39-1.41 0l-1.84 1.83 3.75 3.75M3 17.25V21h3.75L17.81 9.93l-3.75-3.75L3 17.25z"></path></svg>
</a>
<h1 id="match">MATCH<a class="headerlink" href="#match" title="Permanent link">¶</a></h1>
<p>The <code>MATCH</code> statement supports searching based on pattern matching.</p>
<p>A <code>MATCH</code> statement defines a search pattern and uses it to match data stored in Nebula Graph and to retrieve them in the form defined in the <code>RETURN</code> clause.</p>
<p>The examples in this topic use the <a href="../../1.nGQL-overview/1.overview/#example_data_basketballplayer">basketballplayer</a> dataset as the sample dataset.</p>
<h2 id="syntax">Syntax<a class="headerlink" href="#syntax" title="Permanent link">¶</a></h2>
<p>The syntax of <code>MATCH</code> is relatively more flexible compared with that of other query statements such as <code>GO</code> or <code>LOOKUP</code>. But generally, it can be summarized as follows.</p>
<div class="highlight"><pre><span></span><code>MATCH &lt;pattern&gt; [&lt;clause_1&gt;] RETURN &lt;output&gt; [&lt;clause_2&gt;];
</code></pre></div>
<ul>
<li><code>pattern</code>: For the detailed description of patterns, see <a href="../../1.nGQL-overview/3.graph-patterns/">Patterns</a>. The <code>MATCH</code> statement supports matching one or multiple patterns. Multiple patterns are separated by commas (,). For example: <code>(a)-[]-&gt;(b),(c)-[]-&gt;(d)</code>.</li>
</ul>
<ul>
<li><code>clause_1</code>: The <code>WHERE</code>, <code>WITH</code>, <code>UNWIND</code>, and <code>OPTIONAL MATCH</code> clauses are supported, and the <code>MATCH</code> clause can also be used.</li>
</ul>
<ul>
<li><code>output</code>: Define the output to be returned. You can rename the output column by using <code>AS</code>.</li>
</ul>
<ul>
<li><code>clause_2</code>: The <code>ORDER BY</code> and <code>LIMIT</code> clauses are supported.</li>
</ul>
<h2 id="precautions">Precautions<a class="headerlink" href="#precautions" title="Permanent link">¶</a></h2>
<div class="admonition compatibility">
<p class="admonition-title">Legacy version compatibility</p>
<p>Starting from Nebula Graph version 3.0.0, in order to distinguish the properties of different tags, you need to specify a tag name when querying properties. The original statement <code>RETURN variable_name.property_name</code> is changed to <code>RETURN variable_name.&lt;tag_name&gt;.property_name</code>.</p>
</div>
<div class="admonition note">
<p class="admonition-title">Note</p>
<p>Currently the <code>match</code> statement cannot find dangling edges.</p>
</div>
<ul>
<li>The <code>MATCH</code> statement retrieves data according to the <code>RETURN</code> clause.</li>
</ul>
<ul>
<li>The path type of the <code>MATCH</code> statement is <code>trail</code>. That is, only vertices can be repeatedly visited in the graph traversal. Edges cannot be repeatedly visited. For details, see <a href="../../../1.introduction/2.1.path/">path</a>.</li>
</ul>
<ul>
<li>In a valid <code>MATCH</code> statement, the VID of a specific vertex must be specified with the id() function in the <code>WHERE</code> clause. There is no need to create an index.</li>
</ul>
<ul>
<li>When traversing all vertices and edges with <code>MATCH</code>, such as <code>MATCH (v) RETURN v LIMIT N</code>, there is no need to create an index, but you need to use <code>LIMIT</code> to limit the number of output results.</li>
</ul>
<ul>
<li>When traversing all vertices of the specified Tag or edge of the specified Edge Type, such as <code>MATCH (v:player) RETURN v LIMIT N</code>, there is no need to create an index, but you need to use <code>LIMIT</code> to limit the number of output results.</li>
</ul>
<ul>
<li>In addition to the foregoing, make sure there is at least one index in the <code>MATCH</code> statement. How to create native indexes, see <a href="../../14.native-index-statements/1.create-native-index/">CREATE INDEX</a>.</li>
</ul>
<h2 id="using_patterns_in_match_statements">Using patterns in MATCH statements<a class="headerlink" href="#using_patterns_in_match_statements" title="Permanent link">¶</a></h2>
<h3 id="create_indexes">Create indexes<a class="headerlink" href="#create_indexes" title="Permanent link">¶</a></h3>
<div class="highlight"><pre><span></span><code># The following example creates an index on both the name property of the tag player and the edge type follow.
nebula&gt; CREATE TAG INDEX IF NOT EXISTS name ON player(name(20));
nebula&gt; CREATE EDGE INDEX IF NOT EXISTS follow_index on follow();

# The following example rebuilds the index.
nebula&gt; REBUILD TAG INDEX name;
+------------+
| New Job Id |
+------------+
| 121        |
+------------+

nebula&gt; REBUILD EDGE INDEX follow_index;
+------------+
| New Job Id |
+------------+
| 122        |
+------------+


# The following example makes sure the index is rebuilt successfully.
nebula&gt; SHOW JOB 121;
+----------------+---------------------+------------+----------------------------+----------------------------+-------------+
| Job Id(TaskId) | Command(Dest)       | Status     | Start Time                 | Stop Time                  | Error Code  |
+----------------+---------------------+------------+----------------------------+----------------------------+-------------+
| 121            | "REBUILD_TAG_INDEX" | "FINISHED" | 2021-05-27T02:18:02.000000 | 2021-05-27T02:18:02.000000 | "SUCCEEDED" |
| 0              | "storaged1"         | "FINISHED" | 2021-05-27T02:18:02.000000 | 2021-05-27T02:18:02.000000 | "SUCCEEDED" |
| 1              | "storaged0"         | "FINISHED" | 2021-05-27T02:18:02.000000 | 2021-05-27T02:18:02.000000 | "SUCCEEDED" |
| 2              | "storaged2"         | "FINISHED" | 2021-05-27T02:18:02.000000 | 2021-05-27T02:18:02.000000 | "SUCCEEDED" |
+----------------+---------------------+------------+----------------------------+----------------------------+-------------+

nebula&gt; SHOW JOB 122;
+----------------+----------------------+------------+----------------------------+----------------------------+-------------+
| Job Id(TaskId) | Command(Dest)        | Status     | Start Time                 | Stop Time                  | Error Code  |
+----------------+----------------------+------------+----------------------------+----------------------------+-------------+
| 122            | "REBUILD_EDGE_INDEX" | "FINISHED" | 2021-05-27T02:18:11.000000 | 2021-05-27T02:18:11.000000 | "SUCCEEDED" |
| 0              | "storaged1"          | "FINISHED" | 2021-05-27T02:18:11.000000 | 2021-05-27T02:18:21.000000 | "SUCCEEDED" |
| 1              | "storaged0"          | "FINISHED" | 2021-05-27T02:18:11.000000 | 2021-05-27T02:18:21.000000 | "SUCCEEDED" |
| 2              | "storaged2"          | "FINISHED" | 2021-05-27T02:18:11.000000 | 2021-05-27T02:18:21.000000 | "SUCCEEDED" |
+----------------+----------------------+------------+----------------------------+----------------------------+-------------+
</code></pre></div>
<h3 id="match_vertices">Match vertices<a class="headerlink" href="#match_vertices" title="Permanent link">¶</a></h3>
<div class="admonition compatibility">
<p class="admonition-title">Legacy version compatibility</p>
<p>As of version 3.0.0, nGQL support <code>MATCH (v) RETURN v LIMIT n</code>, there is no need to create an index. But you must use <code>LIMIT</code> to limit the number of output results.</p>
<p>nGQL still does not support <code>MATCH (v) RETURN v</code>.</p>
</div>
<p>You can use a user-defined variable in a pair of parentheses to represent a vertex in a pattern. For example: <code>(v)</code>.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v) \
        RETURN v \
        LIMIT 3;
+-----------------------------------------------------------+
| v                                                         |
+-----------------------------------------------------------+
| ("player102" :player{age: 33, name: "LaMarcus Aldridge"}) |
| ("player106" :player{age: 25, name: "Kyle Anderson"})     |
| ("player115" :player{age: 40, name: "Kobe Bryant"})       |
+-----------------------------------------------------------+
</code></pre></div>
<h3 id="match_tags">Match tags<a class="headerlink" href="#match_tags" title="Permanent link">¶</a></h3>
<div class="admonition note">
<p class="admonition-title">Note</p>
<p>In Nebula Graph versions earlier than 3.0.0, the prerequisite for matching a tag is that the tag itself has an index or a certain property of the tag has an index. As of version 3.0.0, there is no need to create an index for matching a tag, but you need to use <code>LIMIT</code> to limit the number of output results.</p>
</div>
<p>You can specify a tag with <code>:&lt;tag_name&gt;</code> after the vertex in a pattern.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player) \
        RETURN v;
+---------------------------------------------------------------+
| v                                                             |
+---------------------------------------------------------------+
| ("player105" :player{age: 31, name: "Danny Green"})           |
| ("player109" :player{age: 34, name: "Tiago Splitter"})        |
| ("player111" :player{age: 38, name: "David West"})            |
...
</code></pre></div>
<p>To match vertices with multiple tags, use colons (:).</p>
<div class="admonition note">
<p class="admonition-title">Note</p>
<p>It is not yet supported to add property conditions when matching vertices with multiple tags.</p>
<p>For example, the statement <code>match (v1:player:team) where v1.player.name=="Tim Duncan" return v1 limit 10;</code> does not work.</p>
</div>
<div class="highlight"><pre><span></span><code>nebula&gt; CREATE TAG actor (name string, age int);
nebula&gt; INSERT VERTEX actor(name, age) VALUES "player100":("Tim Duncan", 42);
nebula&gt; MATCH (v:player:actor) \
        RETURN v \
        LIMIT 10;
+----------------------------------------------------------------------------------------+
| v                                                                                      |
+----------------------------------------------------------------------------------------+
| ("player100" :actor{age: 42, name: "Tim Duncan"} :player{age: 42, name: "Tim Duncan"}) |
+----------------------------------------------------------------------------------------+
</code></pre></div>
<h3 id="match_vertex_properties">Match vertex properties<a class="headerlink" href="#match_vertex_properties" title="Permanent link">¶</a></h3>
<div class="admonition note">
<p class="admonition-title">Note</p>
<p>The prerequisite for matching a vertex property is that the tag itself has an index of the corresponding property. Otherwise, you cannot execute the <code>MATCH</code> statement to match the property.</p>
</div>
<p>You can specify a vertex property with <code>{&lt;prop_name&gt;: &lt;prop_value&gt;}</code> after the tag in a pattern.</p>
<div class="highlight"><pre><span></span><code># The following example uses the name property to match a vertex.
nebula&gt; MATCH (v:player{name:"Tim Duncan"}) \
        RETURN v;
+----------------------------------------------------+
| v                                                  |
+----------------------------------------------------+
| ("player100" :player{age: 42, name: "Tim Duncan"}) |
+----------------------------------------------------+
</code></pre></div>
<p>The <code>WHERE</code> clause can do the same thing:</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player) \
        WHERE v.player.name == "Tim Duncan" \
        RETURN v;
+----------------------------------------------------+
| v                                                  |
+----------------------------------------------------+
| ("player100" :player{age: 42, name: "Tim Duncan"}) |
+----------------------------------------------------+
</code></pre></div>
<div class="admonition note">
<p class="admonition-title">OpenCypher compatibility</p>
<p>In openCypher 9, <code>=</code> is the equality operator. However, in nGQL, <code>==</code> is the equality operator and <code>=</code> is the assignment operator (as in C++ or Java).</p>
</div>
<h3 id="match_vids">Match VIDs<a class="headerlink" href="#match_vids" title="Permanent link">¶</a></h3>
<p>You can use the VID to match a vertex. The <code>id()</code> function can retrieve the VID of a vertex.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v) \
        WHERE id(v) == 'player101' \
        RETURN v;
+-----------------------------------------------------+
| v                                                   |
+-----------------------------------------------------+
| ("player101" :player{age: 36, name: "Tony Parker"}) |
+-----------------------------------------------------+
</code></pre></div>
<p>To match multiple VIDs, use <code>WHERE id(v) IN [vid_list]</code>.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player { name: 'Tim Duncan' })--(v2) \
        WHERE id(v2) IN ["player101", "player102"] \
        RETURN v2;
+-----------------------------------------------------------+
| v2                                                        |
+-----------------------------------------------------------+
| ("player101" :player{age: 36, name: "Tony Parker"})       |
| ("player101" :player{age: 36, name: "Tony Parker"})       |
| ("player102" :player{age: 33, name: "LaMarcus Aldridge"}) |
+-----------------------------------------------------------+
</code></pre></div>
<h3 id="match_connected_vertices">Match connected vertices<a class="headerlink" href="#match_connected_vertices" title="Permanent link">¶</a></h3>
<p>You can use the <code>--</code> symbol to represent edges of both directions and match vertices connected by these edges.</p>
<div class="admonition compatibility">
<p class="admonition-title">Legacy version compatibility</p>
<p>In nGQL 1.x, the <code>--</code> symbol is used for inline comments. Starting from nGQL 2.x, the <code>--</code> symbol represents an incoming or outgoing edge.</p>
</div>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:"Tim Duncan"})--(v2) \
        RETURN v2.player.name AS Name;
+---------------------+
| Name                |
+---------------------+
| "Manu Ginobili"     |
| "Manu Ginobili"     |
| "Tiago Splitter"    |
...
</code></pre></div>
<p>You can add a <code>&gt;</code> or <code>&lt;</code> to the <code>--</code> symbol to specify the direction of an edge.</p>
<p>In the following example, <code>--&gt;</code> represents an edge that starts from <code>v</code> and points to <code>v2</code>. To <code>v</code>, this is an outgoing edge, and to <code>v2</code> this is an incoming edge.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:"Tim Duncan"})--&gt;(v2:player) \
        RETURN v2.player.name AS Name;
+-----------------+
| Name            |
+-----------------+
| "Manu Ginobili" |
| "Tony Parker"   |
+-----------------+
</code></pre></div>
<p>To query the properties of the target vertices, use the <code>CASE</code> expression.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:"Tim Duncan"})--(v2) \
        RETURN \
        CASE WHEN v2.team.name IS NOT NULL \
        THEN v2.team.name  \
        WHEN v2.player.name IS NOT NULL \
        THEN v2.player.name END AS Name;
+---------------------+
| Name                |
+---------------------+
| "Manu Ginobili"     |
| "Manu Ginobili"     |
| "Spurs"             |
| "Dejounte Murray"   |
...
</code></pre></div>
<p>To extend the pattern, you can add more vertices and edges.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:"Tim Duncan"})--&gt;(v2)&lt;--(v3) \
        RETURN v3.player.name AS Name;
+---------------------+
| Name                |
+---------------------+
| "Dejounte Murray"   |
| "LaMarcus Aldridge" |
| "Marco Belinelli"   |
...
</code></pre></div>
<p>If you do not need to refer to a vertex, you can omit the variable representing it in the parentheses.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:"Tim Duncan"})--&gt;()&lt;--(v3) \
        RETURN v3.player.name AS Name;
+---------------------+
| Name                |
+---------------------+
| "Dejounte Murray"   |
| "LaMarcus Aldridge" |
| "Marco Belinelli"   |
...
</code></pre></div>
<h3 id="match_paths">Match paths<a class="headerlink" href="#match_paths" title="Permanent link">¶</a></h3>
<p>Connected vertices and edges form a path. You can use a user-defined variable to name a path as follows.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:"Tim Duncan"})--&gt;(v2) \
        RETURN p;
+--------------------------------------------------------------------------------------------------------------------------------------+
| p                                                                                                                                    |
+--------------------------------------------------------------------------------------------------------------------------------------+
| &lt;("player100" :player{age: 42, name: "Tim Duncan"})-[:serve@0 {end_year: 2016, start_year: 1997}]-&gt;("team204" :team{name: "Spurs"})&gt; |
| &lt;("player100" :player{age: 42, name: "Tim Duncan"})-[:follow@0 {degree: 95}]-&gt;("player101" :player{age: 36, name: "Tony Parker"})&gt;   |
| &lt;("player100" :player{age: 42, name: "Tim Duncan"})-[:follow@0 {degree: 95}]-&gt;("player125" :player{age: 41, name: "Manu Ginobili"})&gt; |
+--------------------------------------------------------------------------------------------------------------------------------------+
</code></pre></div>
<div class="admonition compatibility">
<p class="admonition-title">OpenCypher compatibility</p>
<p>In nGQL, the <code>@</code> symbol represents the rank of an edge, but openCypher has no such concept.</p>
</div>
<h3 id="match_edges">Match edges<a class="headerlink" href="#match_edges" title="Permanent link">¶</a></h3>
<div class="admonition compatibility">
<p class="admonition-title">OpenCypher compatibility</p>
<p>In Nebula Graph versions earlier than 3.0.0, the prerequisite for matching a edge is that the edge itself has an index or a certain property of the edge has an index. As of version 3.0.0, there is no need to create an index for matching a edge, but you need to use <code>LIMIT</code> to limit the number of output results and you must specify the direction of the edge.</p>
</div>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH ()&lt;-[e]-() \
        RETURN e \
        LIMIT 3;
+----------------------------------------------------+
| e                                                  |
+----------------------------------------------------+
| [:follow "player101"-&gt;"player102" @0 {degree: 90}] |
| [:follow "player103"-&gt;"player102" @0 {degree: 70}] |
| [:follow "player135"-&gt;"player102" @0 {degree: 80}] |
+----------------------------------------------------+
</code></pre></div>
<h3 id="match_edge_types">Match edge types<a class="headerlink" href="#match_edge_types" title="Permanent link">¶</a></h3>
<p>Just like vertices, you can specify edge types with <code>:&lt;edge_type&gt;</code> in a pattern. For example: <code>-[e:follow]-</code>.</p>
<div class="admonition compatibility">
<p class="admonition-title">OpenCypher compatibility</p>
<p>In Nebula Graph versions earlier than 3.0.0, the prerequisite for matching a edge type is that the edge type itself has an index or a certain property of the edge type has an index. As of version 3.0.0, there is no need to create an index for matching a edge type, but you need to use <code>LIMIT</code> to limit the number of output results and you must specify the direction of the edge.</p>
</div>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH ()-[e:follow]-&gt;() \
        RETURN e \
        limit 3;
+----------------------------------------------------+
| e                                                  |
+----------------------------------------------------+
| [:follow "player102"-&gt;"player100" @0 {degree: 75}] |
| [:follow "player102"-&gt;"player101" @0 {degree: 75}] |
| [:follow "player129"-&gt;"player116" @0 {degree: 90}] |
+----------------------------------------------------+

# Before you execute the following statement, you must create an index on the edge type itself or a certain property of the edge type
nebula&gt; MATCH ()-[e:follow]-() \
        RETURN e;
+-----------------------------------------------------+
| e                                                   |
+-----------------------------------------------------+
| [:follow "player126"-&gt;"player116" @0 {degree: 13}]  |
| [:follow "player142"-&gt;"player117" @0 {degree: 90}]  |
| [:follow "player136"-&gt;"player117" @0 {degree: 90}]  |
| [:follow "player136"-&gt;"player148" @0 {degree: 85}]  |
···
</code></pre></div>
<h3 id="match_edge_type_properties">Match edge type properties<a class="headerlink" href="#match_edge_type_properties" title="Permanent link">¶</a></h3>
<div class="admonition note">
<p class="admonition-title">Note</p>
<p>The prerequisite for matching an edge type property is that the edge type itself has an index of the corresponding property. Otherwise, you cannot execute the <code>MATCH</code> statement to match the property.</p>
</div>
<p>You can specify edge type properties with <code>{&lt;prop_name&gt;: &lt;prop_value&gt;}</code> in a pattern. For example: <code>[e:follow{likeness:95}]</code>.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:"Tim Duncan"})-[e:follow{degree:95}]-&gt;(v2) \
        RETURN e;
+--------------------------------------------------------+
| e                                                      |
+--------------------------------------------------------+
| [:follow "player100"-&gt;"player101" @0 {degree: 95}]     |
| [:follow "player100"-&gt;"player125" @0 {degree: 95}]     |
+--------------------------------------------------------+
</code></pre></div>
<h3 id="match_multiple_edge_types">Match multiple edge types<a class="headerlink" href="#match_multiple_edge_types" title="Permanent link">¶</a></h3>
<p>The <code>|</code> symbol can help matching multiple edge types. For example: <code>[e:follow|:serve]</code>. The English colon (:) before the first edge type cannot be omitted, but the English colon before the subsequent edge type can be omitted, such as <code>[e:follow|serve]</code>.</p>
<div class="admonition note">
<p class="admonition-title">Note</p>
<p>It is not yet supported to add property conditions when matching data with multiple tags and multiple edge types at the same time.</p>
<p>For example, the statement <code>MATCH (v)-[e:follow|serve]-&gt;(v2) where v.player.name=="Tim Duncan" RETURN e limit 10;</code> does not work. <code>(v)</code> represents a vertex with all its tags.</p>
</div>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:"Tim Duncan"})-[e:follow|:serve]-&gt;(v2) \
        RETURN e;
+---------------------------------------------------------------------------+
| e                                                                         |
+---------------------------------------------------------------------------+
| [:follow "player100"-&gt;"player101" @0 {degree: 95}]                        |
| [:follow "player100"-&gt;"player125" @0 {degree: 95}]                        |
| [:serve "player100"-&gt;"team204" @0 {end_year: 2016, start_year: 1997}]     |
+---------------------------------------------------------------------------+
</code></pre></div>
<h3 id="match_multiple_edges">Match multiple edges<a class="headerlink" href="#match_multiple_edges" title="Permanent link">¶</a></h3>
<p>You can extend a pattern to match multiple edges in a path.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:"Tim Duncan"})-[]-&gt;(v2)&lt;-[e:serve]-(v3) \
        RETURN v2, v3;
+----------------------------------+-----------------------------------------------------------+
| v2                               | v3                                                        |
+----------------------------------+-----------------------------------------------------------+
| ("team204" :team{name: "Spurs"}) | ("player104" :player{age: 32, name: "Marco Belinelli"})   |
| ("team204" :team{name: "Spurs"}) | ("player101" :player{age: 36, name: "Tony Parker"})       |
| ("team204" :team{name: "Spurs"}) | ("player102" :player{age: 33, name: "LaMarcus Aldridge"}) |
...
</code></pre></div>
<h3 id="match_fixed-length_paths">Match fixed-length paths<a class="headerlink" href="#match_fixed-length_paths" title="Permanent link">¶</a></h3>
<p>You can use the <code>:&lt;edge_type&gt;*&lt;hop&gt;</code> pattern to match a fixed-length path. <code>hop</code> must be a non-negative integer.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:"Tim Duncan"})-[e:follow*2]-&gt;(v2) \
        RETURN DISTINCT v2 AS Friends;
+-----------------------------------------------------------+
| Friends                                                   |
+-----------------------------------------------------------+
| ("player100" :player{age: 42, name: "Tim Duncan"})        |
| ("player125" :player{age: 41, name: "Manu Ginobili"})     |
| ("player102" :player{age: 33, name: "LaMarcus Aldridge"}) |
+-----------------------------------------------------------+
</code></pre></div>
<p>If <code>hop</code> is 0, the pattern will match the source vertex of the path.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:"Tim Duncan"}) -[*0]-&gt; (v2) \
        RETURN v2;
+----------------------------------------------------+
| v2                                                 |
+----------------------------------------------------+
| ("player100" :player{age: 42, name: "Tim Duncan"}) |
+----------------------------------------------------+
</code></pre></div>
<div class="admonition note">
<p class="admonition-title">Note</p>
<p>When you conditionally filter on multi-hop edges, such as <code>-[e:follow*2]-&gt;</code>, note that the <code>e</code> is a list of edges instead of a single edge. </p>
<p>For example, the following statement is correct from the syntax point of view which may not get your expected query result, because the <code>e</code> is a list without the <code>.degree</code> property. </p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:"Tim Duncan"})-[e:follow*2]-&gt;(v2) \
        WHERE e.degree &gt; 1 \
        RETURN DISTINCT v2 AS Friends;
</code></pre></div>
<p>The correct statement is as follows:</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:"Tim Duncan"})-[e:follow*2]-&gt;(v2) \
        WHERE ALL(e_ in e WHERE e_.degree &gt; 0) \
        RETURN DISTINCT v2 AS Friends;
</code></pre></div>
<p>Further, the following statement is for filtering the properties of the first-hop edge in multi-hop edges:</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:"Tim Duncan"})-[e:follow*2]-&gt;(v2) \
        WHERE e[0].degree &gt; 98 \
        RETURN DISTINCT v2 AS Friends;
</code></pre></div>
</div>
<h3 id="match_variable-length_paths">Match variable-length paths<a class="headerlink" href="#match_variable-length_paths" title="Permanent link">¶</a></h3>
<p>You can use the <code>:&lt;edge_type&gt;*[minHop..maxHop]</code> pattern to match variable-length paths.<code>minHop</code> and <code>maxHop</code> are optional and default to 1
and infinity respectively.</p>
<div class="admonition note">
<p class="admonition-title">Note</p>
<p>When setting bounds, at least one of <code>minHop</code> and <code>maxHop</code> exists.</p>
</div>
<div class="admonition caution">
<p class="admonition-title">Caution</p>
<p>If <code>maxHop</code> is not set, it may cause the Graph service to OOM, execute this command with caution.</p>
</div>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:"Tim Duncan"})-[e:follow*]-&gt;(v2) \
        RETURN v2 AS Friends;
+-----------------------------------------------------------+
| Friends                                                   |
+-----------------------------------------------------------+
| ("player125" :player{age: 41, name: "Manu Ginobili"})     |
| ("player101" :player{age: 36, name: "Tony Parker"})       |
...

nebula&gt; MATCH p=(v:player{name:"Tim Duncan"})-[e:follow*1..3]-&gt;(v2) \
        RETURN v2 AS Friends;
+-----------------------------------------------------------+
| Friends                                                   |
+-----------------------------------------------------------+
| ("player101" :player{age: 36, name: "Tony Parker"})       |
| ("player125" :player{age: 41, name: "Manu Ginobili"})     |
| ("player100" :player{age: 42, name: "Tim Duncan"})        |
...

nebula&gt; MATCH p=(v:player{name:"Tim Duncan"})-[e:follow*1..]-&gt;(v2) \
        RETURN v2 AS Friends;
+-----------------------------------------------------------+
| Friends                                                   |
+-----------------------------------------------------------+
| ("player125" :player{age: 41, name: "Manu Ginobili"})     |
| ("player101" :player{age: 36, name: "Tony Parker"})       |
| ("player100" :player{age: 42, name: "Tim Duncan"})        |
...
</code></pre></div>
<p>You can use the <code>DISTINCT</code> keyword to aggregate duplicate results.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:"Tim Duncan"})-[e:follow*1..3]-&gt;(v2:player) \
        RETURN DISTINCT v2 AS Friends, count(v2);
+-----------------------------------------------------------+-----------+
| Friends                                                   | count(v2) |
+-----------------------------------------------------------+-----------+
| ("player102" :player{age: 33, name: "LaMarcus Aldridge"}) | 1         |
| ("player100" :player{age: 42, name: "Tim Duncan"})        | 4         |
| ("player101" :player{age: 36, name: "Tony Parker"})       | 3         |
| ("player125" :player{age: 41, name: "Manu Ginobili"})     | 3         |
+-----------------------------------------------------------+-----------+
</code></pre></div>
<p>If <code>minHop</code> is <code>0</code>, the pattern will match the source vertex of the path. Compared to the preceding statement, the following example uses <code>0</code> as the <code>minHop</code>. So in the following result set, <code>"Tim Duncan"</code> is counted one more time than it is in the preceding result set because it is the source vertex.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:"Tim Duncan"})-[e:follow*0..3]-&gt;(v2:player) \
        RETURN DISTINCT v2 AS Friends, count(v2);
+-----------------------------------------------------------+-----------+
| Friends                                                   | count(v2) |
+-----------------------------------------------------------+-----------+
| ("player102" :player{age: 33, name: "LaMarcus Aldridge"}) | 1         |
| ("player100" :player{age: 42, name: "Tim Duncan"})        | 5         |
| ("player125" :player{age: 41, name: "Manu Ginobili"})     | 3         |
| ("player101" :player{age: 36, name: "Tony Parker"})       | 3         |
+-----------------------------------------------------------+-----------+
</code></pre></div>
<h3 id="match_variable-length_paths_with_multiple_edge_types">Match variable-length paths with multiple edge types<a class="headerlink" href="#match_variable-length_paths_with_multiple_edge_types" title="Permanent link">¶</a></h3>
<p>You can specify multiple edge types in a fixed-length or variable-length pattern. In this case, <code>hop</code>, <code>minHop</code>, and <code>maxHop</code> take effect on all edge types.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:"Tim Duncan"})-[e:follow|serve*2]-&gt;(v2) \
        RETURN DISTINCT v2;
+-----------------------------------------------------------+
| v2                                                        |
+-----------------------------------------------------------+
| ("team204" :team{name: "Spurs"})                          |
| ("player100" :player{age: 42, name: "Tim Duncan"})        |
| ("team215" :team{name: "Hornets"})                        |
| ("player125" :player{age: 41, name: "Manu Ginobili"})     |
| ("player102" :player{age: 33, name: "LaMarcus Aldridge"}) |
+-----------------------------------------------------------+
</code></pre></div>
<h3 id="match_multiple_patterns">Match multiple patterns<a class="headerlink" href="#match_multiple_patterns" title="Permanent link">¶</a></h3>
<p>You can separate multiple patterns with commas (,).</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v1:player{name:"Tim Duncan"}), (v2:team{name:"Spurs"}) \
        RETURN v1,v2;
+----------------------------------------------------+----------------------------------+
| v1                                                 | v2                               |
+----------------------------------------------------+----------------------------------+
| ("player100" :player{age: 42, name: "Tim Duncan"}) | ("team204" :team{name: "Spurs"}) |
+----------------------------------------------------+----------------------------------+
</code></pre></div>
<h2 id="retrieve_with_multiple_match">Retrieve with multiple match<a class="headerlink" href="#retrieve_with_multiple_match" title="Permanent link">¶</a></h2>
<p>Multiple <code>MATCH</code> can be used when different patterns have different filtering criteria and return the rows that exactly match the pattern.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (m)-[]-&gt;(n) WHERE id(m)=="player100" \
        MATCH (n)-[]-&gt;(l) WHERE id(n)=="player125" \
        RETURN id(m),id(n),id(l);
+-------------+-------------+-------------+
| id(m)       | id(n)       | id(l)       |
+-------------+-------------+-------------+
| "player100" | "player125" | "team204"   |
| "player100" | "player125" | "player100" |
+-------------+-------------+-------------+
</code></pre></div>
<h2 id="retrieve_with_optional_match">Retrieve with optional match<a class="headerlink" href="#retrieve_with_optional_match" title="Permanent link">¶</a></h2>
<p>See <a href="../optional-match/">OPTIONAL MATCH</a>。</p>
<div class="admonition performance">
<p class="admonition-title">Performance</p>
<p>In Nebula Graph, the performance and resource usage of the <code>MATCH</code> statement have been optimized. But we still recommend to use <code>GO</code>, <code>LOOKUP</code>, <code>|</code>, and <code>FETCH</code> instead of <code>MATCH</code> when high performance is required.</p>
</div>
<hr/>
<div class="md-source-date">
<small>
    
      Last update: <span class="git-revision-date-localized-plugin git-revision-date-localized-plugin-date">June 7, 2022</span>
</small>
</div>
</article>
</div>
</div>
<a class="md-top md-icon" data-md-component="top" data-md-state="hidden" href="#">
<svg viewbox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><path d="M13 20h-2V8l-5.5 5.5-1.42-1.42L12 4.16l7.92 7.92-1.42 1.42L13 8v12z"></path></svg>
</a>
</main>
<footer class="md-footer">
<nav aria-label="Footer" class="md-footer__inner md-grid">
<a class="md-footer__link md-footer__link--prev" href="../../6.functions-and-expressions/9.user-defined-functions/" rel="prev">
<div class="md-footer__button md-icon">
<svg viewbox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><path d="M20 11v2H8l5.5 5.5-1.42 1.42L4.16 12l7.92-7.92L13.5 5.5 8 11h12z"></path></svg>
</div>
<div class="md-footer__title">
<div class="md-ellipsis">
<span class="md-footer__direction">
                Previous
              </span>
              User-defined functions
            </div>
</div>
</a>
<a class="md-footer__link md-footer__link--next" href="../optional-match/" rel="next">
<div class="md-footer__title">
<div class="md-ellipsis">
<span class="md-footer__direction">
                Next
              </span>
              OPTIONAL MATCH
            </div>
</div>
<div class="md-footer__button md-icon">
<svg viewbox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><path d="M4 11v2h12l-5.5 5.5 1.42 1.42L19.84 12l-7.92-7.92L10.5 5.5 16 11H4z"></path></svg>
</div>
</a>
</nav>
<div class="md-footer-meta md-typeset">
<div class="md-footer-meta__inner md-grid">
<div class="md-footer-copyright">
<div class="md-footer-copyright__highlight">
            Copyright © 2022 Nebula Graph
          </div>
        
        Made with
        <a href="https://squidfunk.github.io/mkdocs-material/" rel="noopener" target="_blank">
          Material for MkDocs
        </a>
 ... <a class="link--pdf-download" download href="../../../pdf/NebulaGraph-EN.pdf" title="PDF">download PDF</a></div>
<div class="md-footer-social">
<a class="md-footer-social__link" href="https://github.com/vesoft-inc/nebula-docs" rel="noopener" target="_blank" title="github.com">
<svg viewbox="0 0 496 512" xmlns="http://www.w3.org/2000/svg"><path d="M165.9 397.4c0 2-2.3 3.6-5.2 3.6-3.3.3-5.6-1.3-5.6-3.6 0-2 2.3-3.6 5.2-3.6 3-.3 5.6 1.3 5.6 3.6zm-31.1-4.5c-.7 2 1.3 4.3 4.3 4.9 2.6 1 5.6 0 6.2-2s-1.3-4.3-4.3-5.2c-2.6-.7-5.5.3-6.2 2.3zm44.2-1.7c-2.9.7-4.9 2.6-4.6 4.9.3 2 2.9 3.3 5.9 2.6 2.9-.7 4.9-2.6 4.6-4.6-.3-1.9-3-3.2-5.9-2.9zM244.8 8C106.1 8 0 113.3 0 252c0 110.9 69.8 205.8 169.5 239.2 12.8 2.3 17.3-5.6 17.3-12.1 0-6.2-.3-40.4-.3-61.4 0 0-70 15-84.7-29.8 0 0-11.4-29.1-27.8-36.6 0 0-22.9-15.7 1.6-15.4 0 0 24.9 2 38.6 25.8 21.9 38.6 58.6 27.5 72.9 20.9 2.3-16 8.8-27.1 16-33.7-55.9-6.2-112.3-14.3-112.3-110.5 0-27.5 7.6-41.3 23.6-58.9-2.6-6.5-11.1-33.3 2.6-67.9 20.9-6.5 69 27 69 27 20-5.6 41.5-8.5 62.8-8.5s42.8 2.9 62.8 8.5c0 0 48.1-33.6 69-27 13.7 34.7 5.2 61.4 2.6 67.9 16 17.7 25.8 31.5 25.8 58.9 0 96.5-58.9 104.2-114.8 110.5 9.2 7.9 17 22.9 17 46.4 0 33.7-.3 75.4-.3 83.6 0 6.5 4.6 14.4 17.3 12.1C428.2 457.8 496 362.9 496 252 496 113.3 383.5 8 244.8 8zM97.2 352.9c-1.3 1-1 3.3.7 5.2 1.6 1.6 3.9 2.3 5.2 1 1.3-1 1-3.3-.7-5.2-1.6-1.6-3.9-2.3-5.2-1zm-10.8-8.1c-.7 1.3.3 2.9 2.3 3.9 1.6 1 3.6.7 4.3-.7.7-1.3-.3-2.9-2.3-3.9-2-.6-3.6-.3-4.3.7zm32.4 35.6c-1.6 1.3-1 4.3 1.3 6.2 2.3 2.3 5.2 2.6 6.5 1 1.3-1.3.7-4.3-1.3-6.2-2.2-2.3-5.2-2.6-6.5-1zm-11.4-14.7c-1.6 1-1.6 3.6 0 5.9 1.6 2.3 4.3 3.3 5.6 2.3 1.6-1.3 1.6-3.9 0-6.2-1.4-2.3-4-3.3-5.6-2z"></path></svg>
</a>
</div>
</div>
</div>
</footer>
</div>
<div class="md-dialog" data-md-component="dialog">
<div class="md-dialog__inner md-typeset"></div>
</div>
<script id="__config" type="application/json">{"base": "../../..", "features": ["navigation.top", "header.autohide", "content.tabs.link"], "search": "../../../assets/javascripts/workers/search.fe42c31b.min.js", "translations": {"clipboard.copied": "Copied to clipboard", "clipboard.copy": "Copy to clipboard", "search.config.lang": "en", "search.config.pipeline": "trimmer, stopWordFilter", "search.config.separator": "[\\s\\-]+", "search.placeholder": "Search", "search.result.more.one": "1 more on this page", "search.result.more.other": "# more on this page", "search.result.none": "No matching documents", "search.result.one": "1 matching document", "search.result.other": "# matching documents", "search.result.placeholder": "Type to start searching", "search.result.term.missing": "Missing"}, "version": {"method": "mike"}}</script>
<script src="../../../assets/javascripts/bundle.d892486b.min.js"></script>
<script src="../../../js/jquery.js"></script>
<script src="../../../js/search.js"></script>
<script src="../../../js/config.js"></script>
<script src="../../../js/version-select.js"></script>
<script src="https://polyfill.io/v3/polyfill.min.js?features=es6"></script>
<script src="https://cdn.jsdelivr.net/npm/mathjax@3/es5/tex-mml-chtml.js"></script>
<script src="../../../js/hotjar.js"></script>
</body>
</html>