# FAQ

## About openCypher compatibility

### Is nGQL compatible with openCypher 9?

nGQL is partially compatible with openCypher 9. 
Known incompatible items are listed in [Nebula Graph Issues](https://github.com/vesoft-inc/nebula-graph/issues). Submit an issue with the `incompatible` tag if you find a new issue of this type. You can search in this manual with the keyword
`compatibility` to find major compatibility issues.

The following are some major differences (by design incompatible) between nGQL and openCypher.

| openCypher 9 | nGQL |
| - | - |
| schema optional | strong schema |
| equality operator '=' |  equality operator '==' |
| math exponentiation `^` | `^` not supported. Use pow(x, y) instead. |  
| no such concept | edge rank (reference by @) |
| all DMLs (`CREATE`, `MERGE`, etc), and `OPTIONAL MATCH` are not supported.  |

> Please also note that [openCypher](http://www.opencypher.org/) 9 and [Cypher](https://neo4j.com/developer/cypher/) have some differences (in grammar and licence).

> E.g., Cypher requires that **All Cypher statements are explicitly run within a transaction**. While openCypher has no such requirement of `transaction`. And nGQL does not support transaction.

### Where can I find more nGQL examples?

Find more than **2500** nGQL examples in the [features directory](https://github.com/vesoft-inc/nebula-graph/tree/master/tests/tck/features) on the Nebula Graph GitHub page.

The `features` directory consists of `.feature` files. Each file records scenarios that you can use as nGQL examples.

Here is an example:

```text
Feature: Match seek by tag

  Background: Prepare space
    Given a graph with space named "nba"

  Scenario: seek by empty tag index
    When executing query:
      """
      MATCH (v:bachelor)
      RETURN id(v) AS vid
      """
    Then the result should be, in any order:
      | vid          |
      | 'Tim Duncan' |
    And no side effects
    When executing query:
      """
      MATCH (v:bachelor)
      RETURN id(v) AS vid, v.age AS age
      """
    Then the result should be, in any order:
      | vid          | age |
      | 'Tim Duncan' | 42  |
    And no side effects
```

The keywords in the preceding example are described as follows:

|Keyword|Description|
|-|-|
|`Feature`|Describes the topic of the current `.feature` file.|
|`Background`|Describes the background information of the current `.feature` file.|
|`Given`|Describes the prerequisites of running the test statements in the current `.feature` file.|
|`Scenario`|Describes the purpose of the scenario. If there is the `@skip` before `Scenario`, this scenario may not work and don't use it as a working example.|
|`When`|Describes the nGQL statement to be executed.|
|`Then`|Describes the expected result of running the statement in the `When` clause. If the result in your environment does not match the result described in the `.feature` file, submit an [issue](https://github.com/vesoft-inc/nebula-graph/issues) to inform the Nebula Graph team.|
|`And`|Describes the side effects of running the statement in the `When` clause.|
| @skip | This test case will be skipped. Commonly, the to-be-tested code is not ready. |

Welcome to [add more practical scenarios](https://docs.nebula-graph.io/1.1/manual-EN/4.contributions/how-to-contribute/) and become a Nebula Graph contributor.

## About Data Model

### Does Nebula Graph support W3C `RDF` (or `SPARQL`, `GraphQL`)?

No.

Nebula Graph's data model is the property graph, and it is a strong schema system.

It doesn't support rdf.

Nebula Graph Query Language does not support `SPARQL` nor `GraphQL`.

## About executions

### How is the time spent value at the end of each return message calculated?

Take the return message of `SHOW SPACES` as an example:

```nGQL
nebula> SHOW SPACES;
+------+
| Name |
+------+
| nba  |
+------+
Got 1 rows (time spent 1235/1934 us)
```

* The first number 1235 shows the time spent by the database itself, that is, the time it takes for the query engine to receive a query from the client, fetch the data from the storage server and perform a series of calculations.

* The second number 1934 shows the time spent from the client's perspective, that is, the time it takes for the client from sending a request, receiving a response, and displaying the result on the screen.

### Can I set `replica_factor` as an even number in `CREATE SPACE` (e.g., replica_factor = 2) ?

NO.

The Storage Service garantees its availability based on the Raft consensus protocol. The number of failed replicas must not exceed half of the total replica number.

When `replica_factor=2`, if one replica fails, the Storage Service fails. No matter `replica_factor=3` or `replica_factor=4`, if more than one replica fails, the Storage Service fails, so `replica_factor=3` is recommended. 

To prevent unnecessary waste of resources, we recommend that you set an odd replica number.

We suggest that you set replica_factor to 3 for the production environment and 1 for the test environment. Do not use an even number.

### `[ERROR (-7)]: SyntaxError: syntax error near ` '`  

In most cases, a query statement requires a `YIELD` or a `RETURN`. Check your query statement to see if `YIELD` or `RETURN` is provided.

### How to count the vertices/edges number of each tag/edge type?

See [show-stats](../3.ngql-guide/7.general-query-statements/6.show/14.show-stats.md).

### How to get all the vertices/edge of each tag/edge type?

1. create and rebuild index

```ngql
> CREATE TAG INDEX i_player ON player();
> REBUILD TAG INDEX i_player;
```

2. use `LOOKUP` or `MATCH`

```ngql
> LOOKUP ON player;
> MATCH (n:player) RETURN n;
```

See [`INDEX`](../3.ngql-guide/14.native-index-statements/1.create-native-index.md), [`LOOKUP`](../3.ngql-guide/7.general-query-statements/5.lookup.md) and [`MATCH`](../3.ngql-guide/7.general-query-statements/2.match.md).

### Error `can’t solve the start vids from the sentence`

The graphd requires `start vids` to begin a graph traversal. The `start vids` can either be specified by the user, for example,

```ngql
> GO FROM ${vids} ...
> MATCH (src) WHERE id(src) == ${vids}
# The start vids are explicitly given by ${vids}.
```

or be found from a (property) index, for example, 

```ngql
# CREATE TAG INDEX i_player ON player(name(20));
# REBUILD TAG INDEX i_player;

> LOOKUP ON player WHERE player.name == "abc" | ... YIELD ...
> MATCH (src) WHERE src.name == "abc" ... 
# The start vids are found from the property index on name.
```

Otherwise, an error like `can’t solve the start vids from the sentence` will be raised.

## About operations

### The log files are too large. How to recycle the logs

Nebula Graph uses [glog](https://github.com/google/glog) to print logs. `glog` can't recycle the outdated files. You can use crontab to delete them by yourself. Refer to the discussions of [`Glog should delete old log files automaticly`](https://github.com/google/glog/issues/423).

## About manual updates

### The behavior of manual is not consistent with the system

Nebula Graph 2.0 is still under development. Its behavior changes from time to time. Please tell us if the manual and the system are not consistent.
