# FETCH VERTEX

```ngql
FETCH PROP ON {<tag_name_list> | *} <vertex_id_list> [YIELD [DISTINCT] <return_list>]

tag_name_list ::=
  [tag_name [, tag_name] ...]

vertex_id_list ::=
  [vertex_id [, vertex_id] ...]

return_list ::=
    [col_name [AS col_alias] [, col_name [AS col_alias]] ...]
```

Use `FETCH` to retrieve properties for vertices. [Pipe](../5.operators/4.pipe.md) and user-defined variables (doc TODO) are permitted in a `FETCH` statement.

- Multiple tags are permitted in a singe `FETCH` statement, separated by commas.
- `*` returns all the properties of the specified vertex.
- Multiple vertices are permitted in a singe `FETCH` statement, separated by commas.
- `YIELD` specifies the properties to be returned. For more information, see YIELD (doc TODO).

## Example

```nql
nebula> FETCH PROP ON player "player101";
+-------------+---------------+------------+
| VertexID    | player.name   | player.age |
+-------------+---------------+------------+
| "player101" | "Tony Parker" | 36         |
+-------------+---------------+------------+

// Two tags: team and player.
nebula> FETCH PROP ON * "player101", "team202", "player103";
+-------------+---------------+------------+-----------+
| VertexID    | player.name   | player.age | team.name |
+-------------+---------------+------------+-----------+
| "player101" | "Tony Parker" | 36         | __EMPTY__ |
+-------------+---------------+------------+-----------+
| "team202"   | __EMPTY__     | __EMPTY__  | "Rockets" |
+-------------+---------------+------------+-----------+
| "player103" | "Rudy Gay"    | 32         | __EMPTY__ |
+-------------+---------------+------------+-----------+

nebula> GO FROM "player100" OVER follow YIELD follow._dst AS id | \
FETCH PROP ON player $-.id YIELD player.name, player.age;
+-------------+-----------------+------------+
| VertexID    | player.name     | player.age |
+-------------+-----------------+------------+
| "player101" | "Tony Parker"   | 36         |
+-------------+-----------------+------------+
| "player125" | "Manu Ginobili" | 41         |
+-------------+-----------------+------------+

nebula> GO FROM "player100" OVER follow \
YIELD follow._dst, $$.player.name, $$.player.age;
+-------------+-----------------+---------------+
| follow._dst | $$.player.name  | $$.player.age |
+-------------+-----------------+---------------+
| "player101" | "Tony Parker"   | 36            |
+-------------+-----------------+---------------+
| "player125" | "Manu Ginobili" | 41            |
+-------------+-----------------+---------------+

nebula> $var = GO FROM "player100" OVER follow YIELD follow._dst AS id; \
FETCH PROP ON player $var.id YIELD player.name, player.age;
+-------------+-----------------+------------+
| VertexID    | player.name     | player.age |
+-------------+-----------------+------------+
| "player101" | "Tony Parker"   | 36         |
+-------------+-----------------+------------+
| "player125" | "Manu Ginobili" | 41         |
+-------------+-----------------+------------+
````
