



<!doctype html>
<html lang="en" class="no-js">
  <head>
    
      <meta charset="utf-8">
      <meta name="viewport" content="width=device-width,initial-scale=1">
      <meta http-equiv="x-ua-compatible" content="ie=edge">
      
        <meta name="description" content="Documentation for Nebula Graph Database">
      
      
        <link rel="canonical" href="https://docs.nebula-graph.io/3.ngql-guide/7.general-query-statements/2.match/">
      
      
        <meta name="author" content="Nebula Graph">
      
      
        <meta name="lang:clipboard.copy" content="Copy to clipboard">
      
        <meta name="lang:clipboard.copied" content="Copied to clipboard">
      
        <meta name="lang:search.language" content="en">
      
        <meta name="lang:search.pipeline.stopwords" content="True">
      
        <meta name="lang:search.pipeline.trimmer" content="True">
      
        <meta name="lang:search.result.none" content="No matching documents">
      
        <meta name="lang:search.result.one" content="1 matching document">
      
        <meta name="lang:search.result.other" content="# matching documents">
      
        <meta name="lang:search.tokenizer" content="[\s\-]+">
      
      <link rel="shortcut icon" href="../../../assets/images/favicon.ico">
      <meta name="generator" content="mkdocs-1.1, mkdocs-material-4.6.3">
    
    
      
        <title>Match - Nebula Graph Database Manual</title>
      
    
    
      <link rel="stylesheet" href="../../../assets/stylesheets/application.adb8469c.css">
      
        <link rel="stylesheet" href="../../../assets/stylesheets/application-palette.a8b3c06d.css">
      
      
        
        
        <meta name="theme-color" content="#3f51b5">
      
    
    
      <script src="../../../assets/javascripts/modernizr.86422ebf.js"></script>
    
    
      
        <link href="https://fonts.gstatic.com" rel="preconnect" crossorigin>
        <link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Roboto:300,400,400i,700%7CRoboto+Mono&display=fallback">
        <style>body,input{font-family:"Roboto","Helvetica Neue",Helvetica,Arial,sans-serif}code,kbd,pre{font-family:"Roboto Mono","Courier New",Courier,monospace}</style>
      
    
    <link rel="stylesheet" href="../../../assets/fonts/material-icons.css">
    
    
      <link rel="stylesheet" href="../../../stylesheets/logo.css">
    
      <link rel="stylesheet" href="../../../css/version-select.css">
    
    
      
    
    
  </head>
  
    
    
    <body dir="ltr" data-md-color-primary="indigo" data-md-color-accent="indigo">
  
    <svg class="md-svg">
      <defs>
        
        
          <svg xmlns="http://www.w3.org/2000/svg" width="416" height="448" viewBox="0 0 416 448" id="__github"><path fill="currentColor" d="M160 304q0 10-3.125 20.5t-10.75 19T128 352t-18.125-8.5-10.75-19T96 304t3.125-20.5 10.75-19T128 256t18.125 8.5 10.75 19T160 304zm160 0q0 10-3.125 20.5t-10.75 19T288 352t-18.125-8.5-10.75-19T256 304t3.125-20.5 10.75-19T288 256t18.125 8.5 10.75 19T320 304zm40 0q0-30-17.25-51T296 232q-10.25 0-48.75 5.25Q229.5 240 208 240t-39.25-2.75Q130.75 232 120 232q-29.5 0-46.75 21T56 304q0 22 8 38.375t20.25 25.75 30.5 15 35 7.375 37.25 1.75h42q20.5 0 37.25-1.75t35-7.375 30.5-15 20.25-25.75T360 304zm56-44q0 51.75-15.25 82.75-9.5 19.25-26.375 33.25t-35.25 21.5-42.5 11.875-42.875 5.5T212 416q-19.5 0-35.5-.75t-36.875-3.125-38.125-7.5-34.25-12.875T37 371.5t-21.5-28.75Q0 312 0 260q0-59.25 34-99-6.75-20.5-6.75-42.5 0-29 12.75-54.5 27 0 47.5 9.875t47.25 30.875Q171.5 96 212 96q37 0 70 8 26.25-20.5 46.75-30.25T376 64q12.75 25.5 12.75 54.5 0 21.75-6.75 42 34 40 34 99.5z"/></svg>
        
      </defs>
    </svg>
    <input class="md-toggle" data-md-toggle="drawer" type="checkbox" id="__drawer" autocomplete="off">
    <input class="md-toggle" data-md-toggle="search" type="checkbox" id="__search" autocomplete="off">
    <label class="md-overlay" data-md-component="overlay" for="__drawer"></label>
    
      <a href="#match" tabindex="0" class="md-skip">
        Skip to content
      </a>
    
    
      <header class="md-header" data-md-component="header">
  <nav class="md-header-nav md-grid">
    <div class="md-flex">
      <div class="md-flex__cell md-flex__cell--shrink">
        <a href="https://docs.nebula-graph.io" title="Nebula Graph Database Manual" aria-label="Nebula Graph Database Manual" class="md-header-nav__button md-logo">
          
            <img alt="logo" src="https://cloud-cdn.nebula-graph.com.cn/vesoft-nebula-logo-white.png" width="24" height="24">
          
        </a>
      </div>
      <div class="md-flex__cell md-flex__cell--shrink">
        <label class="md-icon md-icon--menu md-header-nav__button" for="__drawer"></label>
      </div>
      <div class="md-flex__cell md-flex__cell--stretch">
        <div class="md-flex__ellipsis md-header-nav__title" data-md-component="title">
          
            <span class="md-header-nav__topic">
              Nebula Graph Database Manual
            </span>
            <span class="md-header-nav__topic">
              
                Match
              
            </span>
          
        </div>
      </div>
      <div class="md-flex__cell md-flex__cell--shrink">
        
          <label class="md-icon md-icon--search md-header-nav__button" for="__search"></label>
          
<div class="md-search" data-md-component="search" role="dialog">
  <label class="md-search__overlay" for="__search"></label>
  <div class="md-search__inner" role="search">
    <form class="md-search__form" name="search">
      <input type="text" class="md-search__input" aria-label="search" name="query" placeholder="Search" autocapitalize="off" autocorrect="off" autocomplete="off" spellcheck="false" data-md-component="query" data-md-state="active">
      <label class="md-icon md-search__icon" for="__search"></label>
      <button type="reset" class="md-icon md-search__icon" data-md-component="reset" tabindex="-1">
        &#xE5CD;
      </button>
    </form>
    <div class="md-search__output">
      <div class="md-search__scrollwrap" data-md-scrollfix>
        <div class="md-search-result" data-md-component="result">
          <div class="md-search-result__meta">
            Type to start searching
          </div>
          <ol class="md-search-result__list"></ol>
        </div>
      </div>
    </div>
  </div>
</div>
        
      </div>
      
        <div class="md-flex__cell md-flex__cell--shrink">
          <div class="md-header-nav__source">
            


  

<a href="https://github.com/vesoft-inc/nebula" title="Go to repository" class="md-source" data-md-source="github">
  
    <div class="md-source__icon">
      <svg viewBox="0 0 24 24" width="24" height="24">
        <use xlink:href="#__github" width="24" height="24"></use>
      </svg>
    </div>
  
  <div class="md-source__repository">
    vesoft-inc/nebula
  </div>
</a>
          </div>
        </div>
      
    </div>
  </nav>
</header>
    
    <div class="md-container">
      
        
      
      
        

  

<nav class="md-tabs md-tabs--active" data-md-component="tabs">
  <div class="md-tabs__inner md-grid">
    <ul class="md-tabs__list">
      
        
  
  
    <li class="md-tabs__item">
      
        <a href="../../../1.introduction/1.what-is-nebula-graph/" class="md-tabs__link">
          Introduction
        </a>
      
    </li>
  

      
        
  
  
    <li class="md-tabs__item">
      
        <a href="../../../2.quick-start/1.quick-start-workflow/" class="md-tabs__link">
          Quick start
        </a>
      
    </li>
  

      
        
  
  
    
    
  
  
    <li class="md-tabs__item">
      
        <a href="../../3.data-types/1.numeric/" class="md-tabs__link">
          nGQL guide
        </a>
      
    </li>
  

  

      
        
  
  
    <li class="md-tabs__item">
      
        <a href="../../../4.deployment-and-installation/1.resource-preparations/" class="md-tabs__link">
          Deployment and installation
        </a>
      
    </li>
  

      
        
  
  
    
    
  
  
    <li class="md-tabs__item">
      
        <a href="../../../nebula-studio/about-studio/st-ug-what-is-graph-studio/" class="md-tabs__link">
          Nebula Graph Studio
        </a>
      
    </li>
  

  

      
    </ul>
  </div>
</nav>
      
      <main class="md-main" role="main">
        <div class="md-main__inner md-grid" data-md-component="container">
          
            
              <div class="md-sidebar md-sidebar--primary" data-md-component="navigation">
                <div class="md-sidebar__scrollwrap">
                  <div class="md-sidebar__inner">
                    <nav class="md-nav md-nav--primary" data-md-level="0">
  <label class="md-nav__title md-nav__title--site" for="__drawer">
    <a href="https://docs.nebula-graph.io" title="Nebula Graph Database Manual" class="md-nav__button md-logo">
      
        <img alt="logo" src="https://cloud-cdn.nebula-graph.com.cn/vesoft-nebula-logo-white.png" width="48" height="48">
      
    </a>
    Nebula Graph Database Manual
  </label>
  
    <div class="md-nav__source">
      


  

<a href="https://github.com/vesoft-inc/nebula" title="Go to repository" class="md-source" data-md-source="github">
  
    <div class="md-source__icon">
      <svg viewBox="0 0 24 24" width="24" height="24">
        <use xlink:href="#__github" width="24" height="24"></use>
      </svg>
    </div>
  
  <div class="md-source__repository">
    vesoft-inc/nebula
  </div>
</a>
    </div>
  
  <ul class="md-nav__list" data-md-scrollfix>
    
      
      
      


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-1" type="checkbox" id="nav-1">
    
    <label class="md-nav__link" for="nav-1">
      Introduction
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="1">
      <label class="md-nav__title" for="nav-1">
        Introduction
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../../1.introduction/1.what-is-nebula-graph/" title="What is Nebula Graph" class="md-nav__link">
      What is Nebula Graph
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-1-2" type="checkbox" id="nav-1-2">
    
    <label class="md-nav__link" for="nav-1-2">
      Nebula Graph architecture
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="2">
      <label class="md-nav__title" for="nav-1-2">
        Nebula Graph architecture
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../../1.introduction/3.nebula-graph-architecture/1.architecture-overview/" title="Architecture overview" class="md-nav__link">
      Architecture overview
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../1.introduction/3.nebula-graph-architecture/2.meta-service/" title="Meta Service" class="md-nav__link">
      Meta Service
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
      </ul>
    </nav>
  </li>

    
      
      
      


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-2" type="checkbox" id="nav-2">
    
    <label class="md-nav__link" for="nav-2">
      Quick start
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="1">
      <label class="md-nav__title" for="nav-2">
        Quick start
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../../2.quick-start/1.quick-start-workflow/" title="Quick start workflow" class="md-nav__link">
      Quick start workflow
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../2.quick-start/2.deploy-nebula-graph-with-docker-compose/" title="Deploy Nebula Graph with Docker Compose" class="md-nav__link">
      Deploy Nebula Graph with Docker Compose
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../2.quick-start/3.connect-to-nebula-graph/" title="Connect to Nebula Graph" class="md-nav__link">
      Connect to Nebula Graph
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../2.quick-start/4.nebula-graph-crud/" title="Nebula Graph CRUD" class="md-nav__link">
      Nebula Graph CRUD
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

    
      
      
      

  


  <li class="md-nav__item md-nav__item--active md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-3" type="checkbox" id="nav-3" checked>
    
    <label class="md-nav__link" for="nav-3">
      nGQL guide
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="1">
      <label class="md-nav__title" for="nav-3">
        nGQL guide
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-3-1" type="checkbox" id="nav-3-1">
    
    <label class="md-nav__link" for="nav-3-1">
      Data types
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="2">
      <label class="md-nav__title" for="nav-3-1">
        Data types
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../3.data-types/1.numeric/" title="Numeric" class="md-nav__link">
      Numeric
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../3.data-types/2.boolean/" title="Boolean" class="md-nav__link">
      Boolean
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../3.data-types/3.string/" title="String" class="md-nav__link">
      String
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../3.data-types/4.date-and-time/" title="Date and time" class="md-nav__link">
      Date and time
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../3.data-types/5.null/" title="NULL" class="md-nav__link">
      NULL
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../3.data-types/6.list/" title="List" class="md-nav__link">
      List
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../3.data-types/7.set/" title="Set" class="md-nav__link">
      Set
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../3.data-types/8.map/" title="Map" class="md-nav__link">
      Map
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../3.data-types/9.type-conversion/" title="Type conversion" class="md-nav__link">
      Type conversion
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-3-2" type="checkbox" id="nav-3-2">
    
    <label class="md-nav__link" for="nav-3-2">
      Operators
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="2">
      <label class="md-nav__title" for="nav-3-2">
        Operators
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../5.operators/1.comparison/" title="Comparison" class="md-nav__link">
      Comparison
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../5.operators/4.pipe/" title="Pipe" class="md-nav__link">
      Pipe
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../5.operators/5.property-reference/" title="Property reference" class="md-nav__link">
      Property reference
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../5.operators/6.set/" title="Set" class="md-nav__link">
      Set
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../5.operators/7.string/" title="String" class="md-nav__link">
      String
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../5.operators/9.precedence/" title="Precedence" class="md-nav__link">
      Precedence
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-3-3" type="checkbox" id="nav-3-3">
    
    <label class="md-nav__link" for="nav-3-3">
      Functions and expressions
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="2">
      <label class="md-nav__title" for="nav-3-3">
        Functions and expressions
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../6.functions-and-expressions/1.math/" title="Math" class="md-nav__link">
      Math
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../6.functions-and-expressions/2.string/" title="String" class="md-nav__link">
      String
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../6.functions-and-expressions/3.date-and-time/" title="Date and time" class="md-nav__link">
      Date and time
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../6.functions-and-expressions/4.schema/" title="Schema" class="md-nav__link">
      Schema
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../6.functions-and-expressions/5.case-expressions/" title="Case expressions" class="md-nav__link">
      Case expressions
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          

  


  <li class="md-nav__item md-nav__item--active md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-3-4" type="checkbox" id="nav-3-4" checked>
    
    <label class="md-nav__link" for="nav-3-4">
      General queries statements
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="2">
      <label class="md-nav__title" for="nav-3-4">
        General queries statements
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          

  


  <li class="md-nav__item md-nav__item--active">
    
    <input class="md-toggle md-nav__toggle" data-md-toggle="toc" type="checkbox" id="__toc">
    
      
    
    
      <label class="md-nav__link md-nav__link--active" for="__toc">
        Match
      </label>
    
    <a href="./" title="Match" class="md-nav__link md-nav__link--active">
      Match
    </a>
    
      
<nav class="md-nav md-nav--secondary">
  
  
    
  
  
    <label class="md-nav__title" for="__toc">Table of contents</label>
    <ul class="md-nav__list" data-md-scrollfix>
      
        <li class="md-nav__item">
  <a href="#syntax" class="md-nav__link">
    Syntax
  </a>
  
</li>
      
        <li class="md-nav__item">
  <a href="#the_workflow_of_match" class="md-nav__link">
    The workflow of MATCH
  </a>
  
</li>
      
        <li class="md-nav__item">
  <a href="#use_patterns_in_match_statements" class="md-nav__link">
    Use patterns in MATCH statements
  </a>
  
    <nav class="md-nav">
      <ul class="md-nav__list">
        
          <li class="md-nav__item">
  <a href="#match_a_vertex" class="md-nav__link">
    Match a vertex
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#match_on_vertex_tag_and_property" class="md-nav__link">
    Match on vertex tag and property
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#match_on_vid" class="md-nav__link">
    Match on VID
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#match_connected_vertices" class="md-nav__link">
    Match connected vertices
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#match_paths" class="md-nav__link">
    Match paths
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#match_edges" class="md-nav__link">
    Match edges
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#match_on_edge_types_and_properties" class="md-nav__link">
    Match on edge types and properties
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#match_on_multiple_edge_types" class="md-nav__link">
    Match on multiple edge types
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#match_multiple_edges" class="md-nav__link">
    Match multiple edges
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#match_fixed-length_paths" class="md-nav__link">
    Match fixed-length paths
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#match_variable-length_paths" class="md-nav__link">
    Match variable-length paths
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#match_variable-length_paths_with_multiple_edge_types" class="md-nav__link">
    Match variable-length paths with multiple edge types
  </a>
  
</li>
        
      </ul>
    </nav>
  
</li>
      
        <li class="md-nav__item">
  <a href="#common_retrieves" class="md-nav__link">
    Common retrieves
  </a>
  
    <nav class="md-nav">
      <ul class="md-nav__list">
        
          <li class="md-nav__item">
  <a href="#retrieve_vertex_or_edge_information" class="md-nav__link">
    Retrieve vertex or edge information
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#retrieve_vids" class="md-nav__link">
    Retrieve VIDs
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#retrieve_tags" class="md-nav__link">
    Retrieve tags
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#retrieve_a_single_property_on_a_vertex_or_an_edge" class="md-nav__link">
    Retrieve a single property on a vertex or an edge
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#retrieve_all_properties_on_a_vertex_or_an_edge" class="md-nav__link">
    Retrieve all properties on a vertex or an edge
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#retrieve_edge_types" class="md-nav__link">
    Retrieve edge types
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#retrieve_paths" class="md-nav__link">
    Retrieve paths
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#retrieve_vertices_in_a_path" class="md-nav__link">
    Retrieve vertices in a path
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#retrieve_edges_in_a_path" class="md-nav__link">
    Retrieve edges in a path
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#retrieve_path_length" class="md-nav__link">
    Retrieve path length
  </a>
  
</li>
        
      </ul>
    </nav>
  
</li>
      
      
      
      
      
    </ul>
  
</nav>
    
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../5.lookup/" title="LOOKUP" class="md-nav__link">
      LOOKUP
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-3-4-3" type="checkbox" id="nav-3-4-3">
    
    <label class="md-nav__link" for="nav-3-4-3">
      SHOW
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="3">
      <label class="md-nav__title" for="nav-3-4-3">
        SHOW
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../6.show/14.show-stats/" title="SHOW STATS" class="md-nav__link">
      SHOW STATS
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-3-5" type="checkbox" id="nav-3-5">
    
    <label class="md-nav__link" for="nav-3-5">
      Space statements
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="2">
      <label class="md-nav__title" for="nav-3-5">
        Space statements
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../9.space-statements.md/1.create-space/" title="CREATE SPACE" class="md-nav__link">
      CREATE SPACE
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../9.space-statements.md/2.use-space/" title="USE SPACE" class="md-nav__link">
      USE SPACE
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../9.space-statements.md/3.show-spaces/" title="SHOW SPACES" class="md-nav__link">
      SHOW SPACES
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../9.space-statements.md/4.describe-space/" title="DESCRIBE SPACE" class="md-nav__link">
      DESCRIBE SPACE
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../9.space-statements.md/5.drop-space/" title="DROP SPACE" class="md-nav__link">
      DROP SPACE
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-3-6" type="checkbox" id="nav-3-6">
    
    <label class="md-nav__link" for="nav-3-6">
      Vertex statements
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="2">
      <label class="md-nav__title" for="nav-3-6">
        Vertex statements
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../12.vertex-statements/1.insert-vertex/" title="INSERT VERTEX" class="md-nav__link">
      INSERT VERTEX
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../12.vertex-statements/2.update-vertex/" title="UPDATE VERTEX" class="md-nav__link">
      UPDATE VERTEX
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../12.vertex-statements/3.upsert-vertex/" title="UPSERT VERTEX" class="md-nav__link">
      UPSERT VERTEX
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../12.vertex-statements/4.delete-vertex/" title="DELETE VERTEX" class="md-nav__link">
      DELETE VERTEX
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-3-7" type="checkbox" id="nav-3-7">
    
    <label class="md-nav__link" for="nav-3-7">
      Edge statements
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="2">
      <label class="md-nav__title" for="nav-3-7">
        Edge statements
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../13.edge-statements/1.insert-edge/" title="INSERT EDGE" class="md-nav__link">
      INSERT EDGE
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../13.edge-statements/2.update-edge/" title="UPDATE EDGE" class="md-nav__link">
      UPDATE EDGE
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../13.edge-statements/3.upsert-edge/" title="UPSERT EDGE" class="md-nav__link">
      UPSERT EDGE
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../13.edge-statements/4.delete-edge/" title="DELETE EDGE" class="md-nav__link">
      DELETE EDGE
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-3-8" type="checkbox" id="nav-3-8">
    
    <label class="md-nav__link" for="nav-3-8">
      Index statements
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="2">
      <label class="md-nav__title" for="nav-3-8">
        Index statements
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../14.index-statements/" title="Index overview" class="md-nav__link">
      Index overview
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../14.index-statements/1.create-native-index/" title="CREATE INDEX" class="md-nav__link">
      CREATE INDEX
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../14.index-statements/2.show-native-indexes/" title="SHOW INDEX" class="md-nav__link">
      SHOW INDEX
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../14.index-statements/3.describe-native-index/" title="DESCRIBE INDEX" class="md-nav__link">
      DESCRIBE INDEX
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../14.index-statements/4.rebuild-native-index/" title="REBUILD INDEX" class="md-nav__link">
      REBUILD INDEX
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../14.index-statements/5.show-native-index-status/" title="SHOW INDEX STATUS" class="md-nav__link">
      SHOW INDEX STATUS
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../14.index-statements/6.drop-native-index/" title="DROP INDEX" class="md-nav__link">
      DROP INDEX
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../4.deployment-and-installation/6.deploy-text-based-index/1.text-based-index-restrictions/" title="Full-text restrictions" class="md-nav__link">
      Full-text restrictions
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../4.deployment-and-installation/6.deploy-text-based-index/2.deploy/" title="Deploy full-text index" class="md-nav__link">
      Deploy full-text index
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../14.index-statements/7.search-with-text-based-index/" title="Search with full-text index" class="md-nav__link">
      Search with full-text index
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-3-9" type="checkbox" id="nav-3-9">
    
    <label class="md-nav__link" for="nav-3-9">
      Subgraph and path
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="2">
      <label class="md-nav__title" for="nav-3-9">
        Subgraph and path
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../16.subgraph-and-path/1.get-subgraph/" title="GET SUBGRAPH" class="md-nav__link">
      GET SUBGRAPH
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-3-10" type="checkbox" id="nav-3-10">
    
    <label class="md-nav__link" for="nav-3-10">
      Query tuning statements
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="2">
      <label class="md-nav__title" for="nav-3-10">
        Query tuning statements
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../17.query-tuning-statements/1.explain-and-profile/" title="EXPLAIN and PROFILE" class="md-nav__link">
      EXPLAIN and PROFILE
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
      </ul>
    </nav>
  </li>

    
      
      
      


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-4" type="checkbox" id="nav-4">
    
    <label class="md-nav__link" for="nav-4">
      Deployment and installation
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="1">
      <label class="md-nav__title" for="nav-4">
        Deployment and installation
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../../4.deployment-and-installation/1.resource-preparations/" title="Resource preparations" class="md-nav__link">
      Resource preparations
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-4-2" type="checkbox" id="nav-4-2">
    
    <label class="md-nav__link" for="nav-4-2">
      Compile and install Nebula Graph
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="2">
      <label class="md-nav__title" for="nav-4-2">
        Compile and install Nebula Graph
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../../4.deployment-and-installation/2.compile-and-install-nebula-graph/1.install-nebula-graph-by-compiling-the-source-code/" title="Install Nebula Graph by compiling the source code" class="md-nav__link">
      Install Nebula Graph by compiling the source code
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
      </ul>
    </nav>
  </li>

    
      
      
      


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-5" type="checkbox" id="nav-5">
    
    <label class="md-nav__link" for="nav-5">
      Nebula Graph Studio
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="1">
      <label class="md-nav__title" for="nav-5">
        Nebula Graph Studio
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-5-1" type="checkbox" id="nav-5-1">
    
    <label class="md-nav__link" for="nav-5-1">
      About Nebula Graph Studio
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="2">
      <label class="md-nav__title" for="nav-5-1">
        About Nebula Graph Studio
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../../nebula-studio/about-studio/st-ug-what-is-graph-studio/" title="What is Nebula Graph Studio" class="md-nav__link">
      What is Nebula Graph Studio
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../nebula-studio/about-studio/st-ug-limitations/" title="Limitations" class="md-nav__link">
      Limitations
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../nebula-studio/about-studio/st-ug-check-updates/" title="Check updates" class="md-nav__link">
      Check updates
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-5-2" type="checkbox" id="nav-5-2">
    
    <label class="md-nav__link" for="nav-5-2">
      Deploy and connect
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="2">
      <label class="md-nav__title" for="nav-5-2">
        Deploy and connect
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../../nebula-studio/install-configure/st-ug-deploy/" title="Deploy Studio" class="md-nav__link">
      Deploy Studio
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../nebula-studio/install-configure/st-ug-connect/" title="Connect to Nebula Graph" class="md-nav__link">
      Connect to Nebula Graph
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-5-3" type="checkbox" id="nav-5-3">
    
    <label class="md-nav__link" for="nav-5-3">
      Operation guide
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="2">
      <label class="md-nav__title" for="nav-5-3">
        Operation guide
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-5-3-1" type="checkbox" id="nav-5-3-1">
    
    <label class="md-nav__link" for="nav-5-3-1">
      Use Console
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="3">
      <label class="md-nav__title" for="nav-5-3-1">
        Use Console
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../../nebula-studio/use-console/st-ug-open-in-explore/" title="Open in Explore" class="md-nav__link">
      Open in Explore
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
      </ul>
    </nav>
  </li>

        
      </ul>
    </nav>
  </li>

    
  </ul>
</nav>
                  </div>
                </div>
              </div>
            
            
              <div class="md-sidebar md-sidebar--secondary" data-md-component="toc">
                <div class="md-sidebar__scrollwrap">
                  <div class="md-sidebar__inner">
                    
<nav class="md-nav md-nav--secondary">
  
  
    
  
  
    <label class="md-nav__title" for="__toc">Table of contents</label>
    <ul class="md-nav__list" data-md-scrollfix>
      
        <li class="md-nav__item">
  <a href="#syntax" class="md-nav__link">
    Syntax
  </a>
  
</li>
      
        <li class="md-nav__item">
  <a href="#the_workflow_of_match" class="md-nav__link">
    The workflow of MATCH
  </a>
  
</li>
      
        <li class="md-nav__item">
  <a href="#use_patterns_in_match_statements" class="md-nav__link">
    Use patterns in MATCH statements
  </a>
  
    <nav class="md-nav">
      <ul class="md-nav__list">
        
          <li class="md-nav__item">
  <a href="#match_a_vertex" class="md-nav__link">
    Match a vertex
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#match_on_vertex_tag_and_property" class="md-nav__link">
    Match on vertex tag and property
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#match_on_vid" class="md-nav__link">
    Match on VID
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#match_connected_vertices" class="md-nav__link">
    Match connected vertices
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#match_paths" class="md-nav__link">
    Match paths
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#match_edges" class="md-nav__link">
    Match edges
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#match_on_edge_types_and_properties" class="md-nav__link">
    Match on edge types and properties
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#match_on_multiple_edge_types" class="md-nav__link">
    Match on multiple edge types
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#match_multiple_edges" class="md-nav__link">
    Match multiple edges
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#match_fixed-length_paths" class="md-nav__link">
    Match fixed-length paths
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#match_variable-length_paths" class="md-nav__link">
    Match variable-length paths
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#match_variable-length_paths_with_multiple_edge_types" class="md-nav__link">
    Match variable-length paths with multiple edge types
  </a>
  
</li>
        
      </ul>
    </nav>
  
</li>
      
        <li class="md-nav__item">
  <a href="#common_retrieves" class="md-nav__link">
    Common retrieves
  </a>
  
    <nav class="md-nav">
      <ul class="md-nav__list">
        
          <li class="md-nav__item">
  <a href="#retrieve_vertex_or_edge_information" class="md-nav__link">
    Retrieve vertex or edge information
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#retrieve_vids" class="md-nav__link">
    Retrieve VIDs
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#retrieve_tags" class="md-nav__link">
    Retrieve tags
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#retrieve_a_single_property_on_a_vertex_or_an_edge" class="md-nav__link">
    Retrieve a single property on a vertex or an edge
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#retrieve_all_properties_on_a_vertex_or_an_edge" class="md-nav__link">
    Retrieve all properties on a vertex or an edge
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#retrieve_edge_types" class="md-nav__link">
    Retrieve edge types
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#retrieve_paths" class="md-nav__link">
    Retrieve paths
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#retrieve_vertices_in_a_path" class="md-nav__link">
    Retrieve vertices in a path
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#retrieve_edges_in_a_path" class="md-nav__link">
    Retrieve edges in a path
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#retrieve_path_length" class="md-nav__link">
    Retrieve path length
  </a>
  
</li>
        
      </ul>
    </nav>
  
</li>
      
      
      
      
      
    </ul>
  
</nav>
                  </div>
                </div>
              </div>
            
          
          <div class="md-content">
            <article class="md-content__inner md-typeset">
              
                
                
                <h1 id="match">MATCH<a class="headerlink" href="#match" title="Permanent link">&para;</a></h1>
<p>The <code>MATCH</code> statement provides the searching ability based on pattern matching.</p>
<p>A <code>MATCH</code> statement defines a search pattern (doc TODO) and uses it to match data stored in the Nebula Graph database and to retrieve the data in the form defined in the <code>RETURN</code> clause. A <code>WHERE</code> clause (doc TODO) is often used together with the pattern as a filter to the search result.</p>
<p>The examples in this topic use the <code>nba</code> dataset as the sample dataset.</p>
<h2 id="syntax">Syntax<a class="headerlink" href="#syntax" title="Permanent link">&para;</a></h2>
<p>The syntax of <code>MATCH</code> is relatively more flexible compared with that of other query statements such as <code>GO</code> or <code>LOOKUP</code>. But generally, it can be summarized as follows.</p>
<div class="highlight"><pre><span></span><code>MATCH &lt;pattern&gt; [&lt;WHERE clause&gt;] RETURN &lt;output&gt;
</code></pre></div>
<h2 id="the_workflow_of_match">The workflow of MATCH<a class="headerlink" href="#the_workflow_of_match" title="Permanent link">&para;</a></h2>
<p>The <code>MATCH</code> statement relies on a <strong>native index</strong> to find a vertex as the origin of the search process. In other words, in a valid <code>MATCH</code> statement, <strong>there must be an indexed property or a specific VID.</strong> For how to index a property, see <a href="../../14.index-statements/1.create-native-index/">Create native index</a>.</p>
<blockquote>
<p><strong>NOTE:</strong> The native index for VID is created by default.</p>
</blockquote>
<p>Then, the <code>MATCH</code> statement searches through the pattern to match edges and other vertices.</p>
<p>At last, it retrieves data according to the <code>RETURN</code> clause.</p>
<blockquote>
<p><strong>OpenCypher compatibility</strong></p>
<p>For now, nGQL does not support the following operations:</p>
<ul>
<li>Scan all vertices and edges with <code>MATCH</code>. For example, <code>MATCH (v) RETURN v</code>.</li>
<li>Scan all vertices with one tag or all edges of one edge type with <code>MATCH</code>. For example, <code>MATCH (v:player) RETURN v</code>.</li>
</ul>
</blockquote>
<h2 id="use_patterns_in_match_statements">Use patterns in MATCH statements<a class="headerlink" href="#use_patterns_in_match_statements" title="Permanent link">&para;</a></h2>
<p>Make sure there is at least one index for the <code>MATCH</code> statement to use. If there are existing data, rebuild the index to make it takes effect on all data.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; CREATE TAG INDEX name ON player(name(20)); // Create an index on the name property.
Execution succeeded (time spent 2957/3986 us)

nebula&gt; REBUILD TAG INDEX name; // Rebuild the index.
+------------+
| New Job Id |
+------------+
| 121        |
+------------+
Got 1 rows  (time spent 2676/3990 us)

nebula&gt; SHOW JOB 121; // Make sure the rebuild job succeeded.
+----------------+---------------------+------------+------------+------------+
| Job Id(TaskId) | Command(Dest)       | Status     | Start Time | Stop Time  |
+----------------+---------------------+------------+------------+------------+
| 121            | &quot;REBUILD_TAG_INDEX&quot; | &quot;FINISHED&quot; | 1607073046 | 1607073046 |
+----------------+---------------------+------------+------------+------------+
| 0              | &quot;storaged2&quot;         | &quot;FINISHED&quot; | 1607073046 | 1607073046 |
+----------------+---------------------+------------+------------+------------+
| 1              | &quot;storaged0&quot;         | &quot;FINISHED&quot; | 1607073046 | 1607073046 |
+----------------+---------------------+------------+------------+------------+
| 2              | &quot;storaged1&quot;         | &quot;FINISHED&quot; | 1607073046 | 1607073046 |
+----------------+---------------------+------------+------------+------------+
Got 4 rows (time spent 1186/2998 us)
</code></pre></div>
<h3 id="match_a_vertex">Match a vertex<a class="headerlink" href="#match_a_vertex" title="Permanent link">&para;</a></h3>
<p>You can use a user-defined variable in a pair of parentheses to represent a vertex in a pattern. For example: <code>(v)</code>.</p>
<h3 id="match_on_vertex_tag_and_property">Match on vertex tag and property<a class="headerlink" href="#match_on_vertex_tag_and_property" title="Permanent link">&para;</a></h3>
<p>Tags are specified with <code>:&lt;tag_name&gt;</code> and tag properties are specified with <code>{&lt;prop_name&gt;: &lt;prop_value&gt;}</code> after the <code>:&lt;tag_name&gt;</code>.</p>
<p>The following example uses the name property to match a vertex.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;}) RETURN v;
+----------------------------------------------------+
| v                                                  |
+----------------------------------------------------+
| (&quot;player100&quot; :player{name: &quot;Tim Duncan&quot;, age: 42}) |
+----------------------------------------------------+
</code></pre></div>
<p>The <code>WHERE</code> clause can do the same thing:</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player) WHERE v.name == &quot;Tim Duncan&quot; RETURN v;
+----------------------------------------------------+
| v                                                  |
+----------------------------------------------------+
| (&quot;player100&quot; :player{name: &quot;Tim Duncan&quot;, age: 42}) |
+----------------------------------------------------+
</code></pre></div>
<blockquote>
<p><strong>OpenCypher compatibility</strong></p>
<ul>
<li>In nGQL, <code>==</code> is the equality operator and <code>=</code> is the assignment operator (as in C++ or Java).</li>
<li>In openCypher 9, <code>=</code> is the equality operator.</li>
</ul>
</blockquote>
<h3 id="match_on_vid">Match on VID<a class="headerlink" href="#match_on_vid" title="Permanent link">&para;</a></h3>
<p>You can use the VID to match a vertex. The <code>id()</code> function can retrieve the VID of a vertex.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v) WHERE id(v) == &#39;player101&#39; RETURN v;
+---------------------------------------------------+
| v                                                 |
+---------------------------------------------------+
| (player101) player.name:Tony Parker,player.age:36 |
+---------------------------------------------------+
Got 1 rows (time spent 1710/2406 us)
</code></pre></div>
<p>To match on multiple VIDS, use <code>WHERE id(v) IN [vid_list]</code>.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player { name: &#39;Tim Duncan&#39; })--(v2) \
        WHERE id(v2) IN [&quot;player101&quot;, &quot;player102&quot;] RETURN v2;
+-----------------------------------------------------------+
| v2                                                        |
+-----------------------------------------------------------+
| (&quot;player101&quot; :player{name: &quot;Tony Parker&quot;, age: 36})       |
+-----------------------------------------------------------+
| (&quot;player102&quot; :player{name: &quot;LaMarcus Aldridge&quot;, age: 33}) |
+-----------------------------------------------------------+
| (&quot;player101&quot; :player{name: &quot;Tony Parker&quot;, age: 36})       |
+-----------------------------------------------------------+
Got 3 rows (time spent 3107/3683 us)
</code></pre></div>
<blockquote>
<p><strong>OpenCypher compatibility</strong></p>
<p>For now, nGQL 2.0 only supports string-type VIDs.</p>
</blockquote>
<h3 id="match_connected_vertices">Match connected vertices<a class="headerlink" href="#match_connected_vertices" title="Permanent link">&para;</a></h3>
<p>You can use the <code>--</code> symbol to represent edges of both directions and match vertices connected by these edges.</p>
<blockquote>
<p><strong>nGQL compatibility</strong></p>
<ul>
<li>In nGQL 1.x, the <code>--</code> symbol is used for inline comments.</li>
<li>Starting from nGQL 2.0, the <code>--</code> symbol represents an incoming or outgoing edge.</li>
</ul>
</blockquote>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;})--(v2) RETURN v2.name AS Name;
+---------------------+
| Name                |
+---------------------+
| &quot;Tony Parker&quot;       |
+---------------------+
| &quot;LaMarcus Aldridge&quot; |
+---------------------+
| &quot;Marco Belinelli&quot;   |
+---------------------+
| &quot;Danny Green&quot;       |
+---------------------+
| &quot;Aron Baynes&quot;       |
+---------------------+
...
Got 13 rows (time spent 6029/8976 us)
</code></pre></div>
<p>And you can add a <code>&gt;</code> or <code>&lt;</code> symbol to specify the direction of the edge.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;})--&gt;(v2) RETURN v2.name AS Name;
+-----------------+
| Name            |
+-----------------+
| &quot;Spurs&quot;         |
+-----------------+
| &quot;Tony Parker&quot;   |
+-----------------+
| &quot;Manu Ginobili&quot; |
+-----------------+
Got 3 rows (time spent 2897/5993 us)
</code></pre></div>
<p>To extend the pattern, add more edges and vertices.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;})--&gt;(v2)&lt;--(v3) RETURN v3.name AS Name;
+---------------------+
| Name                |
+---------------------+
| &quot;Tony Parker&quot;       |
+---------------------+
| &quot;Tiago Splitter&quot;    |
+---------------------+
| &quot;Dejounte Murray&quot;   |
+---------------------+
| &quot;Tony Parker&quot;       |
+---------------------+
| &quot;LaMarcus Aldridge&quot; |
+---------------------+
...
</code></pre></div>
<p>If you don't need to refer to a vertex, you can omit the variable representing it in the parentheses.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;})--&gt;()&lt;--(v3) RETURN v3.name AS Name;
+---------------------+
| Name                |
+---------------------+
| &quot;Tony Parker&quot;       |
+---------------------+
| &quot;LaMarcus Aldridge&quot; |
+---------------------+
| &quot;Rudy Gay&quot;          |
+---------------------+
| &quot;Danny Green&quot;       |
+---------------------+
| &quot;Kyle Anderson&quot;     |
+---------------------+
...
</code></pre></div>
<h3 id="match_paths">Match paths<a class="headerlink" href="#match_paths" title="Permanent link">&para;</a></h3>
<p>Connected vertices and edges form a path. You can use a user-defined variable as follows to name a path.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:&quot;Tim Duncan&quot;})-[]-&gt;(v2) RETURN p;
+-----------------------------------------+
| p                                    |
+-----------------------------------------+
| (&quot;player100&quot;)-[:serve@0]-&gt;(&quot;player204&quot;) |
+-----------------------------------------+
| (&quot;player100&quot;)-[:like@0]-&gt;(&quot;player101&quot;)  |
+-----------------------------------------+
| (&quot;player100&quot;)-[:like@0]-&gt;(&quot;player125&quot;)  |
+-----------------------------------------+
Got 3 rows (time spent 3717/4573 us)
</code></pre></div>
<h3 id="match_edges">Match edges<a class="headerlink" href="#match_edges" title="Permanent link">&para;</a></h3>
<p>Besides using <code>--</code>, <code>--&gt;</code>, or <code>&lt;--</code> to indicate a nameless edge, you can use a variable in a pair of square brackets to represent a named edge. For example: <code>-[e]-&gt;</code>.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;})-[e]-(v2) RETURN e;
+---------------------------------------------------------------------------+
| e                                                                         |
+---------------------------------------------------------------------------+
| (&quot;player101&quot;)-[:like@0{likeness: 95}]-&gt;(&quot;player100&quot;)                      |
+---------------------------------------------------------------------------+
| (&quot;player102&quot;)-[:like@0{likeness: 75}]-&gt;(&quot;player100&quot;)                      |
+---------------------------------------------------------------------------+
| (&quot;player104&quot;)-[:like@0{likeness: 55}]-&gt;(&quot;player100&quot;)                      |
+---------------------------------------------------------------------------+
...
</code></pre></div>
<h3 id="match_on_edge_types_and_properties">Match on edge types and properties<a class="headerlink" href="#match_on_edge_types_and_properties" title="Permanent link">&para;</a></h3>
<p>Just like tags, edge types are specified with <code>:&lt;edge_type&gt;</code>. For example: <code>-[e:serve]-</code>.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;})-[e:serve]-(v2) RETURN e;
+---------------------------------------------------------------------------+
| e                                                                         |
+---------------------------------------------------------------------------+
| (&quot;player100&quot;)-[:serve@0{end_year: 2016, start_year: 1997}]-&gt;(&quot;player204&quot;) |
+---------------------------------------------------------------------------+
Got 1 rows (time spent 5041/5630 us)
</code></pre></div>
<p>And edge type properties are specified with <code>{&lt;prop_name&gt;: &lt;prop_value&gt;}</code> after the <code>:&lt;edge_type&gt;</code>. For example: <code>[e:like{likeness:95}]</code>.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;})-[e:like{likeness:95}]-&gt;(v2) RETURN e;
+------------------------------------------------------+
| e                                                    |
+------------------------------------------------------+
| (&quot;player100&quot;)-[:like@0{likeness: 95}]-&gt;(&quot;player101&quot;) |
+------------------------------------------------------+
| (&quot;player100&quot;)-[:like@0{likeness: 95}]-&gt;(&quot;player125&quot;) |
+------------------------------------------------------+
Got 2 rows (time spent 6080/6728 us)
</code></pre></div>
<h3 id="match_on_multiple_edge_types">Match on multiple edge types<a class="headerlink" href="#match_on_multiple_edge_types" title="Permanent link">&para;</a></h3>
<p>The <code>|</code> symbol can help matching on multiple edge types. For example: <code>[e:like|:serve]</code>.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;})-[e:like|:serve]-&gt;(v2) RETURN e;
+---------------------------------------------------------------------------+
| e                                                                         |
+---------------------------------------------------------------------------+
| (&quot;player100&quot;)-[:like@0{likeness: 95}]-&gt;(&quot;player101&quot;)                      |
+---------------------------------------------------------------------------+
| (&quot;player100&quot;)-[:like@0{likeness: 95}]-&gt;(&quot;player125&quot;)                      |
+---------------------------------------------------------------------------+
| (&quot;player100&quot;)-[:serve@0{end_year: 2016, start_year: 1997}]-&gt;(&quot;player204&quot;) |
+---------------------------------------------------------------------------+
Got 3 rows (time spent 4264/4976 us)
</code></pre></div>
<h3 id="match_multiple_edges">Match multiple edges<a class="headerlink" href="#match_multiple_edges" title="Permanent link">&para;</a></h3>
<p>You can expand a pattern to match multiple edges in a path.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;})-[]-&gt;(v2)&lt;-[e:serve]-(v3) RETURN v2, v3;
+------------------------------------+-----------------------------------------------------------+
| v2                                 | v3                                                        |
+------------------------------------+-----------------------------------------------------------+
| (&quot;player204&quot; :team{name: &quot;Spurs&quot;}) | (&quot;player101&quot; :player{name: &quot;Tony Parker&quot;, age: 36})       |
+------------------------------------+-----------------------------------------------------------+
| (&quot;player204&quot; :team{name: &quot;Spurs&quot;}) | (&quot;player102&quot; :player{name: &quot;LaMarcus Aldridge&quot;, age: 33}) |
+------------------------------------+-----------------------------------------------------------+
| (&quot;player204&quot; :team{name: &quot;Spurs&quot;}) | (&quot;player103&quot; :player{age: 32, name: &quot;Rudy Gay&quot;})          |
+------------------------------------+-----------------------------------------------------------+
...
</code></pre></div>
<h3 id="match_fixed-length_paths">Match fixed-length paths<a class="headerlink" href="#match_fixed-length_paths" title="Permanent link">&para;</a></h3>
<p>To match a fixed-length path, use the <code>:&lt;edge_type&gt;*&lt;hop&gt;</code> pattern.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:&quot;Tim Duncan&quot;})-[e:like*2]-&gt;(v2) RETURN DISTINCT v2 AS Friends;
+-----------------------------------------------------------+
| Friends                                                   |
+-----------------------------------------------------------+
| (&quot;player100&quot; :player{name: &quot;Tim Duncan&quot;, age: 42})        |
+-----------------------------------------------------------+
| (&quot;player102&quot; :player{name: &quot;LaMarcus Aldridge&quot;, age: 33}) |
+-----------------------------------------------------------+
| (&quot;player125&quot; :player{name: &quot;Manu Ginobili&quot;, age: 41})     |
+-----------------------------------------------------------+
Got 3 rows (time spent 4863/5591 us)
</code></pre></div>
<h3 id="match_variable-length_paths">Match variable-length paths<a class="headerlink" href="#match_variable-length_paths" title="Permanent link">&para;</a></h3>
<p>You can use the <code>:&lt;edge_type&gt;*[minHop]..&lt;maxHop&gt;</code> pattern to match variable-length paths.</p>
<table>
<thead>
<tr>
<th>Parameter</th>
<th>Description</th>
</tr>
</thead>
<tbody>
<tr>
<td><code>minHop</code></td>
<td>Optional. Represents the minimum length of the path. The default value is 1.</td>
</tr>
<tr>
<td><code>maxHop</code></td>
<td>Required. Represents the maximum length of the path.</td>
</tr>
</tbody>
</table>
<blockquote>
<p><strong>OpenCypher compatibility</strong></p>
<ul>
<li>In nGQL, <code>maxHop</code> is required. And <code>..</code> cannot be omitted.</li>
<li>In openCypher, <code>maxHop</code> is optional and default to infinity. When no bounds are given <code>..</code> can be omitted.</li>
</ul>
</blockquote>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:&quot;Tim Duncan&quot;})-[e:like*1..3]-&gt;(v2) \
        RETURN v2 AS Friends;
+-----------------------------------------------------------+
| Friends                                                   |
+-----------------------------------------------------------+
| (&quot;player101&quot; :player{age: 36, name: &quot;Tony Parker&quot;})       |
+-----------------------------------------------------------+
| (&quot;player125&quot; :player{name: &quot;Manu Ginobili&quot;, age: 41})     |
+-----------------------------------------------------------+
| (&quot;player100&quot; :player{name: &quot;Tim Duncan&quot;, age: 42})        |
+-----------------------------------------------------------+
| (&quot;player101&quot; :player{name: &quot;Tony Parker&quot;, age: 36})       |
+-----------------------------------------------------------+
| (&quot;player100&quot; :player{name: &quot;Tim Duncan&quot;, age: 42})        |
+-----------------------------------------------------------+
| (&quot;player100&quot; :player{name: &quot;Tim Duncan&quot;, age: 42})        |
+-----------------------------------------------------------+
| (&quot;player102&quot; :player{name: &quot;LaMarcus Aldridge&quot;, age: 33}) |
+-----------------------------------------------------------+
| (&quot;player125&quot; :player{name: &quot;Manu Ginobili&quot;, age: 41})     |
+-----------------------------------------------------------+
| (&quot;player100&quot; :player{name: &quot;Tim Duncan&quot;, age: 42})        |
+-----------------------------------------------------------+
| (&quot;player101&quot; :player{name: &quot;Tony Parker&quot;, age: 36})       |
+-----------------------------------------------------------+
| (&quot;player125&quot; :player{name: &quot;Manu Ginobili&quot;, age: 41})     |
+-----------------------------------------------------------+
Got 11 rows (time spent 5426/6473 us)
</code></pre></div>
<p>You can use the <code>DISTINCT</code> keyword to remove duplicated results.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:&quot;Tim Duncan&quot;})-[e:like*1..3]-&gt;(v2) \
        RETURN DISTINCT v2 AS Friends;
+-----------------------------------------------------------+
| Friends                                                   |
+-----------------------------------------------------------+
| (&quot;player101&quot; :player{name: &quot;Tony Parker&quot;, age: 36})       |
+-----------------------------------------------------------+
| (&quot;player125&quot; :player{name: &quot;Manu Ginobili&quot;, age: 41})     |
+-----------------------------------------------------------+
| (&quot;player100&quot; :player{name: &quot;Tim Duncan&quot;, age: 42})        |
+-----------------------------------------------------------+
| (&quot;player102&quot; :player{name: &quot;LaMarcus Aldridge&quot;, age: 33}) |
+-----------------------------------------------------------+
Got 4 rows (time spent 4549/5162 us)
</code></pre></div>
<h3 id="match_variable-length_paths_with_multiple_edge_types">Match variable-length paths with multiple edge types<a class="headerlink" href="#match_variable-length_paths_with_multiple_edge_types" title="Permanent link">&para;</a></h3>
<p>You can specify multiple edge types in a fixed-length or variable-length pattern. In this case, <code>hop</code>, <code>maxHop</code>, and <code>maxHop</code> takes effect on all edge types.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:&quot;Tim Duncan&quot;})-[e:like|serve*2]-&gt;(v2) \
        RETURN DISTINCT v2;
+-----------------------------------------------------------+
| v2                                                        |
+-----------------------------------------------------------+
| (&quot;player100&quot; :player{name: &quot;Tim Duncan&quot;, age: 42})        |
+-----------------------------------------------------------+
| (&quot;player102&quot; :player{name: &quot;LaMarcus Aldridge&quot;, age: 33}) |
+-----------------------------------------------------------+
| (&quot;player125&quot; :player{name: &quot;Manu Ginobili&quot;, age: 41})     |
+-----------------------------------------------------------+
| (&quot;player204&quot; :team{name: &quot;Spurs&quot;})                        |
+-----------------------------------------------------------+
| (&quot;player215&quot; :team{name: &quot;Hornets&quot;})                      |
+-----------------------------------------------------------+
Got 5 rows (time spent 3834/4571 us)
</code></pre></div>
<h2 id="common_retrieves">Common retrieves<a class="headerlink" href="#common_retrieves" title="Permanent link">&para;</a></h2>
<p>This section shows how to retrieve commonly used items with <code>MATCH</code> statements.</p>
<h3 id="retrieve_vertex_or_edge_information">Retrieve vertex or edge information<a class="headerlink" href="#retrieve_vertex_or_edge_information" title="Permanent link">&para;</a></h3>
<p>Use <code>RETURN {&lt;vertex_name&gt; | &lt;edge_name&gt;}</code> to retrieve all the information of a vertex or an edge.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;}) RETURN v;
+----------------------------------------------------+
| v                                                  |
+----------------------------------------------------+
| (&quot;player100&quot; :player{name: &quot;Tim Duncan&quot;, age: 42}) |
+----------------------------------------------------+
Got 1 rows (time spent 1863/2545 us)
</code></pre></div>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;})-[e]-&gt;(v2) RETURN e;
+---------------------------------------------------------------------------+
| e                                                                         |
+---------------------------------------------------------------------------+
| (&quot;player100&quot;)-[:serve@0{start_year: 1997, end_year: 2016}]-&gt;(&quot;player204&quot;) |
+---------------------------------------------------------------------------+
| (&quot;player100&quot;)-[:like@0{likeness: 95}]-&gt;(&quot;player101&quot;)                      |
+---------------------------------------------------------------------------+
| (&quot;player100&quot;)-[:like@0{likeness: 95}]-&gt;(&quot;player125&quot;)                      |
+---------------------------------------------------------------------------+
Got 3 rows (time spent 3139/3773 us)
</code></pre></div>
<h3 id="retrieve_vids">Retrieve VIDs<a class="headerlink" href="#retrieve_vids" title="Permanent link">&para;</a></h3>
<p>Use the <code>id()</code> function to retrieve VIDs.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;}) RETURN id(v);
+-------------+
| id(v)       |
+-------------+
| &quot;player100&quot; |
+-------------+
Got 1 rows (time spent 2070/2747 us)
</code></pre></div>
<h3 id="retrieve_tags">Retrieve tags<a class="headerlink" href="#retrieve_tags" title="Permanent link">&para;</a></h3>
<p>Use the <code>labels()</code> function to retrieve the list of tags on a vertex.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;}) RETURN labels(v);
+------------+
| labels(v)  |
+------------+
| [&quot;player&quot;] |
+------------+
Got 1 rows (time spent 2198/2941 us)
</code></pre></div>
<p>The following example shows how to retrieve the first tag in the list.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;}) RETURN labels(v)[0];
+--------------+
| labels(v)[0] |
+--------------+
| &quot;player&quot;     |
+--------------+
Got 1 rows (time spent 2609/3481 us)
</code></pre></div>
<h3 id="retrieve_a_single_property_on_a_vertex_or_an_edge">Retrieve a single property on a vertex or an edge<a class="headerlink" href="#retrieve_a_single_property_on_a_vertex_or_an_edge" title="Permanent link">&para;</a></h3>
<p>Use <code>RETURN {&lt;vertex_name&gt; | &lt;edge_name&gt;}.&lt;property&gt;</code> to retrieve a single property.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;}) RETURN v.age AS Age;
+-------+
| v.age |
+-------+
| 42    |
+-------+
Got 1 rows (time spent 2261/2973 us)
</code></pre></div>
<p>Use <code>AS</code> to specify an alias for a property.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;}) RETURN v.age AS Age;
+-----+
| Age |
+-----+
| 42  |
+-----+
Got 1 rows (time spent 1762/2321 us)
</code></pre></div>
<h3 id="retrieve_all_properties_on_a_vertex_or_an_edge">Retrieve all properties on a vertex or an edge<a class="headerlink" href="#retrieve_all_properties_on_a_vertex_or_an_edge" title="Permanent link">&para;</a></h3>
<p>Use the <code>properties()</code> function to retrieve all properties on a vertex or an edge.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:&quot;Tim Duncan&quot;})-[]-&gt;(v2) RETURN properties(v2);
+------------------------------------+
| properties(v2)                     |
+------------------------------------+
| {&quot;name&quot;:&quot;Spurs&quot;}                   |
+------------------------------------+
| {&quot;name&quot;:&quot;Tony Parker&quot;, &quot;age&quot;:36}   |
+------------------------------------+
| {&quot;age&quot;:41, &quot;name&quot;:&quot;Manu Ginobili&quot;} |
+------------------------------------+
Got 3 rows (time spent 2943/3541 us)
</code></pre></div>
<h3 id="retrieve_edge_types">Retrieve edge types<a class="headerlink" href="#retrieve_edge_types" title="Permanent link">&para;</a></h3>
<p>Use the <code>type()</code> function to retrieve the types of the matched edges.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:&quot;Tim Duncan&quot;})-[e]-&gt;() RETURN type(e);
+---------+
| type(e) |
+---------+
| &quot;serve&quot; |
+---------+
| &quot;like&quot;  |
+---------+
| &quot;like&quot;  |
+---------+
Got 3 rows (time spent 3776/4660 us)
</code></pre></div>
<h3 id="retrieve_paths">Retrieve paths<a class="headerlink" href="#retrieve_paths" title="Permanent link">&para;</a></h3>
<p>Use <code>RETURN &lt;path_name&gt;</code> to retrieve all the information of a vertex or an edge.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:&quot;Tim Duncan&quot;})-[*3]-&gt;() RETURN p LIMIT 3;
+-------------------------------------------------------------------------------------------+
| p                                                                                         |
+-------------------------------------------------------------------------------------------+
| (&quot;player100&quot;)-[:like@0]-&gt;(&quot;player101&quot;)-[:like@0]-&gt;(&quot;player100&quot;)-[:serve@0]-&gt;(&quot;player204&quot;) |
+-------------------------------------------------------------------------------------------+
| (&quot;player100&quot;)-[:like@0]-&gt;(&quot;player125&quot;)-[:like@0]-&gt;(&quot;player100&quot;)-[:serve@0]-&gt;(&quot;player204&quot;) |
+-------------------------------------------------------------------------------------------+
| (&quot;player100&quot;)-[:like@0]-&gt;(&quot;player125&quot;)-[:like@0]-&gt;(&quot;player100&quot;)-[:like@0]-&gt;(&quot;player101&quot;)  |
+-------------------------------------------------------------------------------------------+
Got 3 rows (time spent 4592/5278 us)
</code></pre></div>
<h3 id="retrieve_vertices_in_a_path">Retrieve vertices in a path<a class="headerlink" href="#retrieve_vertices_in_a_path" title="Permanent link">&para;</a></h3>
<p>Use the <code>nodes()</code> function to retrieve all vertices in a path.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:&quot;Tim Duncan&quot;})-[]-&gt;(v2) RETURN nodes(p);
+---------------------------------------------------------------------------------------------------------------------+
| nodes(p)                                                                                                            |
+---------------------------------------------------------------------------------------------------------------------+
| [(&quot;player100&quot; :star{} :player{age: 42, name: &quot;Tim Duncan&quot;}), (&quot;player204&quot; :team{name: &quot;Spurs&quot;})]                    |
+---------------------------------------------------------------------------------------------------------------------+
| [(&quot;player100&quot; :star{} :player{age: 42, name: &quot;Tim Duncan&quot;}), (&quot;player101&quot; :player{name: &quot;Tony Parker&quot;, age: 36})]   |
+---------------------------------------------------------------------------------------------------------------------+
| [(&quot;player100&quot; :star{} :player{age: 42, name: &quot;Tim Duncan&quot;}), (&quot;player125&quot; :player{name: &quot;Manu Ginobili&quot;, age: 41})] |
+---------------------------------------------------------------------------------------------------------------------+
Got 3 rows (time spent 2529/3128 us)
</code></pre></div>
<h3 id="retrieve_edges_in_a_path">Retrieve edges in a path<a class="headerlink" href="#retrieve_edges_in_a_path" title="Permanent link">&para;</a></h3>
<p>Use the <code>relationships()</code> function to retrieve all edges in a path.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:&quot;Tim Duncan&quot;})-[]-&gt;(v2) RETURN relationships(p);
+-----------------------------------------------------------------------------+
| relationships(p)                                                            |
+-----------------------------------------------------------------------------+
| [(&quot;player100&quot;)-[:serve@0{end_year: 2016, start_year: 1997}]-&gt;(&quot;player204&quot;)] |
+-----------------------------------------------------------------------------+
| [(&quot;player100&quot;)-[:like@0{likeness: 95}]-&gt;(&quot;player101&quot;)]                      |
+-----------------------------------------------------------------------------+
| [(&quot;player100&quot;)-[:like@0{likeness: 95}]-&gt;(&quot;player125&quot;)]                      |
+-----------------------------------------------------------------------------+
Got 3 rows (time spent 2715/3363 us)
</code></pre></div>
<h3 id="retrieve_path_length">Retrieve path length<a class="headerlink" href="#retrieve_path_length" title="Permanent link">&para;</a></h3>
<p>Use the <code>length()</code> function to retrieve the length of a path.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:&quot;Tim Duncan&quot;})-[*..2]-&gt;(v2) \
        RETURN v2.name AS Name, length(p) AS Length;
+---------------------+--------+
| Name                | Length |
+---------------------+--------+
| &quot;Spurs&quot;             | 2      |
+---------------------+--------+
| &quot;Hornets&quot;           | 2      |
+---------------------+--------+
| &quot;Tim Duncan&quot;        | 2      |
+---------------------+--------+
| &quot;LaMarcus Aldridge&quot; | 2      |
+---------------------+--------+
| &quot;Manu Ginobili&quot;     | 2      |
+---------------------+--------+
| &quot;Spurs&quot;             | 2      |
+---------------------+--------+
| &quot;Tim Duncan&quot;        | 2      |
+---------------------+--------+
| &quot;Spurs&quot;             | 1      |
+---------------------+--------+
| &quot;Tony Parker&quot;       | 1      |
+---------------------+--------+
| &quot;Manu Ginobili&quot;     | 1      |
+---------------------+--------+
Got 10 rows (time spent 3774/4516 us)
</code></pre></div>
                
                  
                
                
              
              
                


              
            </article>
          </div>
        </div>
      </main>
      
        
<footer class="md-footer">
  
    <div class="md-footer-nav">
      <nav class="md-footer-nav__inner md-grid">
        
          <a href="../../6.functions-and-expressions/5.case-expressions/" title="Case expressions" class="md-flex md-footer-nav__link md-footer-nav__link--prev" rel="prev">
            <div class="md-flex__cell md-flex__cell--shrink">
              <i class="md-icon md-icon--arrow-back md-footer-nav__button"></i>
            </div>
            <div class="md-flex__cell md-flex__cell--stretch md-footer-nav__title">
              <span class="md-flex__ellipsis">
                <span class="md-footer-nav__direction">
                  Previous
                </span>
                Case expressions
              </span>
            </div>
          </a>
        
        
          <a href="../5.lookup/" title="LOOKUP" class="md-flex md-footer-nav__link md-footer-nav__link--next" rel="next">
            <div class="md-flex__cell md-flex__cell--stretch md-footer-nav__title">
              <span class="md-flex__ellipsis">
                <span class="md-footer-nav__direction">
                  Next
                </span>
                LOOKUP
              </span>
            </div>
            <div class="md-flex__cell md-flex__cell--shrink">
              <i class="md-icon md-icon--arrow-forward md-footer-nav__button"></i>
            </div>
          </a>
        
      </nav>
    </div>
  
  <div class="md-footer-meta md-typeset">
    <div class="md-footer-meta__inner md-grid">
      <div class="md-footer-copyright">
        
          <div class="md-footer-copyright__highlight">
            Copyright &copy; 2020 Nebula Graph
          </div>
        
        powered by
        <a href="https://www.mkdocs.org" target="_blank" rel="noopener">MkDocs</a>
        and
        <a href="https://squidfunk.github.io/mkdocs-material/" target="_blank" rel="noopener">
          Material for MkDocs</a>
      </div>
      
  <div class="md-footer-social">
    <link rel="stylesheet" href="../../../assets/fonts/font-awesome.css">
    
      <a href="https://github.com/vesoft-inc/nebula" target="_blank" rel="noopener" title="github" class="md-footer-social__link fa fa-github"></a>
    
      <a href="https://www.weibo.com/u/7122684542?is_hot=1" target="_blank" rel="noopener" title="weibo" class="md-footer-social__link fa fa-weibo"></a>
    
      <a href="https://twitter.com/NebulaGraph" target="_blank" rel="noopener" title="twitter" class="md-footer-social__link fa fa-twitter"></a>
    
      <a href="https://www.linkedin.com/company/vesoft-nebula-graph/" target="_blank" rel="noopener" title="linkedin" class="md-footer-social__link fa fa-linkedin"></a>
    
      <a href="https://www.facebook.com/NebulaGraph/" target="_blank" rel="noopener" title="facebook" class="md-footer-social__link fa fa-facebook"></a>
    
      <a href="https://app.slack.com/client/TJB3N2BPD/CJNFUM7AR" target="_blank" rel="noopener" title="slack" class="md-footer-social__link fa fa-slack"></a>
    
  </div>

    </div>
  </div>
</footer>
      
    </div>
    
      <script src="../../../assets/javascripts/application.c33a9706.js"></script>
      
      <script>app.initialize({version:"1.1",url:{base:"../../.."}})</script>
      
        <script src="../../../js/version-select.js"></script>
      
    
  </body>
</html>