# Composite queries

Composite queries put data from different queries together. They then use filters, group bys, or sorting before returning the combined return results. A composite query retrieves multiple levels of related information on existing queries and presents data as a single return result.

Nebula Graph supports two ways to compose queries (or sub-queries):

- More than one queries can be batched together, separated by semicolon (;). The result of the last query is returned as the result of the batch.
- Queries can be piped together by using the pipe operator `|`. The result of the previous query can be used as the input of the next query.

> **NOTE:** Composition queries are not `Transactional` queries.

For example, a query composed of three sub-queries: A | B | C, In that A is a read operation, B is a computation operation, and C is a write operation. If any part fails in the execution, the whole result can be undefined. Currently, there is no roll back. What is written depends on the query executor.

## Examples

- Semicolon queries

```ngql
nebula> SHOW TAGS; SHOW EDGES;   // Only edges are shown.

nebula> INSERT VERTEX player(name, age) VALUES "player100":("Tim Duncan", 42); \
INSERT VERTEX player(name, age) VALUES "player101":("Tony Parker", 36); \
INSERT VERTEX player(name, age) VALUES "player102":("LaMarcus Aldridge", 33);  // Multiple vertices are inserted in a compose statement.
```

- Pipe queries

```ngql
nebula> GO FROM "player100" OVER follow YIELD follow._dst AS id | \
    GO FROM $-.id OVER serve YIELD $$.team.name AS Team, \
    $^.player.name AS Player;
    +---------+-------------+
    | Team    | Player      |
    +---------+-------------+
    | Nuggets | Tony Parker |
    +---------+-------------+
```

> **NOTE:** Placeholder `$-.id` is not supported in Nebula Graph 2.0 or later versions.
