# INSERT EDGE

```ngql
INSERT EDGE <edge_type> ( <prop_name_list> ) {VALUES | VALUE}
<src_vid> -> <dst_vid>[@<rank>] : ( <prop_value_list> )
[, <src_vid> -> <dst_vid> : ( <prop_value_list> ), ...]

<prop_name_list> ::=
  [ <prop_name> [, <prop_name> ] ...]

<prop_value_list> ::=
  [ <prop_value> [, <prop_value> ] ...]
```

The `INSERT EDGE` statement inserts a (directed) edge from a source vertex (given by src_vid) to a destination vertex (given by dst_vid).

* `<edge_type>` denotes the edge type, which must be created before `INSERT EDGE`.
* `<prop_name_list>` is the property name list in the given `<edge_name>`.
* `<prop_value_list>` must provide the value list according to `<prop_name_list>`. If the property values do not match the data type in the edge type, an error is returned. When the `NOT NULL` constraint is set for a given property, an error is returned if no property is given. When the default value for a property is `NULL`, you can omit to specify the property value. (TODO: create edge doc)
* `rank` is optional, it specifies the edge rank of the same edge type. If not specified, the default value is 0.

## Examples

```ngql
nebula> CREATE EDGE e1();                    -- create edge type t1 with empty property
nebula> INSERT EDGE e1 () VALUES "10"->"11":();    -- insert an edge from vertex "10" to vertex "11" with empty property
nebula> INSERT EDGE e1 () VALUES "10"->"11"@1:();  -- insert an edge from vertex "10" to vertex "11" with empty property, the edge rank is 1
```

```ngql
nebula> CREATE EDGE e2 (name string, age int);                     -- create edge type e2 with two properties
nebula> INSERT EDGE e2 (name, age) VALUES "11"->"13":("n1", 1);          -- insert edge from "11" to "13" with two properties
nebula> INSERT EDGE e2 (name, age) VALUES \
"12"->"13":("n1", 1), "13"->"14":("n2", 2);                           -- insert two edges
nebula> INSERT EDGE e2 (name, age) VALUES "11"->"13":("n1", "a13");      -- ERROR. "a13" is not int
```

An edge can be inserted/wrote multiple times. Only the last written values can be read.

```ngql
-- insert edge with the new values.
nebula> INSERT EDGE e2 (name, age) VALUES "11"->"13":("n1", 12);
nebula> INSERT EDGE e2 (name, age) VALUES "11"->"13":("n1", 13);
nebula> INSERT EDGE e2 (name, age) VALUES "11"->"13":("n1", 14);
nebula> FETCH PROP ON e2 "11"->"13";
+---------+---------+----------+---------+--------+
| e2._src | e2._dst | e2._rank | e2.name | e2.age |
+---------+---------+----------+---------+--------+
| "11"    | "13"    | 0        | "n1"    | 14     |
+---------+---------+----------+---------+--------+      -- Only the last version can be read
```
