# Elasticsearch query functions

The Elasticsearch query functions allow NebulaGraph to send a GET request to Elasticsearch to read the data and convert the returned JSON into a Map format in NebulaGraph. Users can use the map data in the same composite graph query statement.

For more Information about Elasticsearch syntax, see [Elasticsearch official document](https://www.elastic.co/guide/en/elasticsearch/reference/current/search-your-data.html).

!!! enterpriseonly

    Only available for the NebulaGraph Enterprise Edition.

## Precautions

- You can not use the Elasticsearch service that a full-text index has been deployed. You need to use the independent Elasticsearch service and write data to the Elasticsearch service by yourself. NebulaGraph will not write data to the Elasticsearch. To deploy an Elasticsearch cluster, see [Kubernetes Elasticsearch deployment](https://www.elastic.co/guide/en/cloud-on-k8s/current/k8s-deploy-elasticsearch.html) or [Elasticsearch installation](https://www.elastic.co/guide/en/elasticsearch/reference/7.15/targz.html).

- `SIGN IN` is required before use the Elasticsearch query functions, for example, `SIGN IN TEXT SERVICE (127.0.0.1:9200, HTTP)`. You can `SIGN OUT` the service when it is no longer needed. For more Information, see  [Sign in to the text search clients](../../4.deployment-and-installation/6.deploy-text-based-index/2.deploy-es.md#_sign_in_to_the_text_search_clients).

- The Elasticsearch query functions support only GET requests. Perform the POST, PUT, and DELETE requests should be called by the Elasticsearch client.

- The Elasticsearch query functions have no timeout, NebulaGraph will wait for Elasticsearch to return results.

- Using operator directly after the Elasticsearch query functions is not supported. For example, `RETURN calles("/test/player/1")["_source"]` is not allowed.

- Compatible with Elasticsearch 7 and later, not tested for earlier versions.

## OpenCypher-compatible

This topic applies to the openCypher syntax in nGQL only.

## Syntax

Users can use calles() to execute am Elasticsearch query, and also use callesfile() to execute am Elasticsearch query in a specified file.

```ngql
calles("<es_query>");
callesfile("<es_query_file_path>");
```

- Result type: Map. Elasticsearch returns a string in JSON format, which NebulaGraph converts to map format.

## Example

```ngql
nebula> RETURN calles("/test/player/1") AS a;
+---------------------------------------------------------------------------------------------------------------------------------------------+
| a                                                                                                                                           |
+---------------------------------------------------------------------------------------------------------------------------------------------+
| {_id: "1", _index: "test", _primary_term: 1, _seq_no: 0, _source: {age: 43, name: "Tim Duncan"}, _type: "player", _version: 1, found: true} |
+---------------------------------------------------------------------------------------------------------------------------------------------+

nebula> WITH calles("/test/player/1") AS a RETURN a;
+---------------------------------------------------------------------------------------------------------------------------------------------+
| a                                                                                                                                           |
+---------------------------------------------------------------------------------------------------------------------------------------------+
| {_id: "1", _index: "test", _primary_term: 1, _seq_no: 0, _source: {age: 43, name: "Tim Duncan"}, _type: "player", _version: 1, found: true} |
+---------------------------------------------------------------------------------------------------------------------------------------------+

nebula> WITH calles("/test/player/1") AS a \
        MATCH (b:player) WHERE b.player.age == a["_source"]["age"] \
        RETURN b;
+---------------------------------------------------+
| b                                                 |
+---------------------------------------------------+
| ("player141" :player{age: 43, name: "Ray Allen"}) |
+---------------------------------------------------+

//For non-existent data, the found field returns false.
nebula> WITH calles("/test/player/123") AS a RETURN a;
+-------------------------------------------------------------+
| a                                                           |
+-------------------------------------------------------------+
| {_id: "123", _index: "test", _type: "player", found: false} |
+-------------------------------------------------------------+

//For non-existent file, NebulaGraph returns an error。
nebula> RETURN callesfile('/home/xxx/es_query_test.txt');
+---------------------------------------------+
| callESFile( "/home/xxx/es_query_test.txt" ) |
+---------------------------------------------+
| {error: "read Elaticsearch file fail."}     |
+---------------------------------------------+

nebula> RETURN callesfile('/home/xxx/es_query.txt');
+--------------------------------------------------------------------------------------------------------------------------------------------------------------+
| callESFile( "/home/xxx/es_query.txt"    )                                                                                                                    |
+--------------------------------------------------------------------------------------------------------------------------------------------------------------+
| {_shards: {failed: 0, skipped: 0, successful: 1, total: 1}, hits: {hits: [{_id: "2", _index: "test", _score: 1.0, _source: {age: 36, name: "Tony Parker"}... |
+--------------------------------------------------------------------------------------------------------------------------------------------------------------+


nebula> WITH callesfile('/home/xxx/es_query.txt') AS s RETURN [n in s["hits"]["hits"]|n.`_source`.name];
+--------------------------------------------------------------------------------------------------------------------------------------+
| [n IN s["hits"]["hits"] | n._source.name]                                                                                            |
+--------------------------------------------------------------------------------------------------------------------------------------+
| ["LeBron James", "Danny Green", "Kevin Durant", "Stephen Curry", "Rudy Gay", "Ray Allen", "Tim Duncan", "Tony Parker", "Chris Paul"] |
+--------------------------------------------------------------------------------------------------------------------------------------+

nebula> WITH callesfile('/home/xxx/es_query.txt') AS s \
        MATCH p= (a:player)-[:serve]->() \
        WHERE id(a) in [n in s["hits"]["hits"]|n.`_source`.name] RETURN p;
+---------------------------------------------------------------------------------------------------------------------------------------------------+
| p                                                                                                                                                 |
+---------------------------------------------------------------------------------------------------------------------------------------------------+
| <("LeBron James" :player{age: 34, name: "LeBron James"})-[:serve@1 {end_year: 2018, start_year: 2014}]->("Cavaliers" :team{name: "Cavaliers"})>   |
| <("LeBron James" :player{age: 34, name: "LeBron James"})-[:serve@0 {end_year: 2010, start_year: 2003}]->("Cavaliers" :team{name: "Cavaliers"})>   |
...
```
