# count()

The `count()` function calculates the number of the specified values or rows.

## Group and count the number of values

You can use `count(*)` and `GROUP BY` together to group and count the number of specific values.

### Example 1

```nGQL
nebula> GO FROM "player101" OVER follow BIDIRECT YIELD $$.player.name as Name | \
        GROUP BY $-.Name YIELD $-.Name, count(*);
+---------------------+----------+
| $-.Name             | COUNT(*) |
+---------------------+----------+
| "Dejounte Murray"   | 1        |
+---------------------+----------+
| "LaMarcus Aldridge" | 2        |
+---------------------+----------+
| "Tim Duncan"        | 2        |
+---------------------+----------+
| "Marco Belinelli"   | 1        |
+---------------------+----------+
| "Manu Ginobili"     | 1        |
+---------------------+----------+
| "Boris Diaw"        | 1        |
+---------------------+----------+
Got 6 rows (time spent 4056/4684 us)
```

The statement in the preceding example searches for:

* People whom `player101` follows.
* People who follow `player101`.

And retrieves two columns:

* `$-.Name`, the names of the people.
* `COUNT(*)`, how many times the names show up.

Because there are no duplicate names in the `nba` dataset, the number `2` in the result shows that the person in that row and `player101` have followed each other.

### Example 2

```nGQL
nebula> MATCH (v:player) RETURN v.name as Name, v.age as Age | \
        GROUP BY $-.Age YIELD $-.Age, count(*);
+--------+----------+
| $-.Age | COUNT(*) |
+--------+----------+
| 47     | 1        |
+--------+----------+
| 43     | 1        |
+--------+----------+
| 37     | 1        |
+--------+----------+
| 32     | 3        |
+--------+----------+
| 29     | 4        |
+--------+----------+
| 42     | 2        |
+--------+----------+
| 28     | 3        |
+--------+----------+
| 33     | 4        |
+--------+----------+
| 25     | 2        |
+--------+----------+
| 36     | 3        |
+--------+----------+
| 24     | 1        |
+--------+----------+
| 34     | 4        |
+--------+----------+
| 45     | 2        |
+--------+----------+
| 22     | 1        |
+--------+----------+
| 40     | 2        |
+--------+----------+
| 38     | 3        |
+--------+----------+
| 20     | 1        |
+--------+----------+
| 39     | 1        |
+--------+----------+
| 41     | 1        |
+--------+----------+
| 30     | 4        |
+--------+----------+
| 31     | 3        |
+--------+----------+
| 23     | 1        |
+--------+----------+
| 46     | 1        |
+--------+----------+
| 27     | 1        |
+--------+----------+
| 26     | 1        |
+--------+----------+
Got 25 rows (time spent 5613/6386 us)
```

The statement in the preceding example retrieves the age distribution of the players in the dataset.

## Count the rows in the result

You can use `count(*)` in a `YIELD` clause behind a pipe symbol to count the number of rows that the statement before the pipe symbol returns.

```nGQL
nebula> MATCH (v:player{name:"Tim Duncan"}) -- (v2) \
        RETURN DISTINCT v2 | YIELD count(*);
+----------+
| COUNT(*) |
+----------+
| 11       |
+----------+
Got 1 rows (time spent 4935/5482 us)
```

## count(null)

Counting NULL returns 0.

```nGQL
nebula> YIELD count(null);
+-----------------+
| COUNT(__NULL__) |
+-----------------+
| 0               |
+-----------------+
Got 1 rows (time spent 202/691 us)
```