# Pipe operator

## OpenCypher compatibility

This page applies to nGQL extensions only.

## Syntax

One major difference between nGQL and SQL is how sub-queries are composed.

In SQL, to form a statement, sub-queries are nested (embedded).
In nGQL the shell style `PIPE (|)` is introduced.

## Examples

```ngql
nebula> GO FROM "player100" OVER follow \
YIELD follow._dst AS dstid, $$.player.name AS Name |\
GO FROM $-.dstid OVER follow;

+-------------+
| follow._dst |
+-------------+
| "player101" |
+-------------+
```

If no `YIELD` is used, the destination vertex ID is returned by default.

If `YIELD` is declared explicitly, (the default value) `id` are not returned.

To use pipe, always define alias names in the `YIELD` statement for the placeholder `$-.`. For example, the alias names are `dstid` and `Name` here.
