# Reference operators

NGQL provides reference operators to represent a property in a `WHERE` or `YIELD` clause, or the output of the statement before the pipe operator in a composite query.

## OpenCypher compatibility

Reference operators apply to native nGQL only.

## Reference operator List

| Reference operator | Description                                                                                                                                           |
|--------------------+-------------------------------------------------------------------------------------------------------------------------------------------------------|
| `$^`               | Refers to a source vertex property. For more information, see [Property reference](../4.variable-and-composite-queries/3.property-reference.md).      |
| `$$`               | Refers to a destination vertex property. For more information, see [Property reference](../4.variable-and-composite-queries/3.property-reference.md). |
| `$-`               | Refers to the output of the statement before the pipe operator in a composite query. For more information, see [Pipe](4.pipe.md).                     |

## Examples

```ngql
# The following example returns the age of the source vertex and the destination vertex.
nebula> GO FROM "player100" OVER follow YIELD properties($^).age AS SrcAge, properties($$).age AS DestAge;
+--------+---------+
| SrcAge | DestAge |
+--------+---------+
| 42     | 36      |
| 42     | 41      |
+--------+---------+

# The following example returns the name and team of the players that player100 follows.
nebula> GO FROM "player100" OVER follow \
        YIELD dst(edge) AS id | \
        GO FROM $-.id OVER serve \
        YIELD $^.player.name AS Player, properties($$).name AS Team;
+-----------------+-----------+
| Player          | Team      |
+-----------------+-----------+
| "Tony Parker"   | "Spurs"   |
| "Tony Parker"   | "Hornets" |
| "Manu Ginobili" | "Spurs"   |
+-----------------+-----------+
```
