# Property reference operator

## OpenCypher compatibility

This page applies to nGQL extensions only.

## Syntax

You can refer properties in `WHERE` or `YIELD` syntax.

## Reference from vertex

### For source vertex

```ngql
$^.<tag_name>.<prop_name>
```

The symbol `$^` is used to get the property of the source vertex, `<tag_name>` indicates the `tag`of the source vertex, and `<prop_name>` specifies the property name.

### For destination vertex

```ngql
$$.<tag_name>.<prop_name>
```

The symbol `$$` indicates the destination vertex, `<tag_name>` and `<prop_name>` are the tag and property of the destination vertex.

## Reference from edge

### For property

To get properties of an edge, use the following syntax.

```ngql
<edge_type>.<edge_prop>
```

The `<edge_type>` is the type of the edg. The `<edge_prop>` is the property of the edge.

### For Built-in Properties

There are four built-in properties in the edge:

* _src: source vertex ID of the edge
* _dst: destination ID of the edge
* _type: edge type
* _rank: the edge's rank

You can use `_src` and `_dst` to get the starting and ending vertices' ID, and they are very commonly used to show a graph path.

## Examples

```ngql
nebula> GO FROM "player100" OVER follow YIELD $^.player.name AS startName, $$.player.age AS endAge;

+-----------+--------+
| startName | endAge |
+-----------+--------+
| "Tim"     | 36     |
+-----------+--------+
| "Tim"     | 33     |
+-----------+--------+
```

Use the above query to get the name property of the source vertex and the age property of the destination vertex.

```ngql
nebula> GO FROM "player100" OVER follow YIELD follow.degree;

+---------------+
| follow.degree |
+---------------+
| 96            |
+---------------+
| 90            |
+---------------+
```

```ngql
nebula> GO FROM "player100" OVER follow YIELD follow._src, follow._dst, follow._type, follow._rank;

+-------------+-------------+--------------+--------------+
| follow._src | follow._dst | follow._type | follow._rank |
+-------------+-------------+--------------+--------------+
| "player100" | "player101" | 11           | 0            |
+-------------+-------------+--------------+--------------+
| "player100" | "player102" | 11           | 0            |
+-------------+-------------+--------------+--------------+
```

This statement returns all the neighbors of vertex `player100` over edge type `follow`, by referencing `follow._src` as the starting vertex ID (which, of course, is `player100`) and `follow._dst` as the ending vertex ID.
