# String operators

| Name     | Description          |
|:-----    | :------------------: |
| + | concatenating strings |
| CONTAINS | Perform case-sensitive inclusion searching in strings |
(NOT) IN | Whether a value is within a set of values
(NOT) STARTS WITH | Perform case-sensitive matching on the beginning of a string
(NOT) ENDS WITH | Perform case-sensitive matching on the ending of a string
Regular expressions | Perform regular expression matching on a string

> **NOTE**: All the string matchings are case-sensitive.

## Examples

* concatenation (+)

```ngql
nebula> YIELD 'a' + 'b';
+-------+
| (a+b) |
+-------+
| "ab"  |
+-------+
nebula> UNWIND 'a' AS a UNWIND 'b' AS b RETURN a + b;
+-------+
| (a+b) |
+-------+
| "ab"  |
+-------+
```

* CONTAINS

The `CONTAINS` operator requires string type in both left and right side.

```ngql
nebula> GO FROM "player101" OVER serve WHERE $$.team.name CONTAINS "ets" \
YIELD $^.player.name, serve.start_year, serve.end_year, $$.team.name;
+----------------+------------------+----------------+--------------+
| $^.player.name | serve.start_year | serve.end_year | $$.team.name |
+----------------+------------------+----------------+--------------+
| "Tony Parker"  | 1999             | 2018           | "Nuggets"    |
+----------------+------------------+----------------+--------------+

```

```ngql
nebula> GO FROM "player101" OVER serve WHERE (STRING)serve.start_year CONTAINS "19" AND \
$^.player.name CONTAINS "ny" \
YIELD $^.player.name, serve.start_year, serve.end_year, $$.team.name;
+----------------+------------------+----------------+--------------+
| $^.player.name | serve.start_year | serve.end_year | $$.team.name |
+----------------+------------------+----------------+--------------+
| "Tony Parker"  | 1999             | 2018           | "Nuggets"    |
+----------------+------------------+----------------+--------------+
```

```ngql
nebula> GO FROM "player101" OVER serve WHERE !($$.team.name CONTAINS "ets") \
YIELD $^.player.name, serve.start_year, serve.end_year, $$.team.name;
+----------------+------------------+----------------+--------------+
| $^.player.name | serve.start_year | serve.end_year | $$.team.name |
+----------------+------------------+----------------+--------------+
| "Tony Parker"  | 1999             | 2018           | "Spurs"      |
+----------------+------------------+----------------+--------------+
```

* IN

```ngql
nebula> YIELD 1 IN [1,2,3];
+----------------+
| (1 IN [1,2,3]) |
+----------------+
| true           |
+----------------+

nebula> YIELD "Yao" IN ["Yi", "Tim", "Kobe"];
+------------------------+
| (Yao IN [Yi,Tim,Kobe]) |
+------------------------+
| false                  |
+------------------------+

nebula> YIELD NULL in ["Yi", "Tim", "Kobe"]; //TODO(coding)
+-----------------------------+
| (__NULL__ IN [Yi,Tim,Kobe]) |
+-----------------------------+
| NULL                        |
+-----------------------------+
```

* (NOT) STARTS WITH

```ngql
nebula> YIELD 'apple' STARTS WITH 'app';
+-------------------------+
| (apple STARTS WITH app) |
+-------------------------+
| true                    |
+-------------------------+

nebula> YIELD 'apple' STARTS WITH 'a';
+-----------------------+
| (apple STARTS WITH a) |
+-----------------------+
| true                  |
+-----------------------+

nebula> YIELD 'apple' STARTS WITH 'A';
+-----------------------+
| (apple STARTS WITH A) |
+-----------------------+
| false                 |
+-----------------------+

nebula> YIELD 'apple' STARTS WITH 'b';
+-----------------------+
| (apple STARTS WITH b) |
+-----------------------+
| false                 |
+-----------------------+

nebula> YIELD 'apple' NOT STARTS WITH 'app';
+-----------------------------+
| (apple NOT STARTS WITH app) |
+-----------------------------+
| false                       |
+-----------------------------+
```

* (NOT) ENDS WITH

```ngql
nebula> YIELD 'apple' ENDS WITH 'app';
+-----------------------+
| (apple ENDS WITH app) |
+-----------------------+
| false                 |
+-----------------------+

nebula> YIELD 'apple' ENDS WITH 'e';
+---------------------+
| (apple ENDS WITH e) |
+---------------------+
| true                |
+---------------------+

nebula> YIELD 'apple' ENDS WITH 'E';
+---------------------+
| (apple ENDS WITH E) |
+---------------------+
| false               |
+---------------------+

nebula> YIELD 'apple' ENDS WITH 'b';
+---------------------+
| (apple ENDS WITH b) |
+---------------------+
| false               |
+---------------------+
```

* Regular expressions

Nebula Graph supports filtering by using regular expressions. The regular expression syntax is inherited from `st::regex`. You can match on regular expressions by using `=~ 'regexp'`. For example:

```ngql
nebula> YIELD "384748.39" =~ "\\d+(\\.\\d{2})?";
+----------------------------+
| (384748.39=~\d+(\.\d{2})?) |
+----------------------------+
| true                       |
+----------------------------+
```

```ngql
nebula> MATCH (v:player) WHERE v.name =~ 'Tony.*' RETURN v.name;
+---------------+
| v.name        |
+---------------+
| "Tony Parker" |
+---------------+
```

> **NOTE**: Regular expressions **CAN NOT** work with nGQL-extensions (GO/FETCH clause will return syntax error). Use it in openCypher only (e.g., in MATCH-WHERE clause).
