# Quick Start

This guide walks you through the process of using **Nebula Graph**：

- Install
- Data Schema
- CRUD
- Data Import Tools

## Installing Nebula Graph

It is recommended to install Nebula Graph by [docker compose](https://github.com/vesoft-inc/nebula-docker-compose). We have recorded a quick [video tutorial](https://www.youtube.com/watch?v=KVO3vaqeLrA&t=10s) on YouTube for your reference.

In addition to Docker, you can also install **Nebula Graph** by [source code](../../3.build-develop-and-administration/1.build/1.build-source-code.md) or [rpm/deb packages](../../3.build-develop-and-administration/3.deploy-and-administrations/deployment/install-with-rpm-deb.md).

In case you encounter any problem during the installation, be sure to ask us on our [official forum](https://discuss.nebula-graph.io). We have devs on call to answer your questions.

## Data Schema

In this guide, all operations are based on the NBA dataset below:

![image](https://user-images.githubusercontent.com/40747875/69605530-4c83dd00-105b-11ea-9ecf-219af8545b16.png)

In the above figure, there are two tags (**player**, **team**) and two edge types (**serve** and **follow**).

<details>
<summary>Creating and Using a Graph Space</summary>

A graph space in <b>Nebula Graph</b> is similar to an individual database that you create in traditional databases such as MySQL. First, you need to create a space and use it before can do any other operations.

You can create and use a graph space by the following steps:

1. Enter the following statement to create a graph space:

```ngql
nebula> CREATE SPACE nba(partition_num=10, replica_factor=1);
```

<b>Note:</b>

<ul>
<li><code>partition_num</code> specifies the number of partitions in one replica.</li>
<li><code>replica_factor</code> specifies the number of replicas in the cluster.</li>
</ul>

1. Enter the following statement to use the graph space:

```ngql
nebula> USE nba;
```

Now you can check the space you just created by the following statement:

```ngql
nebula> SHOW SPACES;
```

The following information is returned:

```ngql
========
| Name |
========
| nba  |
--------
```

</details>

<details>
<summary>Defining the Schema for Your Data</summary>

In <b>Nebula Graph</b>, we classify different vertices with similar properties into one group which is named a tag. The <code>CREATE TAG</code> statement defines a tag with a tag name followed by properties and the property types enclosed in parentheses. The <code>CREATE EDGE</code> statement defines an edge type with a type name, followed by properties and the property types enclosed in parentheses.

You can create tags and edge types by the following steps:

1. Enter the following statement to create the <b>player</b> tag:

```ngql
nebula> CREATE TAG player(name string, age int);
```

2. Enter the following statement to create the <b>team</b> tag:

```ngql
nebula> CREATE TAG team(name string);
```

3. Enter the following statement to create the <b>follow</b> edge type:

```ngql
nebula> CREATE EDGE follow(degree int);
```

4. Enter the following statement to create the <b>serve</b> edge type:

```ngql
nebula> CREATE EDGE serve(start_year int, end_year int);
```

Now you can check the tags and edge types you just created.

To show the tags you just created, enter the following statement:

```ngql
nebula> SHOW TAGS;
```

The following information is returned:

```ngql
============
| Name     |
============
| player   |
------------
| team     |
------------
```

To show the edge types you just created, enter the following statement:

```ngql
nebula> SHOW EDGES;
```

The following information is returned:

```ngql
==========
| Name   |
==========
| serve  |
----------
| follow |
----------
```

To show the properties of the <b>player</b> tag, enter the following statement:

```ngql
nebula> DESCRIBE TAG player;
```

The following information is returned:

```ngql
===================
| Field  | Type   |
===================
| name   | string |
-------------------
| age    | int    |
-------------------
```

To show the properties of the <b>follow</b> edge type, enter the following statement:

```ngql
nebula> DESCRIBE EDGE follow;
```

The following information is returned:

```ngql
=====================
| Field    | Type   |
=====================
| degree   | int    |
---------------------
```

</details>

## CRUD

<details>
<summary>Inserting Data</summary>

You can insert vertices and edges based on relations in the [illustration figure](#overview).

<h4>Inserting Vertices</h4>

The <code>INSERT VERTEX</code> statement inserts a vertex by specifying the vertex tag, properties, vertex ID and property values.

You can insert some vertices by the following statements:

```ngql
nebula> INSERT VERTEX player(name, age) VALUES 100:("Tim Duncan", 42);
nebula> INSERT VERTEX player(name, age) VALUES 101:("Tony Parker", 36);
nebula> INSERT VERTEX player(name, age) VALUES 102:("LaMarcus Aldridge", 33);
nebula> INSERT VERTEX team(name) VALUES 200:("Warriors");
nebula> INSERT VERTEX team(name) VALUES 201:("Nuggets");
nebula> INSERT VERTEX player(name, age) VALUES 121:("Useless", 60);
```

<b>Note:</b>

<ol>
<li>In the above vertices inserted, the number after the keyword `VALUES` is the vertex ID (abbreviated for `VID`). The `VID` must be unique in the space.</li>

<li>The last vertex inserted will be deleted in the [deleting data](#deleting-data) section.</li>

<li>If you want to insert multiple vertices for the same tag by a single `INSERT VERTEX` operation, you can enter the following statement:</li>
</ol>

```ngql
nebula> INSERT VERTEX player(name, age) VALUES 100:("Tim Duncan", 42), \
101:("Tony Parker", 36), 102:("LaMarcus Aldridge", 33);
```

<h4>Inserting Edges</h4>

The <code>INSERT EDGE</code> statement inserts an edge by specifying the edge type name, properties, source vertex ID and target vertex ID, and property values.

You can insert some edges by the following statements:

```ngql
nebula> INSERT EDGE follow(degree) VALUES 100 -> 101:(95);
nebula> INSERT EDGE follow(degree) VALUES 100 -> 102:(90);
nebula> INSERT EDGE follow(degree) VALUES 102 -> 101:(75);
nebula> INSERT EDGE serve(start_year, end_year) VALUES 100 -> 200:(1997, 2016);
nebula> INSERT EDGE serve(start_year, end_year) VALUES 101 -> 201:(1999, 2018);

```

<b>Note:</b> If you want to insert multiple edges for the same edge type by a single <code>INSERT EDGES</code> operation, you can enter the following statement:

```ngql
INSERT EDGE follow(degree) VALUES 100 -> 101:(95),100 -> 102:(90),102 -> 101:(75);
```

<h4>Fetching Data</h4>

After you insert some data in <b>Nebula Graph</b>, you can retrieve any data from your graph space.

The <code>FETCH PROP ON</code> statement retrieve data from your graph space. If you want to fetch vertex data, you must specify the vertex tag and vertex ID; if you want to fetch edge data, you must specify the edge type name, source vertex ID and target vertex ID.

To fetch the data of the player whose <code>VID</code> is <code>100</code>, enter the following statement:

```ngql
nebula> FETCH PROP ON player 100;
```

The following information is returned:

```ngql
=======================================
| VertexID | player.name | player.age |
=======================================
| 100      | Tim Duncan  | 42         |
---------------------------------------
```

To fetch the data of the <b>serve</b> edge between <code>VID 100</code> and <code>VID 200</code>, enter the following statement:

```ngql
nebula> FETCH PROP ON serve 100 -> 200;
```

The following information is returned:

```ngql
=============================================================================
| serve._src | serve._dst | serve._rank | serve.start_year | serve.end_year |
=============================================================================
| 100        | 200        | 0           | 1997             | 2016           |
-----------------------------------------------------------------------------
```

<h4>Batch Inserting</h4>

To insert multiple data, you can put all the DDL (Data Definition Language) statements in a <code>.ngql</code> file as follows.

```ngql
CREATE SPACE nba(partition_num=10, replica_factor=1);
USE nba;
CREATE TAG player(name string, age int);
CREATE TAG team(name string);
CREATE EDGE follow(degree int);
CREATE EDGE serve(start_year int, end_year int);
```
<ul>
<li>If you are using <b>Nebula Graph</b> by docker-compose, you can batch write to console by the following command:</li>

```bash
$ cat nba.ngql | sudo docker run --rm -i --network=host \
vesoft/nebula-console:nightly --addr=127.0.0.1 --port=3699
```

<li>If you install **Nebula Graph** by compiling the source code, you can batch write to console by the following command:</li>

```bash
$ cat schema.ngql | ./bin/nebula -u user -p password
```

<b>Note:</b>

<ul>
<li>You must change the IP address and the port number to yours.</li>

<li>You can download the `nba.ngql` file [here](https://nebula-graph.oss-accelerate.aliyuncs.com/doc/nba.ngql).</li>
</details>

<details>
<summary>Deleting Data</summary>

If you have some data that you do not need, you can delete it from your graph space.

<h4>Deleting Vertices</h4>

You can delete any vertex from your graph space. The <code>DELETE VERTEX</code> statement deletes a vertex by specifying the vertex ID.

To delete a vertex whose <code>VID</code> is <code>121</code>, enter the following statement:

```ngql
nebula> DELETE VERTEX 121;
```

To check whether the vertex is deleted, enter the following statement;

```ngql
nebula> FETCH PROP ON player 121;
```

The following information is returned:

```ngql
Execution succeeded (Time spent: 1571/1910 us)
```

<b>Note:</b> The above information with an empty return result indicates the query operation is successful but no data is queried from your graph space because the data is deleted.

<h4>Deleting Edges</h4>

You can delete any edge from your graph space. The <code>DELETE EDGE</code> statement deletes an edge by specifying the edge type name and the source vertex ID and target vertex ID.

To delete a <b>follow</b> edge between VID 100 and VID 200, enter the following statement:

```ngql
nebula> DELETE EDGE follow 100 -> 200;
```

<b>Note:</b> If you delete a vertex, all the out-going and in-coming edges of this vertex are deleted.
</details>

<details>
<summary>Updating Data</summary>

You can update the vertices and edges you just inserted.

<h4>Updating Vertices</h4>

The <code>UPDATE VERTEX</code> statement updates data for your vertex by selecting the vertex that you want to update and then setting the property value with an equal sign to assign it a new value.

The following example shows you how to change the <code>name</code> value of <code>VID 100</code> from <code>Tim Duncan</code> to <code>Tim</code>.

Enter the following statement to update the <code>name</code> value:

```ngql
nebula> UPDATE VERTEX 100 SET player.name = "Tim";
```

To check whether the <code>name</code> value is updated, enter the following statement:

```ngql
nebula> FETCH PROP ON player 100;
```

The following information is displayed:

```ngql
=======================================
| VertexID | player.name | player.age |
=======================================
| 100      | Tim         | 42         |
---------------------------------------
```

<h4> Updating Edges</h4>

The <code>UPDATE EDGE</code> statement updates data for your edge by specifying the source vertex ID and the target vertex ID of the edge and then setting the property value with an equal sign to assign it a new value.

The following example shows you how to change the value of the <code>degree</code> property in the <b>follow</b> edge between <code>VID 100</code> and <code>VID 101</code>. Now we change the <code>degree</code> property from <code>95</code> to <code>96</code>.

Enter the following statement to update the <code>degree</code> value:

```ngql
nebula> UPDATE EDGE 100 -> 101 OF follow SET degree = 96;
```

To check whether the <code>degree</code> value is updated, enter the following statement:

```ngql
nebula> FETCH PROP ON follow 100 -> 101;
```

The following information is returned:

```ngql
============================================================
| follow._src | follow._dst | follow._rank | follow.degree |
============================================================
| 100         | 101         | 0            | 96            |
------------------------------------------------------------
```

</details>

<details>
<summary>Sample Queries</summary>

This section gives more query examples for your reference.

<h4>Example 1: Find the vertices that `VID` `100` follows.</h4>

Enter the following statement:

```ngql
nebula> GO FROM 100 OVER follow;
```

The following information is returned:

```ngql
===============
| follow._dst |
===============
| 101         |
---------------
| 102         |
---------------
```

<h4>Example 2: Find the vertex that `VID` `100` follows, whose age is greater than `35`.</h4>

Return his name and age, and set the column names to <b>Teammate</b> and <b>Age</b> respectively.

Enter the following statement:

```ngql
nebula> GO FROM 100 OVER follow WHERE $$.player.age >= 35 \
YIELD $$.player.name AS Teammate, $$.player.age AS Age;
```

The following information is returned:

```ngql
=====================
| Teammate    | Age |
=====================
| Tony Parker | 36  |
---------------------
```

<b>Note:</b>

<ul>
<li><code>YIELD</code> specifies what values or results you want to return from the query.</li>
<li><code>$$</code> represents the target vertex.</li>
<li><code>\</code> represents a line break.</li>

<h4> Example 3: Find the team which is served by the player who is followed by `100`.</h4>

There are two ways to get the same result. First, we can use a <code>pipe</code> to retrieve the team. Then we use a <code>temporary variable</code> to retrieve the same team.

Enter the following statement with a <code>pipe</code>:

```ngql
GO FROM 100 OVER follow YIELD follow._dst AS id | \
GO FROM $-.id OVER serve YIELD $$.team.name \
AS Team, $^.player.name AS Player;
```

The following information is returned.

```ngql
===============================
| Team    | Player            |
===============================
| Nuggets | Tony Parker       |
-------------------------------
```

Enter the following statement with a <code>temporary variable</code>:

```ngql
$var=GO FROM 100 OVER follow YIELD follow._dst AS id; \
GO FROM $var.id OVER serve YIELD $$.team.name \
AS Team, $^.player.name AS Player;
```

The following information is returned.

```ngql
===============================
| Team    | Player            |
===============================
| Nuggets | Tony Parker       |
-------------------------------
```

<br>Note:<br>
<ul>
<li><code>$^</code> represents the source vertex.</li>
<li><code>|</code> denotes a pipe. The output of the previous query acts as an input to the next query.</li>
<li><code>$-</code> refers to the input stream.</li>
<li>The second approach adopts a user-defined variable `$var`. The scope of this variable is within the compound statement.</li>
</details>

### Data Import Tools

 If you have millions of records to insert, you can try the following ways:

 1. Import data via CSV files with [go-importer](https://github.com/vesoft-inc/nebula-importer).

 1. Import data from other data repositories such as HDFS and HIVE with [Spark Writer](https://docs.nebula-graph.io/manual-EN/3.build-develop-and-administration/3.deploy-and-administrations/server-administration/storage-service-administration/data-import/spark-writer/).

 Again, if you come across any problem following the steps in this guide, please head over to our [official forum](https://discuss.nebula-graph.io) and our on-call devs are more than happy to answer your questions!

 Finish the steps in this guide and feel Nebula Graph is good? Please [star us on GitHub](https://github.com/vesoft-inc/nebula) and make our day! 
