# MATCH

The `MATCH` statement provides the searching ability based on pattern matching.

A `MATCH` statement defines a search pattern and uses it to match data stored in the Nebula Graph database, and return the data in the form defined in the `RETURN` clause. It is often used together with a `WHERE` clause that adds conditions as a supplement of the search pattern.

## Syntax

The syntax of `MATCH` is relatively more flexible compared with that of other query statements such as `GO` or `LOOKUP`. But generally, it can be summarized as follows.

```nGQL
MATCH <pattern> [WHERE clause] <RETURN clause>
```

## Patterns and WHERE clauses

The MATCH patterns, with the help of curly brackets ("{}"), can do the same thing with `WHERE` Clauses when making equality comparisons. You may find an example as follows.

```nGQL
nebula> MATCH (v:player) WHERE v.name == "Tim" RETURN v.age AS Age
+-----+
| Age |
+-----+
| 42  |
+-----+
Got 1 rows (time spent 2849/3256 us)

nebula> MATCH (v:player {name: "Tim"}) RETURN v.age AS Age;
+-----+
| Age |
+-----+
| 42  |
+-----+
Got 1 rows (time spent 1924/2673 us)
```

But besides equality comparisons, `WHERE` clauses can do a lot more than patterns in curly brackets. For more information, see [WHERE](TODO) [TODO].

## Must-read for using MATCH

The `MATCH` statement is based on indexes. While parsing a `MATCH` statement, [TODO: to be confirmed]

## Match on vertex properties

Search for vertices with properties matching a certain pattern:

* Example 1: Search for an age and return the names of players with that age. 

    ```nGQL
    nebula> > MATCH (v:player {age: 36}) return v.name AS Name
    +-------------+
    | Name        |
    +-------------+
    | Tony Parker |
    +-------------+
    Got 1 rows (time spent 2849/3256 us)
    ```

* Example 2: Search for the players whose age are older than 30 and whose name starts with "T".

    ```nGQL
    nebula> MATCH (v:player) WHERE v.age > 30 AND v.name STARTS WITH "T" return v.name AS Name, v.age as Age;
    +-------------+-----+
    | Name        | Age |
    +-------------+-----+
    | Tony Parker | 36  |
    +-------------+-----+
    | Tim         | 42  |
    +-------------+-----+
    Got 2 rows (time spent 2407/3244 us)
    ```

## MATCH on edge types

### One-hop MATCH

[TODO]

## Two-hop MATCH

[TODO]
