# Nebula Graph Query Language (nGQL)

This document gives an introduction to the query language of Nebula Graph, nGQL.

## What is nGQL

nGQL is a declarative graph query language for Nebula Graph. It allows expressive and efficient graph patterns. nGQL is designed for both developers and operations professionals. nGQL is an SQL-like query language, so it's easy to learn. nGQL is a project in progress. New features and optimizations are done steadily. There can be differences between syntax and implementation. Nebula Graph 2.0 or later version support [openCypher 9](https://www.opencypher.org/resources).

## What can nGQL do

- Supports graph traverse
- Supports pattern match
- Supports aggregation
- Supports graph mutation
- Supports access control
- Supports composite queries
- Supports index
- Supports most openCypher 9 graph query syntax (but mutations and controls syntax are not supported).

## Example Data

The example data in Nebula Graph document statements can be downloaded [here](../../basketballplayer-2.X.ngql). After downloading the example data, you can import it to Nebula Graph by using the `-f` option in [Nebula Graph Console](../../2.quick-start/3.connect-to-nebula-graph.md).

## Placeholder Identifiers and Values

Refer to the following standards in nGQL:

- ISO/IEC 10646
- ISO/IEC 39075
- ISO/IEC NP 39075 (Draft)
- OpenCypher 9

In template code, any token that is not a keyword, a literal value, or punctuation is a placeholder identifier or a placeholder value.

For details of the symbols in nGQL syntax, see the following table:

|  Token | Meaning  |
|  ----  | ----  |
| < >    | name of a syntactic element |
| ::=    | formula that defines an element |
| [ ]    | optional elements |
| { }    | explicitly specified elements |
|  \|    | complete alternative elements |
| ...    |  may be repeated any number of times |

## About openCypher compatibility

### Native nGQL and openCypher 

`Native nGQL` is the part of a graph query language designed and implemented by Nebula Graph.

OpenCypher is a graph query language maintained by openCypher Implementers Group. And the latest version is openCypher 9.

The compatible parts of openCypher in nGQL are called `openCypher compatible sentences` (short as openCypher). 

!!! Note

`nGQL` = `native nGQL` + `openCypher compatible sentences`.

???+ faq "Is nGQL compatible with openCypher 9?"

    nGQL is partially compatible with openCypher 9.
    Known incompatible items are listed in [Nebula Graph Issues](https://github.com/vesoft-inc/nebula-graph/issues?q=is%3Aissue+is%3Aopen+label%3Aincompatible). Submit an issue with the `incompatible` tag if you find a new issue of this type. You can search in this manual with the keyword `compatibility` to find major compatibility issues.

    The following are some major differences (by design incompatible) between nGQL and openCypher.

    | openCypher 9 | nGQL |
    | - | - |
    | schema optional | strong schema |
    | equality operator '=' |  equality operator '==' |
    | math exponentiation `^` | `^` not supported. Use pow(x, y) instead. |  
    | no such concept | edge rank (reference by @) |
    | all DMLs (`CREATE`, `MERGE`, etc), and `OPTIONAL MATCH` are not supported.  |

    [OpenCypher](http://www.opencypher.org/) 9 and [Cypher](https://neo4j.com/developer/cypher/) have some differences (in grammar and licence). For example, Cypher requires that **All Cypher statements are explicitly run within a transaction**. While openCypher has no such requirement of `transaction`. And nGQL does not support transaction.

???+ faq "Where can I find more nGQL examples?"

    Find more than **2500** nGQL examples in the [features directory](https://github.com/vesoft-inc/nebula-graph/tree/master/tests/tck/features) on the Nebula Graph GitHub page.

    The `features` directory consists of `.feature` files. Each file records scenarios that you can use as nGQL examples.

    Here is an example:

    ```text
    Feature: Match seek by tag

      Background: Prepare space
        Given a graph with space named "basketballplayer"

      Scenario: seek by empty tag index
        When executing query:
          """
          MATCH (v:bachelor)
          RETURN id(v) AS vid
          """
        Then the result should be, in any order:
          | vid          |
          | 'Tim Duncan' |
        And no side effects
        When executing query:
          """
          MATCH (v:bachelor)
          RETURN id(v) AS vid, v.age AS age
          """
        Then the result should be, in any order:
          | vid          | age |
          | 'Tim Duncan' | 42  |
        And no side effects
    ```

    The keywords in the preceding example are described as follows:

    |Keyword|Description|
    |-|-|
    |`Feature`|Describes the topic of the current `.feature` file.|
    |`Background`|Describes the background information of the current `.feature` file.|
    |`Given`|Describes the prerequisites of running the test statements in the current `.feature` file.|
    |`Scenario`|Describes the purpose of the scenario. If there is the `@skip` before `Scenario`, this scenario may not work and don't use it as a working example.|
    |`When`|Describes the nGQL statement to be executed.|
    |`Then`|Describes the expected result of running the statement in the `When` clause. If the result in your environment does not match the result described in the `.feature` file, submit an [issue](https://github.com/vesoft-inc/nebula-graph/issues) to inform     the Nebula Graph team.|
    |`And`|Describes the side effects of running the statement in the `When` clause.|
    | @skip | This test case will be skipped. Commonly, the to-be-tested code is not ready. |

    Welcome to [add more practical scenarios](../15.contribution/how-to-contribute.md) and become a Nebula Graph contributor.

???+ faq "Does it support TinkerPop Gremlin?"

    No. And no plan to support that.

## About Data Model

???+ faq "Does Nebula Graph support W3C RDF (SPARQL), or GraphQL?"

    No. And no plan to support that.

    Nebula Graph's data model is the property graph, and it is a strong schema system.

    It doesn't support rdf.

    Nebula Graph Query Language does not support `SPARQL` nor `GraphQL`.
